{
    "url": "https://www.kickstarter.com/projects/airthereal/airthereal-revive-r800-5l-wifi-smart-kitchen-composter/comments",
    "comments": [
        {
            "poster": "Airthereal",
            "comment": "Good suggestion!",
            "timestamp": "1741829320",
            "is_creator": true
        },
        {
            "poster": "Alena Lane",
            "comment": "What are the dimensions of the composter?",
            "timestamp": "1739834852",
            "is_creator": false
        },
        {
            "poster": "Airthereal",
            "comment": "The dimensions of the composter are approximately 13.78\" x 12.20\" x 14.17\".",
            "timestamp": "1739875567",
            "is_creator": true
        },
        {
            "poster": "Airthereal",
            "comment": "Good news for you: our Canadian inventory is already locked and loaded, so there is no funny business here! 🍁🚚",
            "timestamp": "1739861939",
            "is_creator": true
        },
        {
            "poster": "Airthereal",
            "comment": "Great question! Thanks for bringing this up. 😊",
            "timestamp": "1740017651",
            "is_creator": true
        },
        {
            "poster": "Airthereal",
            "comment": "The product design has been finalized based on extensive feedback from users of our previous-generation products and early testers during development. That said, your input remains incredibly valuable to us! We’re always eager to hear suggestions for software improvements, machine enhancements, accessories, or even entirely new concepts.",
            "timestamp": "1740017651",
            "is_creator": true
        },
        {
            "poster": "Airthereal",
            "comment": "Thank you for being part of this journey—your voice truly matters.",
            "timestamp": "1740017651",
            "is_creator": true
        },
        {
            "poster": "Airthereal",
            "comment": "Hi Jesse, thanks for your support! The Revive Magic Compost Starter is available as an add-on for $24. One pack lasts about 2 months with daily use of a 20ml scoop. Hope this info helps!",
            "timestamp": "1740017546",
            "is_creator": true
        },
        {
            "poster": "Airthereal",
            "comment": "Thanks for your question! Great point about affordability—we totally get it! 😊",
            "timestamp": "1740022777",
            "is_creator": true
        },
        {
            "poster": "Airthereal",
            "comment": "Our compost starter is a custom blend designed specifically for optimal performance in our Airthereal electric composter. It helps kickstart the breakdown process efficiently, reduces odors, and accelerates decomposition, especially in the heat and dry conditions of an electric composter. While it’s not something you’ll find off the shelf, we’ve worked hard to keep costs reasonable while ensuring the best results.",
            "timestamp": "1740022777",
            "is_creator": true
        },
        {
            "poster": "Airthereal",
            "comment": "That said, if you're exploring alternatives, here are some key things to consider when choosing a compost starter for an electric composter:",
            "timestamp": "1740022777",
            "is_creator": true
        },
        {
            "poster": "Airthereal",
            "comment": "1. Heat-Resistant Microbes – Since electric composters use heat to speed up decomposition, choose a starter with thermophilic (heat-loving) microbes that can survive in warm, dry conditions.",
            "timestamp": "1740022777",
            "is_creator": true
        },
        {
            "poster": "Airthereal",
            "comment": "2. Low Moisture Sensitivity – Many traditional compost starters work best in outdoor, high-moisture conditions. For electric composters, look for microbes that remain active in drier environments.",
            "timestamp": "1740022777",
            "is_creator": true
        },
        {
            "poster": "Airthereal",
            "comment": "3. Bokashi Bran or EM (Effective Microorganisms) – Bokashi bran contains beneficial microbes that aid decomposition, though it works best in anaerobic (low-oxygen) environments, so results may vary.",
            "timestamp": "1740022777",
            "is_creator": true
        },
        {
            "poster": "Airthereal",
            "comment": "4. Enzyme-Based Starters – Some compost starters use enzymes to break down food waste faster, making them a good fit for electric composters with short cycles.",
            "timestamp": "1740022777",
            "is_creator": true
        },
        {
            "poster": "Airthereal",
            "comment": "5. Odor Control & Eco-Friendliness – A good starter should help minimize smells and be made from natural, non-toxic ingredients.",
            "timestamp": "1740022777",
            "is_creator": true
        },
        {
            "poster": "Airthereal",
            "comment": "Many customers with our previous-generation composters have experimented with products like Jobe’s Organics Compost Starter. While Jobe’s is great for traditional composting, it’s not specifically designed for the heat and dryness of electric composters. It works better as a finishing touch after the composting process rather than during it.",
            "timestamp": "1740022777",
            "is_creator": true
        },
        {
            "poster": "Airthereal",
            "comment": "We’re always looking at ways to improve accessibility and affordability, so your feedback is super helpful! If bulk options or alternatives become available in the future, we’ll be sure to update everyone. Let us know if you have any other questions—we’re happy to help!",
            "timestamp": "1740022777",
            "is_creator": true
        },
        {
            "poster": "Sander Noormägi",
            "comment": "Consider making EU version, please!",
            "timestamp": "1739798585",
            "is_creator": false
        },
        {
            "poster": "Airthereal",
            "comment": "Hi Sander, we hear you loud and clear. Stay tuned, and thanks for the suggestion!",
            "timestamp": "1739798946",
            "is_creator": true
        }
    ]
}