{
    "url": "https://www.kickstarter.com/projects/circular-ring/circular-ring-2-worlds-most-advanced-health-tracking-ring/comments",
    "comments": [
        {
            "poster": "Circular",
            "comment": "How can I determine the ring size that fits my wife and me, what color can we choose, and when do you think it will arrive in the UK?",
            "timestamp": "1741598438",
            "is_creator": false
        },
        {
            "poster": "Circular",
            "comment": "Thanks",
            "timestamp": "1741598438",
            "is_creator": false
        },
        {
            "poster": "Circular",
            "comment": "Hi Christian,",
            "timestamp": "1741598438",
            "is_creator": true
        },
        {
            "poster": "Circular",
            "comment": "You can determine your ring finger with this tool: https://sizing.circular.care/",
            "timestamp": "1741598438",
            "is_creator": true
        },
        {
            "poster": "Circular",
            "comment": "You can also go to any jeweler and ask to measure your finger. The Circular Rings follow standard ring sizes.",
            "timestamp": "1741598438",
            "is_creator": true
        },
        {
            "poster": "Circular",
            "comment": "The choice of size and color happens after the campaign ends.",
            "timestamp": "1741598438",
            "is_creator": true
        },
        {
            "poster": "Circular",
            "comment": "Shipping starts in June, so you may have it between June/July.",
            "timestamp": "1741598438",
            "is_creator": true
        },
        {
            "poster": "dom",
            "comment": "I bought a ring a year ago and it didn't work properly until it stopped working at all. Following support's advice, I returned the ring and asked for a refund. Since then I have been waiting for the refund and the response I have received from support is that they are actively working on it and that it will be soon. I see many similar reports on various websites. Is this the new support they talk about? and will this new ring work better and give readings with some accuracy? When do you plan to resolve these issues with your customers?",
            "timestamp": "1742453344",
            "is_creator": false
        },
        {
            "poster": "Mathilde Lea",
            "comment": "This is a memorial for our Apple Watches. Comment below if you can’t way to bury your Apple Watch: ⬇️ 🪦",
            "timestamp": "1742450799",
            "is_creator": false
        },
        {
            "poster": "Mathilde Lea",
            "comment": "RIP to my $800 Apple Watch (I got one of those fancy no scratch metal cages too. 🫣💸 One of my not so smart moments …",
            "timestamp": "1742450799",
            "is_creator": false
        },
        {
            "poster": "Greg",
            "comment": "Could you tell us more about the pricing by color at lunch? Why is the pricing so different from version to version aren't they all made from titanium? And is the pricing going to change for backers based on the color?",
            "timestamp": "1742428371",
            "is_creator": false
        },
        {
            "poster": "Greg",
            "comment": "Thanks a lot ☺️",
            "timestamp": "1742428371",
            "is_creator": false
        },
        {
            "poster": "Joerg Schumacher",
            "comment": "Would be cool to track your cholesterol within the app by manually input.",
            "timestamp": "1742428367",
            "is_creator": false
        },
        {
            "poster": "Francisco Pacheco",
            "comment": "Are the sizes the same as the Oura ring? I fit in a 12 for Oura but the sizing site says I'm a 10...Too big of a difference there....",
            "timestamp": "1742424945",
            "is_creator": false
        },
        {
            "poster": "Gassama mohamed",
            "comment": "Can data be synchronized with Apple health?",
            "timestamp": "1742423475",
            "is_creator": false
        },
        {
            "poster": "James Sanderson",
            "comment": "I cancelled my backing then rebacked today, I paid for the early deal (3$) weeks ago but what I am praying for is blood sugar monitoring, how close are you to providing that as an accurate guide to blood sugar?",
            "timestamp": "1742416860",
            "is_creator": false
        },
        {
            "poster": "Melissa Gummo",
            "comment": "I am most excited about the possibility of blood pressure monitoring. I recently had a syncopal episode which caused me to faint it pass out resulting in a concussion and all of my testing has been normal. I would love to be able to easily track any blood pressure drops that may have been the cause of that happening.",
            "timestamp": "1742406258",
            "is_creator": false
        },
        {
            "poster": "Matthias Bastuck",
            "comment": "\"One Ring to rule them all, One Ring to find them, One Ring to bring them all, and in the ~darkness~ / perfect health bind them.\"",
            "timestamp": "1742405641",
            "is_creator": false
        },
        {
            "poster": "James",
            "comment": "Is it possible to disable the AI features?",
            "timestamp": "1742398350",
            "is_creator": false
        },
        {
            "poster": "Circular",
            "comment": "There is no obligation to use it at all actually! You can prompt it to get a daily recommendation but you can decide not to activate that feature in the first place, yes :)",
            "timestamp": "1742405320",
            "is_creator": true
        },
        {
            "poster": "James",
            "comment": "Fantastic, thanks for the clarification!",
            "timestamp": "1742405545",
            "is_creator": false
        },
        {
            "poster": "Fred",
            "comment": "Hey there! I've take note you've removed the vibrating motor, such a shame! A lot of people in the community would love to see it back in the next version! I hope you'll take that in consideration. In the meantime, is there still a way to analyze recent sleep data to know the best time to set a separate alarm clock for a refreshing wake-up?",
            "timestamp": "1742393017",
            "is_creator": false
        },
        {
            "poster": "Stanley",
            "comment": "I like the heart monitoring functions best, recommended by my own cardiologist to use the CR2 once available :D",
            "timestamp": "1742386398",
            "is_creator": false
        },
        {
            "poster": "Circular",
            "comment": "Awesome! We're super happy about the ECG an the new functions around it. Can't wait for you to try it :)",
            "timestamp": "1742390062",
            "is_creator": true
        },
        {
            "poster": "Doszpoth Tamás",
            "comment": "Dear creator, I would like to inquire which hand is best to put the ring on again, where do you get the most accurate data? Regards Max",
            "timestamp": "1742383906",
            "is_creator": false
        },
        {
            "poster": "Circular",
            "comment": "Hey Max! If your question is about which hand is best, then we usually recommend wearing the ring on the non dominant hand (less movements on average). That being said you'll get good signals from the dominant hand too :)",
            "timestamp": "1742384833",
            "is_creator": true
        },
        {
            "poster": "Greg",
            "comment": "that's an interesting question. i was planning on wearing it on my dominant hand because my wedding ring is on the non-dominant hand and if i wore it on the middle finger on that hand, i dont want them banging into each other, would probably be annoying. as long as its good to wear on my dominant hand, that's fine.",
            "timestamp": "1742419017",
            "is_creator": false
        },
        {
            "poster": "Doszpoth Tamás",
            "comment": "Thanks! .-)",
            "timestamp": "1742451372",
            "is_creator": false
        },
        {
            "poster": "Wil Dieteren",
            "comment": "I tried the https://sizing.circular.care/ tool and managed to take a photo, however the web page got stuck on the \"We are...\" calculating page. Is there an issue with the tool or is it not live yet?",
            "timestamp": "1742383567",
            "is_creator": false
        },
        {
            "poster": "Circular",
            "comment": "Hi Will, we just tested and evey thing should be functional! Could you try another browser on your phone, just to make sure? Thanks !",
            "timestamp": "1742384169",
            "is_creator": true
        },
        {
            "poster": "Wil Dieteren",
            "comment": "I will try but it just want to note that it took some doing getting the photo. I assume that the sizing kit for the V1 version of the ring can not be used, correct?",
            "timestamp": "1742385873",
            "is_creator": false
        },
        {
            "poster": "Circular",
            "comment": "You actually can, inner dimensions are the same (standard ring sizes), so you can order the same size :)",
            "timestamp": "1742386026",
            "is_creator": true
        },
        {
            "poster": "Circular",
            "comment": "Always good to confirm with the digital sizer though!",
            "timestamp": "1742386026",
            "is_creator": true
        },
        {
            "poster": "kuro",
            "comment": "Regarding the battery life, why not increase the battery size for rings that are larger in diameter? I know that the hardware is finalized, but it's an option for future.",
            "timestamp": "1742382597",
            "is_creator": false
        },
        {
            "poster": "Circular",
            "comment": "Hey Kuro, thanks for the suggestion. We already optimize size and batteries as much as possible and we know how important it is to have a long lasting device. We'll make sure to always have the most up to date technologies and space optimization :)",
            "timestamp": "1742384485",
            "is_creator": true
        },
        {
            "poster": "Jacky van Esch",
            "comment": "Circular, does your answer imply that you already use bigger batteries in larger rings and if so what is the difference?",
            "timestamp": "1742386984",
            "is_creator": false
        },
        {
            "poster": "Cédric BARBOUX",
            "comment": "The feature of the Circular Ring 2 that I look forward to the most is its ability to be used as a marriage proposal ring, so the golden model is beautiful and looks like a real jewel.",
            "timestamp": "1742379536",
            "is_creator": false
        },
        {
            "poster": "Circular",
            "comment": "That would be a great idea ! We like the gold one too to be honest :)",
            "timestamp": "1742384376",
            "is_creator": true
        },
        {
            "poster": "kuro",
            "comment": "Hello, I am super excited about the no subscription feature. I believe that the team has gained enough experience to deliver the promises to the dot. Thank you Circular.",
            "timestamp": "1742368731",
            "is_creator": false
        },
        {
            "poster": "Circular",
            "comment": "Hi Kuro,",
            "timestamp": "1742374309",
            "is_creator": true
        },
        {
            "poster": "Circular",
            "comment": "Thank you for your trust! We’re excited to bring this experience to you and are committed to delivering on our promises. Can’t wait for you to try it!",
            "timestamp": "1742374309",
            "is_creator": true
        },
        {
            "poster": "Hannah Dodd",
            "comment": "Living with energy limiting conditions iim really excited about the AI aspect, I'm hoping having continuous O2 monitoring and hrv will help me manage my conditions better so I can regain some of my stamina",
            "timestamp": "1742345564",
            "is_creator": false
        },
        {
            "poster": "Circular",
            "comment": "Hi Hannah,",
            "timestamp": "1742374984",
            "is_creator": true
        },
        {
            "poster": "Circular",
            "comment": "We can't wait for you to meet our AI assistant Kira! We're confident it will be a great tool in your journey to improving your well-being!",
            "timestamp": "1742374984",
            "is_creator": true
        },
        {
            "poster": "Greg",
            "comment": "I'd like to know more about battery life as I've seen conflicting info around the internet the CES 2025 billboard says 6 days, one of the founders says 8 days the Kickstarter campaign says 7 days. I would like to know better about the battery capabilities and whether the numbers refer to the ECO mode or the PRO mode. I'd also love to know more details about the limitations of the ECO mode compared to the PRO.",
            "timestamp": "1742342235",
            "is_creator": false
        },
        {
            "poster": "Greg",
            "comment": "Thanks",
            "timestamp": "1742342235",
            "is_creator": false
        },
        {
            "poster": "Greg",
            "comment": "Thank you for being so patient and answering all my questions.🙏",
            "timestamp": "1742385852",
            "is_creator": false
        },
        {
            "poster": "Circular",
            "comment": "Yes sorry ! You know the product better ;) We changed names around so I got confused:",
            "timestamp": "1742386132",
            "is_creator": true
        },
        {
            "poster": "Circular",
            "comment": "- Performance: every two minutes.",
            "timestamp": "1742386132",
            "is_creator": true
        },
        {
            "poster": "Circular",
            "comment": "- Power: every 5 minutes.",
            "timestamp": "1742386132",
            "is_creator": true
        },
        {
            "poster": "Circular",
            "comment": "Yes, data is the same :)",
            "timestamp": "1742386132",
            "is_creator": true
        },
        {
            "poster": "Greg",
            "comment": "Thanks again 👍👍👍",
            "timestamp": "1742387226",
            "is_creator": false
        },
        {
            "poster": "Tobi",
            "comment": "As a person suffering from tachycardia, I'm excited about the Heartbeat function to track it.",
            "timestamp": "1742335885",
            "is_creator": false
        },
        {
            "poster": "Tobi",
            "comment": "I hope the measurements are good.",
            "timestamp": "1742335885",
            "is_creator": false
        },
        {
            "poster": "Tobi",
            "comment": "Here are 2 questions for you:",
            "timestamp": "1742335885",
            "is_creator": false
        },
        {
            "poster": "Tobi",
            "comment": "1. I'm working in a hospital. So my hands coming in contact with desinfectants. How does the (daily) contacts with these chemicals possibly affects the ring and it's functions?",
            "timestamp": "1742335885",
            "is_creator": false
        },
        {
            "poster": "Tobi",
            "comment": "2. How do I clean the Ring if it became dirty (maybe sticky fluids like juice or some dusty things)?",
            "timestamp": "1742335885",
            "is_creator": false
        },
        {
            "poster": "Tobi",
            "comment": "Thank you for answering!",
            "timestamp": "1742335885",
            "is_creator": false
        },
        {
            "poster": "Circular",
            "comment": "Hi Tobi!",
            "timestamp": "1742384655",
            "is_creator": true
        },
        {
            "poster": "Circular",
            "comment": "Thanks for backing. The arrhythmia feature is FDA cleared, we're pretty confident in the output results. To answer your questions:",
            "timestamp": "1742384655",
            "is_creator": true
        },
        {
            "poster": "Circular",
            "comment": "1. That's not a problem. It's been tested.",
            "timestamp": "1742384655",
            "is_creator": true
        },
        {
            "poster": "Circular",
            "comment": "2‍. In order to clean your ring, use a soft cloth (which comes in the box) or hand wash with mild soap and water on the cloth. It is not recommended to let moisture stagnate between the ring and the finger after wearing the ring if it was in contact with water. Please remove the ring from your finger and dry your finger and the inside of the ring with a cloth before wearing it again.",
            "timestamp": "1742384655",
            "is_creator": true
        },
        {
            "poster": "Firetruck",
            "comment": "Are you saying every time you wash your hands you should remove the ring and thoroughly dry your hand and ring?",
            "timestamp": "1742385684",
            "is_creator": false
        },
        {
            "poster": "Wayne Horne",
            "comment": "I plan to wear the ring on my ring finger as my wedding ring. Will this work?",
            "timestamp": "1742331008",
            "is_creator": false
        },
        {
            "poster": "Circular",
            "comment": "Hi Wayne,",
            "timestamp": "1742377874",
            "is_creator": true
        },
        {
            "poster": "Circular",
            "comment": "Yes, wearing the ring on your ring finger will work as long as it fits snugly and comfortably, no problem!",
            "timestamp": "1742377874",
            "is_creator": true
        },
        {
            "poster": "Wayne Horne",
            "comment": "Thanks for the quick feedback!",
            "timestamp": "1742381375",
            "is_creator": false
        },
        {
            "poster": "Erin Souza",
            "comment": "I am really looking forward to this reaching 1.5 million and having the blood pressure feature. Hoping it's really accurate!",
            "timestamp": "1742330660",
            "is_creator": false
        },
        {
            "poster": "Circular",
            "comment": "Hi Erin,",
            "timestamp": "1742378124",
            "is_creator": true
        },
        {
            "poster": "Circular",
            "comment": "We're excited too, the blood pressure feature is a big milestone! We hope we reach the goal so you can experience it soon!",
            "timestamp": "1742378124",
            "is_creator": true
        },
        {
            "poster": "Erin Souza",
            "comment": "I am really looking forward to this reaching 1.5 million and having the blood pressure feature. Hoping it's really accurate!",
            "timestamp": "1742330607",
            "is_creator": false
        },
        {
            "poster": "Circular",
            "comment": "Hey Erin! Thanks for backing. Hopfully we should reach it! We're pretty excited about releasing this as well. We use our ecg technology to determine blood pressure estimations in a couple seconds of recording. On a mission to make invasive equipement more easy to use!",
            "timestamp": "1742385116",
            "is_creator": true
        },
        {
            "poster": "Elaine Micallef",
            "comment": "I am mostly looking forward to the women's fertility tracking feature. It would be great if you could team up with an FDA approved app like Natural Cycles (or have something similar maybe in the AI feature) to make the whole experience even better.",
            "timestamp": "1742325318",
            "is_creator": false
        },
        {
            "poster": "Circular",
            "comment": "Hi Elaine,",
            "timestamp": "1742378739",
            "is_creator": true
        },
        {
            "poster": "Circular",
            "comment": "Fertility tracking is a key feature, and we’re always looking at ways to enhance the experience. While we can’t confirm specific integrations yet, our AI assistant is designed to provide valuable insights. We appreciate your support and suggestions!",
            "timestamp": "1742378739",
            "is_creator": true
        }
    ]
}