{
    "url": "https://www.kickstarter.com/projects/ghostfiregaming/companion-quest/comments",
    "comments": [
        {
            "poster": "Brad",
            "comment": "Hello,",
            "timestamp": "1742311524",
            "is_creator": false
        },
        {
            "poster": "Brad",
            "comment": "Do the player mats have designated spots for the cards and dice or is it just a mat with the artwork? They are very cool looking but just wanted to know if they had a function outside of the artwork. Thanks!",
            "timestamp": "1742311524",
            "is_creator": false
        },
        {
            "poster": "Ghostfire Gaming",
            "comment": "Hi Brad, great question. The player mats are primarily to showcase the artwork and provide an enhanced tactile feel to the game. There won't be any card placement design on these mats.",
            "timestamp": "1742350461",
            "is_creator": true
        },
        {
            "poster": "Emmanuel Vandamme BACKING DODO DASH",
            "comment": "Hi.",
            "timestamp": "1742205488",
            "is_creator": false
        },
        {
            "poster": "Emmanuel Vandamme BACKING DODO DASH",
            "comment": "I work in a board game store, and we were wondering if there might be a retailer pledge in your Kickstarter campaign?",
            "timestamp": "1742205488",
            "is_creator": false
        },
        {
            "poster": "Emmanuel Vandamme BACKING DODO DASH",
            "comment": "Thank you.",
            "timestamp": "1742205488",
            "is_creator": false
        },
        {
            "poster": "Ghostfire Gaming",
            "comment": "Hi Emmanuel,",
            "timestamp": "1742250854",
            "is_creator": true
        },
        {
            "poster": "Ghostfire Gaming",
            "comment": "Thanks for reaching out. We're not offering retail pledges through Kickstarter, but if you reach out to sales@ghostfiregaming.com we can provide you with information about retail accounts.",
            "timestamp": "1742250854",
            "is_creator": true
        },
        {
            "poster": "Ghostfire Gaming",
            "comment": "Thanks!",
            "timestamp": "1742250854",
            "is_creator": true
        },
        {
            "poster": "Emmanuel Vandamme BACKING DODO DASH",
            "comment": "Thanks, I just send an email there.",
            "timestamp": "1742279235",
            "is_creator": false
        },
        {
            "poster": "Jason Speicher",
            "comment": "i don't see this asked, can i pledge for 1$ and get access to the PM?",
            "timestamp": "1741622143",
            "is_creator": false
        },
        {
            "poster": "Ghostfire Gaming",
            "comment": "Hi Jason, yes you can certainly do that :)",
            "timestamp": "1741640838",
            "is_creator": true
        },
        {
            "poster": "Ian Agustin",
            "comment": "Hi!",
            "timestamp": "1741495406",
            "is_creator": false
        },
        {
            "poster": "Ian Agustin",
            "comment": "I've seen questions on if the tier 2 pledge and original box will fit sleeved cards so I'm good on that. Just wondering though if I also got the acrylic snack tokens along with the sleeved cards + expansions that come with the pledge, would all of that fit in the original box?",
            "timestamp": "1741495406",
            "is_creator": false
        },
        {
            "poster": "Ghostfire Gaming",
            "comment": "Hi Ian, the acrylic tokens won't fit in the core box that is included in tiers 1, 2, and 3. You'll need to exclude the cardboard tokens from the box in place of the acrylic tokens to have them stored in the box.",
            "timestamp": "1741549665",
            "is_creator": true
        },
        {
            "poster": "Chronicle",
            "comment": "Looks excellent, keen as to give it a crack!",
            "timestamp": "1741405779",
            "is_creator": false
        },
        {
            "poster": "Ghostfire Gaming",
            "comment": "Thanks Chronicle, we can't wait for you to get your hands on it!",
            "timestamp": "1741467356",
            "is_creator": true
        },
        {
            "poster": "Robin Reeve",
            "comment": "Hi,",
            "timestamp": "1741383926",
            "is_creator": false
        },
        {
            "poster": "Robin Reeve",
            "comment": "I see that one is meant to play the different adventures in a campaign, in a given order.",
            "timestamp": "1741383926",
            "is_creator": false
        },
        {
            "poster": "Robin Reeve",
            "comment": "However, could one pick up one adventure as a separate adventure?",
            "timestamp": "1741383926",
            "is_creator": false
        },
        {
            "poster": "Robin Reeve",
            "comment": "Sorry, wrong game !",
            "timestamp": "1741387135",
            "is_creator": false
        },
        {
            "poster": "Ragamuffin Jojo",
            "comment": "Will the dice in the final version actually be yellow? I watched the One Stop Coop Shop review, and the “yellow” dice were orange. Pet peeve of mine! Game looks beautiful though.",
            "timestamp": "1741360666",
            "is_creator": false
        },
        {
            "poster": "Ghostfire Gaming",
            "comment": "Hi Ragamuffin, yes they will be. Unfortunately, due to the prototyping process the dice colors came out differently than we would have liked and are actively working with the manufacturer to ensure all dice colors are easily distinguishable from one another and accessible for players with color limited vision too.",
            "timestamp": "1741379445",
            "is_creator": true
        },
        {
            "poster": "Ghostfire Gaming",
            "comment": "We actually highlighted this in our latest update (Update #3 - What's in Store) if you'd like more information on this topic.",
            "timestamp": "1741379445",
            "is_creator": true
        },
        {
            "poster": "Ghostfire Gaming",
            "comment": "Thank you!",
            "timestamp": "1741379445",
            "is_creator": true
        },
        {
            "poster": "Robin Reeve",
            "comment": "Hi,",
            "timestamp": "1741355447",
            "is_creator": false
        },
        {
            "poster": "Robin Reeve",
            "comment": "I see that there will be French rules in pdf form.",
            "timestamp": "1741355447",
            "is_creator": false
        },
        {
            "poster": "Robin Reeve",
            "comment": "What will be the language dependency of the components (cards, etc.)?",
            "timestamp": "1741355447",
            "is_creator": false
        },
        {
            "poster": "Ghostfire Gaming",
            "comment": "Hi Robin, that's correct.",
            "timestamp": "1741379757",
            "is_creator": true
        },
        {
            "poster": "Ghostfire Gaming",
            "comment": "Text on cards ranges from a few words to one sentence, and use accessible language (no big complicated words or hard to understand terminology).",
            "timestamp": "1741379757",
            "is_creator": true
        },
        {
            "poster": "Ghostfire Gaming",
            "comment": "We hope this helps, please let us know if you have any more questions on this topic :)",
            "timestamp": "1741379757",
            "is_creator": true
        },
        {
            "poster": "Robin Reeve",
            "comment": "Thanks for the precisions.",
            "timestamp": "1741383824",
            "is_creator": false
        },
        {
            "poster": "Robin Reeve",
            "comment": "I speak and read both languages. I was asking because some of my gaming pals don't master English well - but as it is a coop game, I will manage things easily.",
            "timestamp": "1741383824",
            "is_creator": false
        },
        {
            "poster": "Ghostfire Gaming",
            "comment": "Hi RedWintyr, yes you will :)",
            "timestamp": "1741219795",
            "is_creator": true
        },
        {
            "poster": "Rob Gross",
            "comment": "Will all of the add-ons for the $65 Deluxe Bundle fit in the box? Specifically the neoprene boards. I love neoprene game boards but would not want components that cannot fit into the box.",
            "timestamp": "1741210672",
            "is_creator": false
        },
        {
            "poster": "Ghostfire Gaming",
            "comment": "Hi Rob, the neoprene mats would need to be stored separately if you back the Deluxe Bundle, the game box is fairly small and there won't be much extra room in it except for space for the two expansions and sleeved cards.",
            "timestamp": "1741213852",
            "is_creator": true
        },
        {
            "poster": "Ghostfire Gaming",
            "comment": "If you want everything to fit in the one box the Epic Edition comes with a larger box that houses everything :)",
            "timestamp": "1741213852",
            "is_creator": true
        },
        {
            "poster": "Ghostfire Gaming",
            "comment": "Thanks Pies_gracz, we're glad you like the look of the game. We're trying to find the right balance between accessibility and language independence. It's something we'll be focusing on in the final stages of development.",
            "timestamp": "1741212927",
            "is_creator": true
        },
        {
            "poster": "Nancy",
            "comment": "I really really like that all items from the epic version can be put in one box. Had yesterday a discussion with my boyfriend that most newer boxes are totally stupid and all items just fly through the box",
            "timestamp": "1741192358",
            "is_creator": false
        },
        {
            "poster": "Ghostfire Gaming",
            "comment": "We agree Nancy having mats, dice towers, and other components stored separately to the game box is frustrating!",
            "timestamp": "1741212665",
            "is_creator": true
        },
        {
            "poster": "Ghostfire Gaming",
            "comment": "We've been able to fit them all into a reasonably sized box too :)",
            "timestamp": "1741212665",
            "is_creator": true
        },
        {
            "poster": "Henrique Nóbrega",
            "comment": "I have two questions:",
            "timestamp": "1741133161",
            "is_creator": false
        },
        {
            "poster": "Henrique Nóbrega",
            "comment": "- This project is custom friendly?",
            "timestamp": "1741133161",
            "is_creator": false
        },
        {
            "poster": "Henrique Nóbrega",
            "comment": "- What does it means the * symbol after the \"Rest of Europe\" in the shipping table?",
            "timestamp": "1741133161",
            "is_creator": false
        },
        {
            "poster": "Ghostfire Gaming",
            "comment": "Hey Henrique! Yes this project is customs friendly. We will be charging VAT through BackerKit and ensuring you won't get any additional charges at time of delivery!",
            "timestamp": "1741141023",
            "is_creator": true
        },
        {
            "poster": "Ghostfire Gaming",
            "comment": "Sorry, there was a missed block of text in the shipping section which has now been added. The * has now been explained properly just below the shipping graphic.",
            "timestamp": "1741141023",
            "is_creator": true
        },
        {
            "poster": "Henrique Nóbrega",
            "comment": "Thanks!",
            "timestamp": "1741182759",
            "is_creator": false
        },
        {
            "poster": "Sara H",
            "comment": "I pledged for the Epic Edition. Is there any way I might also be able to get an empty standard game box?? I really love the artwork on the standard box & it showcasing all the companions 😍😍",
            "timestamp": "1741130511",
            "is_creator": false
        },
        {
            "poster": "Ghostfire Gaming",
            "comment": "Hi Sara, thank you so much for your support and we're thrilled to hear you love the artwork!! Adding specific item to a individuals pledge like an empty game box can be difficult for us to manage on the logistics side of things and we'd have to be willing to do that for others if we make an exception here. So unfortunately we're unable to make this happen, we hope you understand :)",
            "timestamp": "1741135059",
            "is_creator": true
        },
        {
            "poster": "Sara H",
            "comment": "I do understand. Will probably end up downgrading my pledge then as I really prefer the standard box art 🙃",
            "timestamp": "1741136266",
            "is_creator": false
        },
        {
            "poster": "Nancy",
            "comment": "i like the standard box more too ^^ but i want all xD so i will stay at epic ^^",
            "timestamp": "1741163279",
            "is_creator": false
        },
        {
            "poster": "Ian Wilz",
            "comment": "Bring on those stretch goals. Holy moly. Funded very quick this morning. We are so excited for this.",
            "timestamp": "1741114931",
            "is_creator": false
        },
        {
            "poster": "Ian Wilz",
            "comment": "Also I noticed that it said 12 quest cards. Does that mean there are 3 different ones for each of the 4 level?",
            "timestamp": "1741115460",
            "is_creator": false
        },
        {
            "poster": "Ian Wilz",
            "comment": "And I think it might be a good idea to include a page in the rulebook that has a components overview with pictures. I think the best rulebooks have a quick component overview page in them.",
            "timestamp": "1741115460",
            "is_creator": false
        },
        {
            "poster": "Ghostfire Gaming",
            "comment": "We're very excited to show everyone what we've got in store for the stretch goals.",
            "timestamp": "1741118869",
            "is_creator": true
        },
        {
            "poster": "Ghostfire Gaming",
            "comment": "That's correct, all Quest cards will come with unique art and rules modifiers!",
            "timestamp": "1741118869",
            "is_creator": true
        },
        {
            "poster": "Ghostfire Gaming",
            "comment": "That is the plan, it's not in the current draft rulebook but will certainly be added for the final version.",
            "timestamp": "1741118869",
            "is_creator": true
        },
        {
            "poster": "Blake",
            "comment": "Hi! I have a few quick questions.",
            "timestamp": "1741113252",
            "is_creator": false
        },
        {
            "poster": "Blake",
            "comment": "- Will the base game and both expansions all fit into the base game box if the cards are sleeved using the art sleeves? (So pledge tier 2 with the sleeves add-on.) I've had problems in the past with sleeves making cards no longer fit in the original game box so I just wanted to check!",
            "timestamp": "1741113252",
            "is_creator": false
        },
        {
            "poster": "Blake",
            "comment": "- It says there will be enough sleeves to sleeve all of the companion cards (including expansions and stretch goals) so does this mean there are not enough sleeves for the gnome cards as well? Also will there be any extra sleeves included in case any get damaged or is the plan to send out exactly enough to sleeve the cards?",
            "timestamp": "1741113252",
            "is_creator": false
        },
        {
            "poster": "Blake",
            "comment": "- Finally, will the clear side of the foil sleeves be more glossy or matte as far as sleeves go? (I don't know if a foil finish can even be matte but I figured it was worth asking.)",
            "timestamp": "1741113252",
            "is_creator": false
        },
        {
            "poster": "Blake",
            "comment": "Thank you for your time! :)",
            "timestamp": "1741113252",
            "is_creator": false
        },
        {
            "poster": "Ghostfire Gaming",
            "comment": "Hi Blake, all great questions.",
            "timestamp": "1741118564",
            "is_creator": true
        },
        {
            "poster": "Ghostfire Gaming",
            "comment": "1. Yes, that is the intention. We are still making minor tweaks to the insert but the plan is to make allowances for these to all fit.",
            "timestamp": "1741118564",
            "is_creator": true
        },
        {
            "poster": "Ghostfire Gaming",
            "comment": "2. We will be including extra card sleeves which will be enough for to sleeve your gnome cards and have some backup in case some get damaged. We didn't list gnome cards because they are double sided (an active and non-active side) and some may not choose to sleeve them but they can still function just fine in a sleeves if there non-active side is the one that is covered by the sleeve.",
            "timestamp": "1741118564",
            "is_creator": true
        },
        {
            "poster": "Ghostfire Gaming",
            "comment": "3. They'll be glossy, we think that makes the art \"pop\" best!",
            "timestamp": "1741118564",
            "is_creator": true
        },
        {
            "poster": "Ghostfire Gaming",
            "comment": "Thanks!",
            "timestamp": "1741118564",
            "is_creator": true
        },
        {
            "poster": "Blake",
            "comment": "Awesome, thanks for the quick response! Good to know about the gnome cards being double sided for sleeving.",
            "timestamp": "1741124993",
            "is_creator": false
        },
        {
            "poster": "Mr_Lockehart",
            "comment": "I might be blind so I apologize in advance if this is stated somewhere already - is there an estimated pledge fulfillment date?",
            "timestamp": "1741107231",
            "is_creator": false
        },
        {
            "poster": "Ghostfire Gaming",
            "comment": "December 2025! We're hoping to get it to everyone by Christmas if we can :)",
            "timestamp": "1741107476",
            "is_creator": true
        },
        {
            "poster": "Ghostfire Gaming",
            "comment": "December 2025, you'll find it noted in the reward tiers :)",
            "timestamp": "1741107532",
            "is_creator": true
        },
        {
            "poster": "Javan",
            "comment": "I was wondering if there is any availability for the expansion cards not in foil? The foil look is neat and all but not practical for gameplay to me or those I game with.",
            "timestamp": "1741106729",
            "is_creator": false
        },
        {
            "poster": "Ghostfire Gaming",
            "comment": "Hi Javan, all expansion cards will be foil. However, rest assured that we will be doing thorough readability tests and if we feel like the foiling interferes with the readability on the card we may opt to just have the foil on the Companion illustrations instead of the entire front of the card face.",
            "timestamp": "1741107137",
            "is_creator": true
        },
        {
            "poster": "supaemeraldmax",
            "comment": "question. If I get the Tier 2 and add the board game mat, will the board game mat fit inside the board game box?",
            "timestamp": "1741106625",
            "is_creator": false
        },
        {
            "poster": "Ghostfire Gaming",
            "comment": "Hi supaemeraldmax, no it won't unfortunately. It would need to be stored separately.",
            "timestamp": "1741106980",
            "is_creator": true
        },
        {
            "poster": "Ian Wilz",
            "comment": "So close to being first. I logged in on my computer but didn’t have payment info in so I had to switch to my phone. Still in at #8 this morning.",
            "timestamp": "1741105659",
            "is_creator": false
        },
        {
            "poster": "Ian Wilz",
            "comment": "We have been loving the prototype of this game we got to play. If anyone is looking for more videos we have more on our page.",
            "timestamp": "1741105659",
            "is_creator": false
        },
        {
            "poster": "Ian Wilz",
            "comment": "Where There’s A Wilz, There’s A Play on YouTube",
            "timestamp": "1741105659",
            "is_creator": false
        },
        {
            "poster": "Ghostfire Gaming",
            "comment": "Ian, we appreciate your kind words about the game on your videos. A big shoutout to Where There’s A Wilz, There’s A Play on YouTube, you guys are awesome!",
            "timestamp": "1741106435",
            "is_creator": true
        },
        {
            "poster": "Bart Van Damme",
            "comment": "Looks like a great game. Happy to have pushed it over the funding goal :)",
            "timestamp": "1741105505",
            "is_creator": false
        },
        {
            "poster": "Ghostfire Gaming",
            "comment": "Thanks so much Bart, we appreciate your support!",
            "timestamp": "1741105944",
            "is_creator": true
        },
        {
            "poster": "Jason Andrew Smith",
            "comment": "What's the suggested age range for this game? I'm thinking my nieces and nephew may enjoy the game, but I'm not sure if it's appropriate for their ages.",
            "timestamp": "1741104723",
            "is_creator": false
        },
        {
            "poster": "Ghostfire Gaming",
            "comment": "Hi Jason, we recommend 10+ but younger players could certainly play, especially if they play with an adult. The game has simple rules but the strategy in figuring out how to win is why we recommend 10+.",
            "timestamp": "1741105908",
            "is_creator": true
        },
        {
            "poster": "Jason Andrew Smith",
            "comment": "Perfect :) my nieces and nephews",
            "timestamp": "1741142068",
            "is_creator": false
        },
        {
            "poster": "Jason Andrew Smith",
            "comment": "Are a bit young, so it may be a good game to have for when they are older in a couple of years.",
            "timestamp": "1741142068",
            "is_creator": false
        },
        {
            "poster": "Matt Morgan",
            "comment": "Playtested this at GenCon last year and so excited to finally be able to get it!",
            "timestamp": "1741104288",
            "is_creator": false
        },
        {
            "poster": "Ghostfire Gaming",
            "comment": "Hey Matt, thanks so much for playing Companion Quest with us and we're so glad you enjoyed it! Thanks for backing :)",
            "timestamp": "1741105634",
            "is_creator": true
        },
        {
            "poster": "Randall Dorn",
            "comment": "How about add-ons for additional copies of the game?",
            "timestamp": "1741103080",
            "is_creator": false
        },
        {
            "poster": "Ghostfire Gaming",
            "comment": "... why didn't we think of that? We've added the additional add-on! Thanks for the suggestion!",
            "timestamp": "1741105957",
            "is_creator": true
        },
        {
            "poster": "Randall Dorn",
            "comment": "Pledge updated. :)",
            "timestamp": "1741106931",
            "is_creator": false
        },
        {
            "poster": "Ghostfire Gaming",
            "comment": "You miss 100% of the shots you don't take.",
            "timestamp": "1741100734",
            "is_creator": true
        },
        {
            "poster": "Ghostfire Gaming",
            "comment": "- Wayne Gretski",
            "timestamp": "1741100734",
            "is_creator": true
        },
        {
            "poster": "Ghostfire Gaming",
            "comment": "-- Michael Scott",
            "timestamp": "1741100734",
            "is_creator": true
        },
        {
            "poster": "Ghostfire Gaming",
            "comment": "--- Ghostfire Gaming",
            "timestamp": "1741100734",
            "is_creator": true
        }
    ]
}