{
    "url": "https://www.kickstarter.com/projects/czur-notebook/czur-et-max-the-unprecedented-professional-book-scanner/comments",
    "comments": [
        {
            "poster": "Flugschütz",
            "comment": "The assistive box. Is there any real point in adding this to my pledge? CZUR doesn't say anything about it except that \"it makes your scans even better\". Not especially helpful. In what way does it make the scan better? The only thing that comes to mind is that it reduces any possible extraneous light from bouncing off the pages.",
            "timestamp": "1742222368",
            "is_creator": false
        },
        {
            "poster": "Flugschütz",
            "comment": "Does anyone have any actual experience using one of these boxes and can give a little insight as to whether it is worth it or not?",
            "timestamp": "1742222368",
            "is_creator": false
        },
        {
            "poster": "Flugschütz",
            "comment": "Thanks",
            "timestamp": "1742222368",
            "is_creator": false
        },
        {
            "poster": "CZUR",
            "comment": "Hi Flugschütz, thank you so much for your comment! Think of it as the box that was being used by a lot of photography studio, because it blocks out other light sources, so when you use it for scanning, it focuses a lot more on the materials themselves, so the scanning results are better, thanks!",
            "timestamp": "1742274806",
            "is_creator": true
        },
        {
            "poster": "Sebastià Vinyals Subirana",
            "comment": "Hello.",
            "timestamp": "1742220724",
            "is_creator": false
        },
        {
            "poster": "Sebastià Vinyals Subirana",
            "comment": "I have some questions I'd like to clarify.",
            "timestamp": "1742220724",
            "is_creator": false
        },
        {
            "poster": "Sebastià Vinyals Subirana",
            "comment": "1) Delivery is supposedly scheduled for next April. Is this still expected? Are the production lines already running with the final product, or are they still working on a preliminary prototype and finalizing the final specifications?",
            "timestamp": "1742220724",
            "is_creator": false
        },
        {
            "poster": "Sebastià Vinyals Subirana",
            "comment": "2) With all the improvements we've been making (USB-C, etc.), we still don't have any updates from CZur.",
            "timestamp": "1742220724",
            "is_creator": false
        },
        {
            "poster": "Sebastià Vinyals Subirana",
            "comment": "When will there be any updates to share?",
            "timestamp": "1742220724",
            "is_creator": false
        },
        {
            "poster": "Sebastià Vinyals Subirana",
            "comment": "Thank you and best regards.",
            "timestamp": "1742220724",
            "is_creator": false
        },
        {
            "poster": "CZUR",
            "comment": "Hi Sebastià Vinyals Subirana, thank you so much for your comment!",
            "timestamp": "1742274726",
            "is_creator": true
        },
        {
            "poster": "CZUR",
            "comment": "1) Yes",
            "timestamp": "1742274726",
            "is_creator": true
        },
        {
            "poster": "CZUR",
            "comment": "2) Yeah, we can be posting an update soon, thanks!",
            "timestamp": "1742274726",
            "is_creator": true
        },
        {
            "poster": "David Kasten",
            "comment": "Can one add on the Assistive cover to their order after pledging and how if they can?",
            "timestamp": "1742174506",
            "is_creator": false
        },
        {
            "poster": "CZUR",
            "comment": "Hi David Kasten, thank you so much for your comment. For sure, on top of your pledge, you can add more money to add the add-on to your existing pledge, thanks!",
            "timestamp": "1742175857",
            "is_creator": true
        },
        {
            "poster": "Gary Robert Criss Jr",
            "comment": "what does the Assistive cover do? what does it cover?",
            "timestamp": "1742145195",
            "is_creator": false
        },
        {
            "poster": "CZUR",
            "comment": "Hi Gary Robert Criss Jr, thank you so much for the comment. We have a video to show what it is and how you can use it: https://youtu.be/Czfb7T-cXVg?si=jnlqwlPiB32PPqYo",
            "timestamp": "1742145310",
            "is_creator": true
        },
        {
            "poster": "CZUR",
            "comment": "Please check it out, thanks!",
            "timestamp": "1742145310",
            "is_creator": true
        },
        {
            "poster": "Greg",
            "comment": "I'm getting an email EVERY DAY to another email address than my account and it is an ad for the ET Max. It's coming from marketing@czuretmaxscanner.com but that domain is not working. There is another link to update my preferences but that one goes to czuretmaxscanner.us not .com. I am going to unsubscribe to the daily repeated email but I just don't want to lose my pledge. Thank you.",
            "timestamp": "1742004030",
            "is_creator": false
        },
        {
            "poster": "CZUR",
            "comment": "Hi Greg, thanks for the comment. And yes you won't lose the pledge, thanks!",
            "timestamp": "1742004765",
            "is_creator": true
        },
        {
            "poster": "Philip Setterlund",
            "comment": "how does this compare to the ET25 that was on your web site?",
            "timestamp": "1741980688",
            "is_creator": false
        },
        {
            "poster": "Philip Setterlund",
            "comment": "i’m asking about a model I saw called the ET 25",
            "timestamp": "1742080287",
            "is_creator": false
        },
        {
            "poster": "Philip Setterlund",
            "comment": "i no longer see the page for it.",
            "timestamp": "1742080305",
            "is_creator": false
        },
        {
            "poster": "CZUR",
            "comment": "Hi, it is previous version, and for offline version, thanks!",
            "timestamp": "1742094300",
            "is_creator": true
        },
        {
            "poster": "Ferry Widargo",
            "comment": "Can the ET MAX scanner send scans directly to emails / cloud / mobile? It's been the standard for most document scanners that I own in the past few years. Just thought I'd reconfirm cause I can't find any mention of this.",
            "timestamp": "1741947699",
            "is_creator": false
        },
        {
            "poster": "CZUR",
            "comment": "Hi Ferry Widargo, thanks for the comment. In this version of software, you will be able to do that, thanks!",
            "timestamp": "1741952540",
            "is_creator": true
        },
        {
            "poster": "CZUR",
            "comment": "Hi, thank you so much for your comment. Yes we offer free shipping to TW, when the campaign ends we will send out a survey for you to fill in the address, thanks!",
            "timestamp": "1741947619",
            "is_creator": true
        },
        {
            "poster": "TOM",
            "comment": "Hi,",
            "timestamp": "1741932354",
            "is_creator": false
        },
        {
            "poster": "TOM",
            "comment": "Will you ship from US or outside of US?",
            "timestamp": "1741932354",
            "is_creator": false
        },
        {
            "poster": "TOM",
            "comment": "I wish to know if there is warehouse locally.",
            "timestamp": "1741932354",
            "is_creator": false
        },
        {
            "poster": "TOM",
            "comment": "Thanks.",
            "timestamp": "1741932354",
            "is_creator": false
        },
        {
            "poster": "CZUR",
            "comment": "Hi Tom, thank you so much for your comment. For our US backers, we have a warehouse in Los Angeles and will ship locally. We also have a local warehouse for the EU region.",
            "timestamp": "1741938468",
            "is_creator": true
        },
        {
            "poster": "Flugschütz",
            "comment": "Where will you ship from to Canadian backers? If it's from the US, I will likely cancel my pledge because they added costs would make the price unfeasible.",
            "timestamp": "1741975437",
            "is_creator": false
        },
        {
            "poster": "CZUR",
            "comment": "Hi Flugschütz, for Canadian backers, we will send directly to Canada, not via US, thanks!",
            "timestamp": "1742001599",
            "is_creator": true
        },
        {
            "poster": "Michael Brock",
            "comment": "Why do your more recent models no longer have a cloud storage option (I think the last model to have it was the ET 18)? It would be helpful when I don’t want to carry a laptop.",
            "timestamp": "1741880735",
            "is_creator": false
        },
        {
            "poster": "CZUR",
            "comment": "Hi Michael Brock, thank you so much for your comment. Thanks for the suggestions and it has been forwarded to our R&D team, thanks!",
            "timestamp": "1741881393",
            "is_creator": true
        },
        {
            "poster": "John LaRavia",
            "comment": "Hi, can I also use this scanner to scan things like film or even large materials & big documents like maps or newspaper?",
            "timestamp": "1741875976",
            "is_creator": false
        },
        {
            "poster": "CZUR",
            "comment": "Hi John LaRavia, thanks for the comment! Yes, we recommend scanning materials as large as A3. If you wish to scan materials bigger than A3, you can scan them half by half and then merge them into one whole page.",
            "timestamp": "1741876128",
            "is_creator": true
        },
        {
            "poster": "k smith",
            "comment": "They side-stepped your question about film. I recently saw that I will need to replace my film scanner, and started looking. I think CZUR could build a good one, I'd rather have a dedicated unit though.",
            "timestamp": "1742000553",
            "is_creator": false
        },
        {
            "poster": "CZUR",
            "comment": "Hi K Smith, great idea, thank you so much for the suggestion! Yes, we will see if we can do that, thanks!",
            "timestamp": "1742001736",
            "is_creator": true
        },
        {
            "poster": "Kees Hintzbergen",
            "comment": "I already have a CZUR, Shine Ultra. Also via Kickstarter. I was looking for an upgrade in pixels and sidelight and better handling of pictures. I am happy with USB2, it is stable and I have scanned many books and magazines. I love the pdf & our feature, it works just fine. It is nearly impossible to switch pages that fast. What I missed was the sidelight, on glossy paper (books) I have often an over exposed shiny glimmerly result. I hope that will be better. My next project is more than 80 old photo albums, so can't wait to receive my pledge!",
            "timestamp": "1741709175",
            "is_creator": false
        },
        {
            "poster": "CZUR",
            "comment": "Hi Kees Hintzbergen, thank you so much for your comment! This is amazing, thank you so much for your support!",
            "timestamp": "1741710564",
            "is_creator": true
        },
        {
            "poster": "jorlinn on Linux",
            "comment": "Please implement a serial interface in the driver so that a page-turner device can be synced with it's commands.",
            "timestamp": "1741652115",
            "is_creator": false
        },
        {
            "poster": "CZUR",
            "comment": "Hi Jorlinn on Linux, thank you so much for your comment. And yes it is forwarded to oir R&D team, thanks!",
            "timestamp": "1741652853",
            "is_creator": true
        },
        {
            "poster": "Jorge Serrato",
            "comment": "Can the et max be folded for storage or disassembled?",
            "timestamp": "1741551814",
            "is_creator": false
        },
        {
            "poster": "CZUR",
            "comment": "Hi Jorge Serrato, thank you so much for your comment. The sidelight is detachable, and the scanner itself is pretty easy to store, thanks!",
            "timestamp": "1741567155",
            "is_creator": true
        },
        {
            "poster": "IAN WALTMAN",
            "comment": "Hi Creator,",
            "timestamp": "1741493354",
            "is_creator": false
        },
        {
            "poster": "IAN WALTMAN",
            "comment": "My book is broken in the edge or corner, or has some holes. What will happen if I scan them using your scanner?",
            "timestamp": "1741493354",
            "is_creator": false
        },
        {
            "poster": "IAN WALTMAN",
            "comment": "Thanks.",
            "timestamp": "1741493354",
            "is_creator": false
        },
        {
            "poster": "CZUR",
            "comment": "Hi IAN WALTMAN, thank you so much for your comment. Yes there is this 'Page-mending' feature where it can restore the broken pages, thanks!",
            "timestamp": "1741494508",
            "is_creator": true
        },
        {
            "poster": "John LaRavia",
            "comment": "Will it be able to scan 2 or more pages and then stitch them together? Thanks!",
            "timestamp": "1741460580",
            "is_creator": false
        },
        {
            "poster": "CZUR",
            "comment": "Hi, thanks for the comment! Yes, it is capable of doing that, thanks!",
            "timestamp": "1741460690",
            "is_creator": true
        },
        {
            "poster": "Simon O'Rourke",
            "comment": "Just realized it’s still using 30 year old USB A I’ve literally just got rid of them old cables as all my devices now use USB C as per the new standards laid out by the EU commission. This is really disappointing hopefully this will be updated on the finished product otherwise I may wait until this is updated on future models.",
            "timestamp": "1741426737",
            "is_creator": false
        },
        {
            "poster": "Robert Prichard Jr",
            "comment": "I agree, this should use USB C. I’m beginning to reconsider my support for this product.",
            "timestamp": "1741645101",
            "is_creator": false
        },
        {
            "poster": "Michael Brock",
            "comment": "Yes, please make it usb c.",
            "timestamp": "1741880448",
            "is_creator": false
        },
        {
            "poster": "Ferry Widargo",
            "comment": "USB C would be ideal.",
            "timestamp": "1741947544",
            "is_creator": false
        },
        {
            "poster": "Ferry Widargo",
            "comment": "The standard for high res scanners these days should at the very least use USB 3.0 / 3.1",
            "timestamp": "1741947544",
            "is_creator": false
        },
        {
            "poster": "Ferry Widargo",
            "comment": "USB A connections tend to get rather loose on the female side, which require technical expertise to replace, while USB C places the latch on the cable side, thus you just replace the cable when it's loose.",
            "timestamp": "1741947544",
            "is_creator": false
        },
        {
            "poster": "Tiffany Mock-Goeman",
            "comment": "Hi. I've been looking for a reasonably priced product that I could use to help my mother (losing her vision due to wet MD) read magazines and other materials. I think best to connect it to a large monitor for images so my sense is that with HDMI that would work fine. But wondering if the scan product could be used for her CPU to read the text ? thoughts anyone?",
            "timestamp": "1741384991",
            "is_creator": false
        },
        {
            "poster": "CZUR",
            "comment": "Hi, thank you so much for your comment. Yes connect it via HDMI is one way, and also thanks to OCR you can turn images into editable files, so with the help of some apps you can turn materials into audio files too, hope it helps, thanks!",
            "timestamp": "1741398298",
            "is_creator": true
        },
        {
            "poster": "John LaRavia",
            "comment": "Hi, I would love to ask what the assistive cover is, thanks!",
            "timestamp": "1741090047",
            "is_creator": false
        },
        {
            "poster": "CZUR",
            "comment": "Hi John LaRavia, thank you so much for the comment. We have a video to show what it is and how you can use it: https://youtu.be/Czfb7T-cXVg?si=jnlqwlPiB32PPqYo",
            "timestamp": "1741090683",
            "is_creator": true
        },
        {
            "poster": "CZUR",
            "comment": "Please check it out, thanks!",
            "timestamp": "1741090683",
            "is_creator": true
        },
        {
            "poster": "IAN WALTMAN",
            "comment": "Hi creator,",
            "timestamp": "1740920870",
            "is_creator": false
        },
        {
            "poster": "IAN WALTMAN",
            "comment": "could you tell what is the function of assistive cover and studio box?",
            "timestamp": "1740920870",
            "is_creator": false
        },
        {
            "poster": "CZUR",
            "comment": "Hi IAN WALTMAN, thank you so much for your comment! We actually have a video showcasing how to use the assistive cover: https://youtu.be/Czfb7T-cXVg?si=jnlqwlPiB32PPqYo",
            "timestamp": "1740921776",
            "is_creator": true
        },
        {
            "poster": "CZUR",
            "comment": "And the studio box is designed to make the scanning results of CZUR ET Max even better, thanks!",
            "timestamp": "1740921776",
            "is_creator": true
        },
        {
            "poster": "CZUR",
            "comment": "@Alex thank you so much for the detailed explanation.",
            "timestamp": "1740974197",
            "is_creator": true
        },
        {
            "poster": "Fadi",
            "comment": "I think CZUR only appreciate Alex comments for more detailed explanation even though saint comment no less detailed ...I know CZUR would prefer to stick on USB 2.0 and would**appreciate** any comments in its fav, but still as technology and creative company should also look the advantages for using latest technology even though it may not benefit them right away as creator due cost and redesign factor and instead go around appreciating comments to their benefits. Both Alex and saint are customers which at the end both are looking to use your technology and try to provide best advise for you, so don't be biased. Thanks",
            "timestamp": "1741213591",
            "is_creator": false
        },
        {
            "poster": "Alex",
            "comment": "How much more does switching to on board usb 3.0/.1/.2/4.0 costs?",
            "timestamp": "1742032354",
            "is_creator": false
        },
        {
            "poster": "Alex",
            "comment": "Is it that much more expensive? I’d rather it had USB 4 and usb ports and memory card slots to boot so that I can play files directly from those through to a TV, over which I could overlay anything I wanted from the scanner’s downward facing camera.",
            "timestamp": "1742032354",
            "is_creator": false
        },
        {
            "poster": "Alex",
            "comment": "It just future proofs it. There’s no reason why it can’t have an Android PC / Chromebook built it",
            "timestamp": "1742032354",
            "is_creator": false
        },
        {
            "poster": "Alex",
            "comment": "You could output to a simple, cheap, ultra thin and portable 15.6-inch monitor, and a work foldable keyboard and trackpad or mouse, and a future version can be used with any PC or Mac, but be fully self sufficient, too.",
            "timestamp": "1742032354",
            "is_creator": false
        },
        {
            "poster": "Alex",
            "comment": "You’d want a few USB 4 ports then!",
            "timestamp": "1742032354",
            "is_creator": false
        },
        {
            "poster": "Alex",
            "comment": "I’d still like it for this version. Even USB C at USB 2 480Mbps speeds would do.",
            "timestamp": "1742032354",
            "is_creator": false
        },
        {
            "poster": "Alex",
            "comment": "It should just come with a USB C port on it. Is it *really* that expensive?",
            "timestamp": "1742032354",
            "is_creator": false
        },
        {
            "poster": "Alex",
            "comment": "Can backers get a choice to pay extra to get one made with a USB C port at the factory when they’re making the scanner’s motherboard?",
            "timestamp": "1742032354",
            "is_creator": false
        },
        {
            "poster": "Alex",
            "comment": "Cheers",
            "timestamp": "1742032354",
            "is_creator": false
        },
        {
            "poster": "Alex",
            "comment": "Alex",
            "timestamp": "1742032354",
            "is_creator": false
        },
        {
            "poster": "Alex",
            "comment": "I don't think there's any problem having USB 2.0 regardless of how old it is. As far as its use as a book scanner the 480 Mbps is more than enough to handle full size images faster than a person can switch pages. As far as its use for streaming, 480 Mbps is far faster than the recommended upload bitrate for any platform. USB 2.0 is not the problem. Changing to an port with a faster speed would not affect performance at all and would only serve to make some users feel better while increasing the cost. The change could also require changing chips on the board to ones that could handle the increased speed, which could also require redesigning the board to meet increased power needs.",
            "timestamp": "1740850598",
            "is_creator": false
        },
        {
            "poster": "Alex",
            "comment": "USB-C may be helpful as it is becoming the standard. Most Windows laptops still have USB-A ports but Apple has been eliminating them in their latest models. If USB-C were implemented in this model I think the USB 2.0 version would be more than adequate. If it were changed I imagine other users would complain since USB-A is still in wide use and may be the only unused USB ports on their device. Desktops still tend to have more USB-A ports than USB-C. Whichever connector is used there will be people requiring an adapter.",
            "timestamp": "1740850598",
            "is_creator": false
        },
        {
            "poster": "Alex",
            "comment": "For those that want to use it for streaming presentations I think the main limiting factor is whatever processor is used. The video format is MJPG, which is very high quality but isn't very suitable for streaming due to its large file size. It isn't compressed much so it requires little processing power to encode. Since the primary purpose is scanning books, I'm guessing they selected a processor well suited to that task. They do include an HDMI 1.4 port. For users who want a better streaming experience a good option would be using an HDMI capture device. That would let you get up to 4Kp30. The processing would be offloaded to the capture device or your computer without imposing a higher cost on all the users who just want to use it as a book scanner. If they find one that works well maybe it could be offered as an addon and they could get a bulk discount. Maybe it could be a stretch goal.",
            "timestamp": "1740850598",
            "is_creator": false
        },
        {
            "poster": "Alex",
            "comment": "(Not the same Alex that commented on USB ports earlier)",
            "timestamp": "1740850598",
            "is_creator": false
        },
        {
            "poster": "CZUR",
            "comment": "Hi Alex, thank you so much for your detailed comment! Appreciate it.",
            "timestamp": "1740851819",
            "is_creator": true
        },
        {
            "poster": "MinohKim",
            "comment": "I thinks it's name is 'ET 26 pro'.",
            "timestamp": "1740807406",
            "is_creator": false
        },
        {
            "poster": "MinohKim",
            "comment": "is it right?",
            "timestamp": "1740807406",
            "is_creator": false
        },
        {
            "poster": "CZUR",
            "comment": "CZUR ET Max, thanks",
            "timestamp": "1740808178",
            "is_creator": true
        },
        {
            "poster": "MinohKim",
            "comment": "What's real improvement from 'ET 24 pro'?",
            "timestamp": "1740806634",
            "is_creator": false
        },
        {
            "poster": "CZUR",
            "comment": "Hi MinohKim, thank you so much for your comment! We have a chart in our campaign page stating the improvement including better resolutions, higher DPI, better software, cheaper price and so on",
            "timestamp": "1740807374",
            "is_creator": true
        },
        {
            "poster": "Alex",
            "comment": "I think the comparison chart to the ET24 Pro is a bit disingenuous since both versions have side lights, linux support, and an HDMI port. The main difference appears to just be the resolution, which is tied to the DPI. The price is lower for now, but the ET24 Pro was even lower when it was at this stage of development. How is the software better? One thing I would be interested in seeing is how the studio box is different from the one sold with the ET24 Pro, if it is different at all.",
            "timestamp": "1740850156",
            "is_creator": false
        },
        {
            "poster": "CZUR",
            "comment": "Hi, thanks for the comment. The main differences: Higher pixel clarity, especially improved color scanning quality, higher DPI, better software, and 4K display support—all at a more affordable price compared to the ET24 Pro's retail price. Plus, it comes with even stronger after-sales support.",
            "timestamp": "1740851792",
            "is_creator": true
        },
        {
            "poster": "TOM",
            "comment": "Hello",
            "timestamp": "1740794500",
            "is_creator": false
        },
        {
            "poster": "TOM",
            "comment": "What can I do if face bad reflection when scanning my magazines?",
            "timestamp": "1740794500",
            "is_creator": false
        },
        {
            "poster": "TOM",
            "comment": "It makes me very distressed in my job before.",
            "timestamp": "1740794500",
            "is_creator": false
        },
        {
            "poster": "CZUR",
            "comment": "Dear Tom, thank you so much for your comment! For scanning glossy papers, the ET Max features patented side-light technology that effectively eliminates reflections, ensuring high-quality, glare-free scans. Simply turn on the side light and switch off the top light, and it will seamlessly optimize the scanning process.",
            "timestamp": "1740797342",
            "is_creator": true
        },
        {
            "poster": "jorlinn on Linux",
            "comment": "My ancient Nikon LS-30 slide scanner used IR and visible light cameras with polarising filters to compensate for specks of dust, a slightly uneven surface and of course assisted autofocus.",
            "timestamp": "1741652512",
            "is_creator": false
        }
    ]
}