{
    "url": "https://www.kickstarter.com/projects/feiyutech/feiyu-scorp-m2-mobile-ultimate-3-axis-videography-gimbal/comments",
    "comments": [
        {
            "poster": "YS",
            "comment": "Hi Feiyu Team, can you help to response to my email regarding the issue i have with the feiyu pocket ? it has been many weeks and there is no response from your team. Looks like after sales support is very bad from your side. Thanks",
            "timestamp": "1742295126",
            "is_creator": false
        },
        {
            "poster": "FeiyuTech Support",
            "comment": "Hi YS, We’re really sorry you haven’t received a response yet. That’s not the experience we want you to have. We’ll relay this to the right team and follow up to ensure they get back to you as soon as possible. We truly appreciate your patience, and we’ll do our best to help get this sorted for you. We’ll also keep an eye on this to make sure you get the support you need.",
            "timestamp": "1742345852",
            "is_creator": true
        },
        {
            "poster": "Ricky Wright",
            "comment": "Hi how does the SCORP M2 compare to the DJI RS 4 MINI other than price ?",
            "timestamp": "1742134780",
            "is_creator": false
        },
        {
            "poster": "Ricky Wright",
            "comment": "Thanks",
            "timestamp": "1742134780",
            "is_creator": false
        },
        {
            "poster": "FeiyuTech Support",
            "comment": "Hi Riky, Great question! The Feiyu SCORP M2 and DJI RS 4 Mini are both fantastic compact gimbals, but the SCORP M2 really shines with its versatility and smart features. It's AI-powered tracking works with any phone or app, making it a game-changer for livestreams, video calls, and third-party camera apps. Plus, it supports multiple device types—smartphones, mirrorless cameras, compact cameras, and action cameras—so you won’t need separate gimbals for different gear.",
            "timestamp": "1742170823",
            "is_creator": true
        },
        {
            "poster": "FeiyuTech Support",
            "comment": "On top of that, the SCORP M2 unlocks more creative possibilities with motion-lapse, hyper-lapse, 9-square panorama, and Space Mode (360-degree rotation). Its ergonomic T-shaped handle ensures comfort during long shoots, while fast charging (just 1.9 hours for a full charge) gives you over 10 hours of use. The built-in OLED touchscreen and magic wheel also make adjustments seamless and precise.",
            "timestamp": "1742170823",
            "is_creator": true
        },
        {
            "poster": "FeiyuTech Support",
            "comment": "If you’re after a gimbal that’s powerful, intuitive, and designed for both smartphones and cameras, the SCORP M2 is an excellent pick!",
            "timestamp": "1742170823",
            "is_creator": true
        },
        {
            "poster": "Ricky Wright",
            "comment": "👍",
            "timestamp": "1742172920",
            "is_creator": false
        },
        {
            "poster": "Kris Sheehan",
            "comment": "Am I reading your compatibility documentation correct? The gimbal can hold the weight of a Sony A7iv but not with a lens attached?",
            "timestamp": "1741981211",
            "is_creator": false
        },
        {
            "poster": "FeiyuTech Support",
            "comment": "Hi Kris, Thanks for reaching out! We understand how important compatibility is when choosing a gimbal. The team will check on this and get back to you as soon as possible with a clear answer. We appreciate your patience, and we’ll make sure to follow up soon!",
            "timestamp": "1742171682",
            "is_creator": true
        },
        {
            "poster": "FeiyuTech Support",
            "comment": "Hi Kris, We understand how that might be confusing, and we appreciate you checking in. To clarify, the gimbal is designed to support the Sony A7IV along with compatible lenses. Our team has tested several lenses and confirmed they work well. If a lens has a similar size and weight to the ones we tested, it should also be compatible. Thank you very much for your support!",
            "timestamp": "1742199002",
            "is_creator": true
        },
        {
            "poster": "Dominic Murray",
            "comment": "Hi, is there a way of controlling the phones zoom on the camera app using the gimbal?",
            "timestamp": "1741735155",
            "is_creator": false
        },
        {
            "poster": "FeiyuTech Support",
            "comment": "Hi Dominic, Yes! The Feiyu ON app lets you control your phone’s zoom using the gimbal. Just make sure it's connected, then use the app’s camera function to adjust zoom with the dial or joystick. Thanks for your support!",
            "timestamp": "1741768828",
            "is_creator": true
        },
        {
            "poster": "Dominic Murray",
            "comment": "Thank you",
            "timestamp": "1741770207",
            "is_creator": false
        },
        {
            "poster": "FeiyuTech Support",
            "comment": "Hi Gary, Thanks for reaching out! We know compatibility is an important factor, and our team will check on this and get back to you as soon as possible. We appreciate your patience and support!",
            "timestamp": "1741569187",
            "is_creator": true
        },
        {
            "poster": "FeiyuTech Support",
            "comment": "Hi Gary, Feel free to check the compatibility list here: [https://drive.google.com/drive/folders/156wP3AX2r_oB0xtKLdudVchtdCnREjMG]. Let us know if you have any other questions!",
            "timestamp": "1741591276",
            "is_creator": true
        },
        {
            "poster": "Bob Katayama",
            "comment": "Did I qualify for the free wireless light?",
            "timestamp": "1741399977",
            "is_creator": false
        },
        {
            "poster": "FeiyuTech Support",
            "comment": "Hi Bob, Thanks for reaching out! All qualifying backers will receive the free wireless magnetic fill light. We’ll check with the team to see if you’re included and get back to you as soon as we hear back. Thank you very much for your support!",
            "timestamp": "1741591574",
            "is_creator": true
        },
        {
            "poster": "Steven",
            "comment": "Hi, I'm quickly following up on a message I sent to your Kickstarter inbox last week - hoping it didn't get lost and I could receive a reply soon please.",
            "timestamp": "1741338626",
            "is_creator": false
        },
        {
            "poster": "Steven",
            "comment": "It's about some issues with my reward as a deposit backer and seeking clarification with the giveaway please.",
            "timestamp": "1741338626",
            "is_creator": false
        },
        {
            "poster": "Steven",
            "comment": "Noting that when I do receive the emails with the secret perk link, they link to this Kickstarter campaign with no remaining reward to select. So I'm unsure what the secret perks are.",
            "timestamp": "1741338626",
            "is_creator": false
        },
        {
            "poster": "FeiyuTech Support",
            "comment": "Hi Steven, Thanks for following up! The team will check this for you and get back to you ASAP. Really appreciate your patience!",
            "timestamp": "1741344602",
            "is_creator": true
        },
        {
            "poster": "Steven",
            "comment": "Thanks for your reply. No worries, looking forward to hearing back from the team!",
            "timestamp": "1741399916",
            "is_creator": false
        },
        {
            "poster": "Steven",
            "comment": "Hi. Quickly following up again, it appears I haven't received a reply yet. Also, I'm having the same issue with the recent secret perk email. Hoping to hear back soon thanks.",
            "timestamp": "1742003321",
            "is_creator": false
        },
        {
            "poster": "Pako",
            "comment": "Hi, I made the purchase of 1$ for the SCORP M2 Mobile from 199$ and get the discount up to the price of 180$. As i read this discount will be refund after campaing.",
            "timestamp": "1741105729",
            "is_creator": false
        },
        {
            "poster": "Pako",
            "comment": "But finally I chose the option 1×SCORP M2-Mobile Pro Kit-Launch Special for 239$. will i get 19$ equivalent discount?",
            "timestamp": "1741105729",
            "is_creator": false
        },
        {
            "poster": "Pako",
            "comment": "Entonces no entiendo nada, porque yo ya apliqué para el descuento de 19$ el 10 de febrero.",
            "timestamp": "1741159345",
            "is_creator": false
        },
        {
            "poster": "Pako",
            "comment": "PAYMENT DETAILS",
            "timestamp": "1741159345",
            "is_creator": false
        },
        {
            "poster": "Pako",
            "comment": "Transaction ID: ad9cd38b-ed65-4bad-b7a7-98ab9315aa87",
            "timestamp": "1741159345",
            "is_creator": false
        },
        {
            "poster": "Pako",
            "comment": "Purchased on: Feb 10, 2025",
            "timestamp": "1741159345",
            "is_creator": false
        },
        {
            "poster": "Pako",
            "comment": "Y no he recibido ningún mail con instrucciones ni link para acceder a comprarlo por los 180$ prometidos...",
            "timestamp": "1741159345",
            "is_creator": false
        },
        {
            "poster": "Pako",
            "comment": "Then I don't understand anything, because I already applied for the $19 discount on 10 February.",
            "timestamp": "1741191863",
            "is_creator": false
        },
        {
            "poster": "Pako",
            "comment": "PAYMENT DETAILS",
            "timestamp": "1741191863",
            "is_creator": false
        },
        {
            "poster": "Pako",
            "comment": "Transaction ID: ad9cd38b-ed65-4bad-b7a7-98ab9315aa87",
            "timestamp": "1741191863",
            "is_creator": false
        },
        {
            "poster": "Pako",
            "comment": "Purchased on: Feb 10, 2025",
            "timestamp": "1741191863",
            "is_creator": false
        },
        {
            "poster": "Pako",
            "comment": "And I haven't received any email with instructions or link to access to buy it for the promised $180...",
            "timestamp": "1741191863",
            "is_creator": false
        },
        {
            "poster": "Pako",
            "comment": "So what should I do now that I have already bought the 239€ option without any discount?",
            "timestamp": "1741191863",
            "is_creator": false
        },
        {
            "poster": "FeiyuTech Support",
            "comment": "Hi Pako, Thanks for letting us know. The Feiyu team will be sending another email today to all deposit backers, including you. Please keep an eye on your inbox and click the order button in the email to complete your purchase and receive the $19.9 discount. If you don’t see the email in your inbox, kindly check your spam/junk folder as well.",
            "timestamp": "1741226089",
            "is_creator": true
        },
        {
            "poster": "Samadaeus",
            "comment": "to confirm, me being",
            "timestamp": "1740936395",
            "is_creator": false
        },
        {
            "poster": "Samadaeus",
            "comment": "Backer # 183",
            "timestamp": "1740936395",
            "is_creator": false
        },
        {
            "poster": "Samadaeus",
            "comment": "means my order qualifies for a free Fill in LED light attachment , correct?",
            "timestamp": "1740936395",
            "is_creator": false
        },
        {
            "poster": "FeiyuTech Support",
            "comment": "Hi Samadaeus, thank you for your support! The team will check this for you and confirm what’s included with your order. We will get back to you with an update soon!",
            "timestamp": "1740964684",
            "is_creator": true
        },
        {
            "poster": "FeiyuTech Support",
            "comment": "Thanks for asking! The team confirms that your order includes a USB-C to Lightning cable. We appreciate your support, and we're happy to help if you have any other questions!",
            "timestamp": "1740987709",
            "is_creator": true
        },
        {
            "poster": "Attila Fovenyessy",
            "comment": "I traveled around the World twice, and my disappearing cultures photography was published in 8 countries in travel and photography magazines. With this new release of Scorp M2-Mobil Pro I should improve my photo's & video's quality at my next future destination! I'm looking forward to use this wonderful device as soon as possible! Thank you very much!",
            "timestamp": "1740931812",
            "is_creator": false
        },
        {
            "poster": "FeiyuTech Support",
            "comment": "Thank you very much for your support, Attila! Your travels and photography sound incredible, and we can’t wait for you to capture even more stunning moments with the Feiyu SCORP M2. Safe travels and happy shooting!",
            "timestamp": "1740964260",
            "is_creator": true
        },
        {
            "poster": "Attila Fovenyessy",
            "comment": "Please check my few of Instagram photographs: attilafovenyessy",
            "timestamp": "1740969652",
            "is_creator": false
        },
        {
            "poster": "Aurelio Elias Talamantes",
            "comment": "I own a Feiyutech A1000 and a Pocket 3. Can´t wait to have the Scorp M2 Mobile.",
            "timestamp": "1740759484",
            "is_creator": false
        },
        {
            "poster": "FeiyuTech Support",
            "comment": "Hi Aurelio, We appreciate your support! It’s awesome to hear you already have some great gear, you're going to love the Scorp M2 Mobile. We can't wait for you to get it in your hands!",
            "timestamp": "1740964108",
            "is_creator": true
        },
        {
            "poster": "Ruth Duckworth",
            "comment": "I'm trying to enter for the carry case giveaway, but can't find a link to Facebook.",
            "timestamp": "1740731354",
            "is_creator": false
        },
        {
            "poster": "Ruth Duckworth",
            "comment": "Have shared your page directly from Facebook.",
            "timestamp": "1740731354",
            "is_creator": false
        },
        {
            "poster": "Ruth Duckworth",
            "comment": "Is that correct or is it that I'm just too late?",
            "timestamp": "1740731354",
            "is_creator": false
        },
        {
            "poster": "Ruth Duckworth",
            "comment": "I don't fully understand the instructions.",
            "timestamp": "1740731354",
            "is_creator": false
        },
        {
            "poster": "FeiyuTech Support",
            "comment": "Great question, Rex! The SCORP M2-Mobile is specially optimized for smartphone videography, featuring a modular design that removes traditional quick-release plates and other unnecessary accessories. This makes it a streamlined, cost-effective professional shooting solution for mobile users. It also comes with an upgraded intelligent stabilization algorithm, optimized motor parameters tailored for smartphone weight, and deep integration with the Feiyu ON App—allowing for focus/zoom control, motion timelapse, panoramic shots, and more. Plus, it supports native camera controls for both iOS and Android.",
            "timestamp": "1740987376",
            "is_creator": true
        },
        {
            "poster": "Sonny",
            "comment": "Oof, thought I made it in time, it says 97 backers but when I check my backer number is 102 😂😳",
            "timestamp": "1740698764",
            "is_creator": false
        },
        {
            "poster": "Sonny",
            "comment": "Oh well I've already got a light from previous version, it's still compatible right?",
            "timestamp": "1740698764",
            "is_creator": false
        },
        {
            "poster": "Jake Yucanort B Sirius",
            "comment": "I'm #104 but page shows 99 backers",
            "timestamp": "1740699217",
            "is_creator": false
        },
        {
            "poster": "Arty",
            "comment": "Don't feel bad, I got #101 🤏🏼",
            "timestamp": "1740699306",
            "is_creator": false
        },
        {
            "poster": "Attila Fovenyessy",
            "comment": "I ordered today my Scope M2-Mobile Pro. I'm a Backer! It was no selection to choose a color!! How can get to my order a BLACK finish model? - Attila Fovenyessy, NYC -",
            "timestamp": "1740687035",
            "is_creator": false
        },
        {
            "poster": "FeiyuTech Support",
            "comment": "Thanks for backing us, Attila! We hear you on the color selection, and we’ll check with the team to see how we can get you the black finish. We’ll follow up as soon as we have an update!",
            "timestamp": "1740963936",
            "is_creator": true
        },
        {
            "poster": "FeiyuTech",
            "comment": "Yes, the gimbal with vision tracking supports face tracking. As for object tracking, it will require Feiyu app together to achieve.",
            "timestamp": "1740718129",
            "is_creator": true
        },
        {
            "poster": "Sandy",
            "comment": "In the FAQ it says the maximum payload is 1200g which is only about 2.5 lbs. Is that correct?",
            "timestamp": "1740684681",
            "is_creator": false
        },
        {
            "poster": "FeiyuTech",
            "comment": "hi Sandy, yes. SCORP M2-Mobile as ultra light and compact gimbal can support a maximum payload of 1200g (when balanced) and its net weight is 852g (detachable parts not included).",
            "timestamp": "1740712926",
            "is_creator": true
        },
        {
            "poster": "wayne stewart",
            "comment": "Hello, I did the deposit for the VIP but it wasn’t a option, how do i choose it?",
            "timestamp": "1740679032",
            "is_creator": false
        },
        {
            "poster": "Brian Spiegel",
            "comment": "I backed the Cam3 and Love it! I’m sure this will be just as great! As backer #71 and part fo the first 100, how do I get the free light as noted in the email?",
            "timestamp": "1740676523",
            "is_creator": false
        },
        {
            "poster": "Attila Fovenyessy",
            "comment": "I see you deleted my comment!! Why???",
            "timestamp": "1740670203",
            "is_creator": false
        },
        {
            "poster": "FeiyuTech",
            "comment": "hi Attila, we see your comments. Kickstarter keeps them all :)",
            "timestamp": "1740713481",
            "is_creator": true
        },
        {
            "poster": "Attila Fovenyessy",
            "comment": "I thought that I can Buy it, and ordering today!!!😭",
            "timestamp": "1740669814",
            "is_creator": false
        },
        {
            "poster": "FeiyuTech",
            "comment": "hi Attila, thanks for your interest! get the launch day special offer that also comes with the gift and early in line for shipping :)",
            "timestamp": "1740713566",
            "is_creator": true
        },
        {
            "poster": "MBOUDOU",
            "comment": "Good product, I have the cam 3 already and I think those a great products, but what about the battery though? Because I feel like it was the only downpoint on the camera, what to expect about it now? Is it better?",
            "timestamp": "1740666939",
            "is_creator": false
        },
        {
            "poster": "FeiyuTech",
            "comment": "hi MBOUDOU, thanks for your early support. SCORP M2-Mobile provides over 10 hours of filming time. Also, supports 18W fast charging which can be fully charged in just 1.9 hours. Hope this helps.",
            "timestamp": "1740667339",
            "is_creator": true
        }
    ]
}