{
    "url": "https://www.kickstarter.com/projects/gambadecycles/gambade-the-cargo-bike-that-transforms-to-fit-your-life/comments",
    "comments": [
        {
            "poster": "Maximilian Karla",
            "comment": "Congratulations on reaching the funding goal! When can we expect to receive information about the next steps? Where can the desired bike size be specified?",
            "timestamp": "1742211858",
            "is_creator": false
        },
        {
            "poster": "GAMONET",
            "comment": "Hi Maximilian! Once again many thanks for your support! We will contact by the end of the week to tell you more abut next teps, determine the correct size for each bike and so on.",
            "timestamp": "1742280313",
            "is_creator": true
        },
        {
            "poster": "Maximilian Karla",
            "comment": "Great, thank you for your answer!",
            "timestamp": "1742286533",
            "is_creator": false
        },
        {
            "poster": "SIMON",
            "comment": "Why would I choose Gambade?",
            "timestamp": "1741463859",
            "is_creator": false
        },
        {
            "poster": "SIMON",
            "comment": "I've been eyeing cargo bikes since a long time...mostly because we don't own a car. While we live in a city where you can rent a cargo bike, you're limited to the opening times of the rent shop, have to go and get it, bring it back, and you need to plan and schedule everything in advance. So I found myself not using a cargo bike quite as often as I'd like to because of these obstacles.",
            "timestamp": "1741463859",
            "is_creator": false
        },
        {
            "poster": "SIMON",
            "comment": "With Gambade, I hope to replace my current commuter bike and have a cargo bike available as well with a much lower effort to actually use it, so I'll enjoy using a cargo bike much more often.",
            "timestamp": "1741463859",
            "is_creator": false
        },
        {
            "poster": "GAMONET",
            "comment": "Hi Simon !",
            "timestamp": "1741529556",
            "is_creator": true
        },
        {
            "poster": "GAMONET",
            "comment": "Thank you so much for your support! I can totally relate—having to rent a cargo bike every time you need one can be a real hassle. That’s exactly why we created Gambade: to make everyday life easier without the need for multiple bikes. I truly hope it will bring you the flexibility and convenience you’re looking for !",
            "timestamp": "1741529556",
            "is_creator": true
        },
        {
            "poster": "Alexander",
            "comment": "Hello, you deliver not to Austria? Kind regards Alexander",
            "timestamp": "1739396038",
            "is_creator": false
        },
        {
            "poster": "GAMONET",
            "comment": "Hello Alexander, we deliver all accross Europe so it is not a problem to delier in Austria. I was a mistake in the delivery section parameters it should be ok now. Thanks for asking !",
            "timestamp": "1739466878",
            "is_creator": true
        }
    ]
}