{
    "url": "https://www.kickstarter.com/projects/iqunixmq80keyboard/iqunix-mq80-3-mode-mechanical-aluminum-keyboard/comments",
    "comments": [
        {
            "poster": "Strawberry Samurai",
            "comment": "Hey I don't get how the company behind the Magi65, recognized as the best quality LP keyboard you can get (if that layout suits etc) can have such poor advertising/marketing.",
            "timestamp": "1742457950",
            "is_creator": false
        },
        {
            "poster": "Strawberry Samurai",
            "comment": "Asethics aside, keyboard nerds proclaimed the Magi65 frigging dethroned Lofree Flow! From the feedback (that I hope you've been reading) was mostly ppl wanted to wait for the a larger 85% layout. And you've done it!!",
            "timestamp": "1742457950",
            "is_creator": false
        },
        {
            "poster": "Strawberry Samurai",
            "comment": "But near radio silence from you.",
            "timestamp": "1742457950",
            "is_creator": false
        },
        {
            "poster": "Strawberry Samurai",
            "comment": "If I google \"mq80 iqunix\" I get 3 youtube clips, two in korean, one written review from notebookcheck, a bunch of 30secs repetitive shorts from you and the kickstater link.",
            "timestamp": "1742457950",
            "is_creator": false
        },
        {
            "poster": "Strawberry Samurai",
            "comment": "I'm not angry, I'll be getting the board fine and dandy. It's just interesting to see the keyboard market peaking at the moment people around me friends and colleagues are buying keyboards en mass...IN NEW ZEALAND, the incredible feedback from Magi65 in the keyboard circles, Seeing Lofree Lite kickstater approach, having the same propriety switches as Lofee/an established market of people already in your switch ecosystemm....",
            "timestamp": "1742457950",
            "is_creator": false
        },
        {
            "poster": "Strawberry Samurai",
            "comment": "I just believe you can't capitalise on this with some marketing.",
            "timestamp": "1742457950",
            "is_creator": false
        },
        {
            "poster": "Strawberry Samurai",
            "comment": "Love your products, totally miffed about your approach. Wish you all the best.",
            "timestamp": "1742457950",
            "is_creator": false
        },
        {
            "poster": "dumpling_55",
            "comment": "Hi ! 😁",
            "timestamp": "1742215997",
            "is_creator": false
        },
        {
            "poster": "dumpling_55",
            "comment": "I have a question concerning the gold keycap :",
            "timestamp": "1742215997",
            "is_creator": false
        },
        {
            "poster": "dumpling_55",
            "comment": "Will it be only the Xiang serpent version or will the other version, the Ji serpent shown on your website, also available ?",
            "timestamp": "1742215997",
            "is_creator": false
        },
        {
            "poster": "dumpling_55",
            "comment": "Thanks in advance for your answer !",
            "timestamp": "1742215997",
            "is_creator": false
        },
        {
            "poster": "Strawberry Samurai",
            "comment": "Design question please, where did you get the inspiration/is there a meaning behind the symbols on the keycaps e.g. the grey and red dashes and squares.",
            "timestamp": "1742207715",
            "is_creator": false
        },
        {
            "poster": "Maxime L",
            "comment": "Hi there, will i be able to tune up the spacebar stabs? They sound a little rattly in the videos.",
            "timestamp": "1741919288",
            "is_creator": false
        },
        {
            "poster": "Maxime L",
            "comment": "Also are you guys planning on releasing more low profile key cap sets to fit the red and black look of this bad boy?",
            "timestamp": "1741919288",
            "is_creator": false
        },
        {
            "poster": "Maxime L",
            "comment": "cheers!",
            "timestamp": "1741919288",
            "is_creator": false
        },
        {
            "poster": "Maxime L",
            "comment": "Heres an exemple of no rattle so that you can compare : https://shorturl.at/RxOEO",
            "timestamp": "1742064810",
            "is_creator": false
        },
        {
            "poster": "Lourensious Lukito",
            "comment": "Check out the newest review: https://youtu.be/-sBler0LGhw?si=LY7Y_Lqth7aHwr17&t=201",
            "timestamp": "1742119416",
            "is_creator": false
        },
        {
            "poster": "Lourensious Lukito",
            "comment": "It's from Korean Youtuber and apparently they have designed it so you can tune the stabilizer, I am no expert on this and I don't know how can I tune it up but it may be helpful for you. I don't notice the rattling on his video so maybe production issue or prototype issue?",
            "timestamp": "1742119416",
            "is_creator": false
        },
        {
            "poster": "IQUNIX",
            "comment": "Hi Maxime L, thanks for the comment! It can be tuned manually. There are plans to offer low-profile keycaps on our official website in the future.",
            "timestamp": "1742171972",
            "is_creator": true
        },
        {
            "poster": "Carter",
            "comment": "Can we get a breakdown of the U measurements of keycaps?",
            "timestamp": "1741776282",
            "is_creator": false
        },
        {
            "poster": "demir elmaz",
            "comment": "Hi! When we are able to choose our color when the Kickstarter finishes, would we be able to choose the shadow black with white keycaps?",
            "timestamp": "1741732469",
            "is_creator": false
        },
        {
            "poster": "IQUNIX",
            "comment": "Hi Demir Elmaz, thank you so much for your comment. When the campaign ends we will send out a survey for you to choose colors, thanks!",
            "timestamp": "1741874868",
            "is_creator": true
        },
        {
            "poster": "Strawberry Samurai",
            "comment": "Sorry to be annoying, but be great to get some more marketing on this.",
            "timestamp": "1741587356",
            "is_creator": false
        },
        {
            "poster": "Strawberry Samurai",
            "comment": "Pass it over to some influencers to do the job for you if it's easier.",
            "timestamp": "1741587356",
            "is_creator": false
        },
        {
            "poster": "Strawberry Samurai",
            "comment": "Only see two youtube reviews (one in korean) and one article so far. I wouldn't mind more to decision making",
            "timestamp": "1741587356",
            "is_creator": false
        },
        {
            "poster": "IQUNIX",
            "comment": "Hi Strawberry Samurai, thank you so much for your comment!",
            "timestamp": "1741617243",
            "is_creator": true
        },
        {
            "poster": "IQUNIX",
            "comment": "Switch and Click: https://www.youtube.com/watch?v=PmlFeOHy1cM",
            "timestamp": "1741617243",
            "is_creator": true
        },
        {
            "poster": "IQUNIX",
            "comment": "Daihuku Keyboard: https://youtu.be/cYnfunzOrqc",
            "timestamp": "1741617243",
            "is_creator": true
        },
        {
            "poster": "IQUNIX",
            "comment": "More videos from other creators are currently in preparation.",
            "timestamp": "1741617243",
            "is_creator": true
        },
        {
            "poster": "RK",
            "comment": "Bit disappointed to have missed out on the super early bird discount. I was one of the first after the initial 100 slots, but I see since then it has been extended to 200. It would have been nice to at least give the first 100 of the early bird backers that option...",
            "timestamp": "1741472630",
            "is_creator": false
        },
        {
            "poster": "Lourensious Lukito",
            "comment": "if you were one of the first, how did you miss the super early bird?",
            "timestamp": "1741495371",
            "is_creator": false
        },
        {
            "poster": "IQUNIX",
            "comment": "Hi RK, it literally sold out in like 1 hour, thanks!",
            "timestamp": "1741534333",
            "is_creator": true
        },
        {
            "poster": "Mir Shafayat Ahmed",
            "comment": "I have already backed the project out of excitement. But i want to know if you have any experience shipping batteries included wireless keyboards to Bangladesh. Like what provider to use, dangerous goods regulations, and potential customs fees that previous customers paid.",
            "timestamp": "1741424240",
            "is_creator": false
        },
        {
            "poster": "IQUNIX",
            "comment": "Hi Mir Shafayat Ahmed, thank you so much for your comment. It shouldn't be a problem, thanks!",
            "timestamp": "1741534305",
            "is_creator": true
        },
        {
            "poster": "Michael",
            "comment": "Could you please provide a little more information on the capabilities/limitations of the VIA integration? Is this fully QMK compatible? Will I be able to enable more advanced features like Caps Word, Mod-Tap, and Tap Dance?",
            "timestamp": "1741416922",
            "is_creator": false
        },
        {
            "poster": "Mustafa",
            "comment": "The magi65 does not support these so unless they specifically say otherwise I would assume the same is true here. Hope it does though.",
            "timestamp": "1741471501",
            "is_creator": false
        },
        {
            "poster": "IQUNIX",
            "comment": "Hi Michael, thank you so much for your comment. Our keyboard functionality is largely similar to QMK, though some advanced features, like ANY key and Mod-Tap, are not yet supported. It currently works with VIA but is not fully QMK-compatible. We're actively gathering feedback and aim to introduce more features in the future.",
            "timestamp": "1741616865",
            "is_creator": true
        },
        {
            "poster": "Michael",
            "comment": "Thank you for your response. Could you tell me whether or not you foresee future updates coming to this keyboard? As in, IQUNIX releasing additional firmwares in the future to be flashed to the keyboard?",
            "timestamp": "1741744793",
            "is_creator": false
        },
        {
            "poster": "Michael",
            "comment": "Or, at least, could you give me an idea as to what options this board will have available in VIA? (I know it can vary by keyboard.)",
            "timestamp": "1741744793",
            "is_creator": false
        },
        {
            "poster": "Michael",
            "comment": "This looks like a wonderfully built keyboard, but I am a programmer, and the level customization is really an important aspect for me.",
            "timestamp": "1741744793",
            "is_creator": false
        },
        {
            "poster": "Queven",
            "comment": "Is it possible add to order this keyboard other low profile switches?",
            "timestamp": "1741375702",
            "is_creator": false
        },
        {
            "poster": "IQUNIX",
            "comment": "Hi Queven, thank you so much for your comment. Not at the moment, but you can purchase Kailh Choc V2 low-profile switches separately.",
            "timestamp": "1741616938",
            "is_creator": true
        },
        {
            "poster": "Strawberry Samurai",
            "comment": "Hi, could you include a quality wrist rest add on?",
            "timestamp": "1741318306",
            "is_creator": false
        },
        {
            "poster": "Strawberry Samurai",
            "comment": "The market for Low Profile wrist rest pretty much non existent apart from Nuphy's acrylic and latest Kick75 memory foam which they charge a bomb for. I would certainly get a low profile wrist rest if it was an add-on",
            "timestamp": "1741318306",
            "is_creator": false
        },
        {
            "poster": "IQUNIX",
            "comment": "Hi Strawberry Samurai, thank you so much for your comment. Our low-profile switches are very comfortable, so a wrist rest isn’t necessary.",
            "timestamp": "1741372422",
            "is_creator": true
        },
        {
            "poster": "IQUNIX",
            "comment": "Thank you for your suggestion! We will provide feedback and see if there’s an opportunity to release a wrist rest to meet more users' needs.",
            "timestamp": "1741372422",
            "is_creator": true
        },
        {
            "poster": "Strawberry Samurai",
            "comment": "Your keyboard is taller than most of your Kailh Choc V2 low profile competitors such as lofree, kzzi i75, chillkey and nd75 low profile.",
            "timestamp": "1741481324",
            "is_creator": false
        },
        {
            "poster": "Strawberry Samurai",
            "comment": "Nuphy who seems to be leading the Low profile market share has multiple versions of their wrist support.",
            "timestamp": "1741481324",
            "is_creator": false
        },
        {
            "poster": "Strawberry Samurai",
            "comment": "Totally different business model I know, but just pointing out that wrist rest are provided for other LP keyboard lower than the MQ80.",
            "timestamp": "1741481324",
            "is_creator": false
        },
        {
            "poster": "Isaiah Sanchez",
            "comment": "Hi, would the desk mat come in black?",
            "timestamp": "1741277187",
            "is_creator": false
        },
        {
            "poster": "IQUNIX",
            "comment": "Hi Isaiah Sanchez, thank you so much for your comment! Currently, only the white one is available. You can follow our official website for updates, as more desk mats may be released in the future.",
            "timestamp": "1741372357",
            "is_creator": true
        },
        {
            "poster": "Danh Nguyen",
            "comment": "None of the videos on the campaign page actually load the video by influencers?",
            "timestamp": "1741167912",
            "is_creator": false
        },
        {
            "poster": "IQUNIX",
            "comment": "Hi, thanks for the comment. Check out this one: https://youtu.be/cYnfunzOrqc?si=AirFDEDpK75nvCoC",
            "timestamp": "1741190672",
            "is_creator": true
        },
        {
            "poster": "Danh Nguyen",
            "comment": "What about the other reviewers on your page? Are there videos coming from those content creators?",
            "timestamp": "1741414012",
            "is_creator": false
        },
        {
            "poster": "IQUNIX",
            "comment": "Hi Dayne, thank you so much for your comment. For now no, but we will be brainstorming internally to see if it is feasible, thanks!",
            "timestamp": "1741155563",
            "is_creator": true
        },
        {
            "poster": "R",
            "comment": "Will US-China tariffs affect final pricing? Or are we locked in on the price we pledged?",
            "timestamp": "1741100972",
            "is_creator": false
        },
        {
            "poster": "IQUNIX",
            "comment": "Hi R, thank you so much for the comment. It will not affect the price you pledged, thanks!",
            "timestamp": "1741155518",
            "is_creator": true
        },
        {
            "poster": "Dmitriy Paramoshkin",
            "comment": "Btw why you so set on very specific sleep timer? I would bet many people would be glad to trade some battery life for sleep after 30 min instead of 10. It looks like Lofree Flow Lite have around 5-10 minutes timer for sleep and it's very annoying.",
            "timestamp": "1741072714",
            "is_creator": false
        },
        {
            "poster": "IQUNIX",
            "comment": "Hi Dmitriy Paramoshkin, thank you so much for your comment! Our keyboard defaults to entering low-power mode after 10 minutes of inactivity. However, one of its advantages is that as long as your connected device (PC, tablet) is not in sleep mode, you can start typing immediately with the first key press—there’s no need for an initial wake-up press before inputting text.",
            "timestamp": "1741155363",
            "is_creator": true
        },
        {
            "poster": "Vulcanic",
            "comment": "Will the keyboard be compatible with the Lowfree Flow Low Profile switches? I'd love to try out Tactile or Silent switches on this keyboard. Will there eventually be Tactile Iqunix switches available for this keyboard?",
            "timestamp": "1741058133",
            "is_creator": false
        },
        {
            "poster": "IQUNIX",
            "comment": "Hi Vulcanic, thank you so much for your comment! 1. Unfortunately it does not support Lowfree Flow Low Profile switches, only Kailh Choc V2 low-profile switches. 2. This may happen in the future, so stay tuned to our official website for updates.",
            "timestamp": "1741155462",
            "is_creator": true
        },
        {
            "poster": "Ben Bettin",
            "comment": "I was under the impression that Lofree’s low-profile switches (e.g., Phantom) ARE Kaila Choc V2… aren’t they? That would mean they would be compatible… wouldn’t they?",
            "timestamp": "1741378412",
            "is_creator": false
        },
        {
            "poster": "Ben Bettin",
            "comment": "https://www.lofree.co/products/lofree-phantom-switches",
            "timestamp": "1741378412",
            "is_creator": false
        },
        {
            "poster": "Ben Bettin",
            "comment": "https://showcase.beekeeb.com/kailh-choc-v2-key-switches/",
            "timestamp": "1741378412",
            "is_creator": false
        },
        {
            "poster": "Tom Mattson",
            "comment": "Wait, 28 days to go and we’re already out of early birds? Is that real?",
            "timestamp": "1741011799",
            "is_creator": false
        },
        {
            "poster": "Lourensious Lukito",
            "comment": "Yes, its a real early bird compare to other campaign where they keep early bird open throughout the campaign",
            "timestamp": "1741046055",
            "is_creator": false
        },
        {
            "poster": "Tom Mattson",
            "comment": "Typically early bird is structured in such a way that pledges in the first 24-48 hours qualify.",
            "timestamp": "1741102624",
            "is_creator": false
        },
        {
            "poster": "Tom Mattson",
            "comment": "I respect the creators ability to pursue their campaign in the ways that feel right to them, but definitely worry about the longterm impact of this approach for them.",
            "timestamp": "1741102624",
            "is_creator": false
        },
        {
            "poster": "IQUNIX",
            "comment": "Yeah, 200 Super Early Bird sold out so quickly, within a few hours, thanks!",
            "timestamp": "1741104562",
            "is_creator": true
        },
        {
            "poster": "IQUNIX",
            "comment": "Hi Jacob, thank you so much for your comment! We are brainstorming internally to see if we will have any stretch goals, thanks!",
            "timestamp": "1740916939",
            "is_creator": true
        },
        {
            "poster": "Kurt Neo",
            "comment": "I think you should take it as we have hit your stretch goal now as pledged amount overwhelmingly exceed your intended target",
            "timestamp": "1740925004",
            "is_creator": false
        },
        {
            "poster": "john rey",
            "comment": "Hi, is there any way for us in the Philippines to lower the declared value, such as below $50, so we don't have to pay as much tax? Thank you!",
            "timestamp": "1740901866",
            "is_creator": false
        },
        {
            "poster": "IQUNIX",
            "comment": "Hi john rey, thank you so much for your comment. And yes we will do that, thanks!",
            "timestamp": "1740916911",
            "is_creator": true
        },
        {
            "poster": "Isaiah Sanchez",
            "comment": "John Rey, tax applies when the total cost is 10,000 above.",
            "timestamp": "1740969272",
            "is_creator": false
        },
        {
            "poster": "Mir Shafayat Ahmed",
            "comment": "This was the final push i needed to back this project. In Bangladesh, customs is a huge pain.",
            "timestamp": "1741423069",
            "is_creator": false
        },
        {
            "poster": "Josue De La Torre",
            "comment": "I'm new to kickstarter, would there be a section to add my shipping information at some point?",
            "timestamp": "1740765019",
            "is_creator": false
        },
        {
            "poster": "IQUNIX",
            "comment": "Hi Josue De La Torre, thank you so much for your comment! And yes when the campaign ends we will send out a survey, that's when you can choose colors and type in the shipping info, thanks!",
            "timestamp": "1740793136",
            "is_creator": true
        },
        {
            "poster": "sealmoy",
            "comment": "Hi, is the shipping free, or will we be charged separately?",
            "timestamp": "1740758678",
            "is_creator": false
        },
        {
            "poster": "IQUNIX",
            "comment": "Hi sealmoy, thanks for the comment. Free shipping, thanks!",
            "timestamp": "1740793151",
            "is_creator": true
        },
        {
            "poster": "MD ABU SAYEED",
            "comment": "Is it only 1 gold keycap on add on? I wonder if i can get few different color keycaps for enter ,shift etc .",
            "timestamp": "1740662856",
            "is_creator": false
        },
        {
            "poster": "IQUNIX",
            "comment": "Hi MD ABU SAYEED, thank you so much for your support! For now we only have the standard 1U size gold keycap as add-on, thanks!",
            "timestamp": "1740709235",
            "is_creator": true
        },
        {
            "poster": "johan rubadg",
            "comment": "Hi guys, which shipping courier are you going to use? I'm from the Philippines, by the way.",
            "timestamp": "1740662411",
            "is_creator": false
        },
        {
            "poster": "IQUNIX",
            "comment": "Hi Johan Rubadg, thank you so much for your comment. We partner with a very experienced forwarder, and the carrier varies from country to country, to make sure you will get the product smoothly, we will keep you posted about it, thanks!",
            "timestamp": "1740720825",
            "is_creator": true
        },
        {
            "poster": "johan rubadg",
            "comment": "I recommend you guys use 4PX; we don't have to pay additional fees aside from the shipping fee.",
            "timestamp": "1740721693",
            "is_creator": false
        }
    ]
}