{
    "url": "https://www.kickstarter.com/projects/keykrush/keykrush-orca-split-ergonomic-keyboard/comments",
    "comments": [
        {
            "poster": "Hector L",
            "comment": "What happened with getting different switch options if I can't get the blue instead of the red, I'm gonna have to cancel my pledge because I absolutely can't stand the red or even worse the brown switches.",
            "timestamp": "1742303268",
            "is_creator": false
        },
        {
            "poster": "KEYKRUSH",
            "comment": "Sorry for the confusion! This switch option was added after launch in response to numerous requests, so you couldn’t choose it earlier. However, our design is hot-swappable, and we have noted that you prefer blue switches. Please don’t worry.",
            "timestamp": "1742304391",
            "is_creator": true
        },
        {
            "poster": "KEYKRUSH",
            "comment": "If you have any other questions, please feel free to contact me. Thank you!",
            "timestamp": "1742304391",
            "is_creator": true
        },
        {
            "poster": "Ophelia",
            "comment": "Love to try it out!",
            "timestamp": "1740295599",
            "is_creator": false
        },
        {
            "poster": "JianBo",
            "comment": "I have to say that I have been looking for this kind of product for a very long time, and finally some people did it!!!!! I always have wrist pain when I am typing! This is truly a lifesaver!!!!!",
            "timestamp": "1740144339",
            "is_creator": false
        },
        {
            "poster": "KEYKRUSH",
            "comment": "Thank you to those who truly love this keyboard! Your support is our greatest motivation, and we firmly believe that we will keep moving forward!",
            "timestamp": "1740145827",
            "is_creator": true
        },
        {
            "poster": "Wesley",
            "comment": "True wireless is so appealing to me, wired connections have always been uncomfortable for me.",
            "timestamp": "1740038034",
            "is_creator": false
        },
        {
            "poster": "KEYKRUSH",
            "comment": "Thank you for your support, the product is being prepared～",
            "timestamp": "1740038607",
            "is_creator": true
        },
        {
            "poster": "Theodore Bennett",
            "comment": "Ergo keeb, love it.",
            "timestamp": "1740033869",
            "is_creator": false
        },
        {
            "poster": "KEYKRUSH",
            "comment": "Thank you for your back～We have indeed put a lot of thought into the ergonomic design, which is a key focus for us. We are also optimizing the finger areas and aiming to provide an exceptional tactile experience！",
            "timestamp": "1740038778",
            "is_creator": true
        },
        {
            "poster": "Evelyn Pilgreen",
            "comment": "Very interesting, seems comfy.",
            "timestamp": "1740030471",
            "is_creator": false
        },
        {
            "poster": "KEYKRUSH",
            "comment": "Thank you for your support, and feel free to continue following our updates.",
            "timestamp": "1740038895",
            "is_creator": true
        },
        {
            "poster": "Cuzzzzi",
            "comment": "I just wanted to stop by and say thank you. Thank you for creating such an imaginative product. I’m absolutely thrilled to see something as innovative as the Keykrush ORCA. There’s nothing like it on the market. Your creativity has made a real difference for people like me. Thanks so much for your fantastic work!",
            "timestamp": "1740028981",
            "is_creator": false
        },
        {
            "poster": "KEYKRUSH",
            "comment": "Wow, this is really touching. We will do our best to complete our product and not let down fans like you who have high expectations for us. Thank you so much!",
            "timestamp": "1740039068",
            "is_creator": true
        }
    ]
}