{
    "url": "https://www.kickstarter.com/projects/mythosdesign/litecable-wearable-6-in-1-240w-lanyard-charging-cable/comments",
    "comments": [
        {
            "poster": "Mythos Design",
            "comment": "Hello Jeremy,",
            "timestamp": "1741187108",
            "is_creator": true
        },
        {
            "poster": "Mythos Design",
            "comment": "Thanks for backing us, first of all. MFi is the fundamental certification for leaving the factory and shipping to everywhere in the world. This is undergoing. We did mention that the LiteCable supports USB-PD up to 240W for a Macbook Pro. Adopting USB 2.0 for data transfer in 480Mbp/s since we need to take into consideration the features of its use as a lanyard, it is softer to wear it and we thought more about responding to outdoor use scenarios that require cord charging in the emergency case, thus made the trade-off... It's too stiff to use the faster USB 3.2 cables as the lanyard.",
            "timestamp": "1741187108",
            "is_creator": true
        },
        {
            "poster": "Dario Mazzella",
            "comment": "Which colour options will be available at the end of the campaign?",
            "timestamp": "1740217019",
            "is_creator": false
        },
        {
            "poster": "Mythos Design",
            "comment": "Hi Dario,",
            "timestamp": "1740229804",
            "is_creator": true
        },
        {
            "poster": "Mythos Design",
            "comment": "As we mentioned on the page, the Army Green and Bright Orange colors will be available in the survey. :) You can also directly select or upgrade the reward tier to the mix color bundle, and then you will get both of them, without further choosing on the survey. Besides, we are also considering adding the color black for our backers. Once we confirm, we will release it on the campaign page. Thank you.:)",
            "timestamp": "1740229804",
            "is_creator": true
        }
    ]
}