{
    "url": "https://www.kickstarter.com/projects/833938143/lshow-plasma-deodorizer-stop-body-odor-and-stay-fresh-all-day/comments",
    "comments": [
        {
            "poster": "LSHOW",
            "comment": "Hi Magdi,",
            "timestamp": "1740450789",
            "is_creator": true
        },
        {
            "poster": "LSHOW",
            "comment": "Thank you very much for your valuable feedback. We fully understand your concern about the actual effectiveness of the product. The issue of body odor does vary from person to person, and your cautious attitude is very reasonable. We have test reports to prove the effect of plasma. If you need it, we can send it to your email.",
            "timestamp": "1740450789",
            "is_creator": true
        },
        {
            "poster": "LSHOW",
            "comment": "I did send you an email, but I don't know why you didn't receive it. I have already sent it many times.",
            "timestamp": "1741226368",
            "is_creator": true
        },
        {
            "poster": "LSHOW",
            "comment": "Hi Magdi,",
            "timestamp": "1740368808",
            "is_creator": true
        },
        {
            "poster": "LSHOW",
            "comment": "Thank you for your question.",
            "timestamp": "1740368808",
            "is_creator": true
        },
        {
            "poster": "LSHOW",
            "comment": "We have experimental research papers that we can send to your email. Please send me your email.",
            "timestamp": "1740368808",
            "is_creator": true
        },
        {
            "poster": "LSHOW",
            "comment": "Meanwhile, here are several authoritative papers and related statements on the elimination of odors by low-temperature plasma:",
            "timestamp": "1740368808",
            "is_creator": true
        },
        {
            "poster": "LSHOW",
            "comment": "1. Antibacterial and Deodorizing Effects of Cold Atmosphere Plasma Applied Electronic Deodoriant",
            "timestamp": "1740368808",
            "is_creator": true
        },
        {
            "poster": "LSHOW",
            "comment": "• Publication date: February 6, 2024",
            "timestamp": "1740368808",
            "is_creator": true
        },
        {
            "poster": "LSHOW",
            "comment": "• Source: Nature",
            "timestamp": "1740368808",
            "is_creator": true
        },
        {
            "poster": "LSHOW",
            "comment": "Core content: The application of cold atmospheric plasma in electronic deodorizers was studied, and it was found that it has dual effects of antibacterial and deodorizing. Experiments have shown that cold plasma has a high degradation efficiency for volatile organic compounds (VOCs) and can effectively inhibit bacterial growth, thereby reducing the production of odors.",
            "timestamp": "1740368808",
            "is_creator": true
        },
        {
            "poster": "LSHOW",
            "comment": "2. Research progress on low-temperature plasma removal of VOCs technology",
            "timestamp": "1740368808",
            "is_creator": true
        },
        {
            "poster": "LSHOW",
            "comment": "• Publication date: December 11, 2024",
            "timestamp": "1740368808",
            "is_creator": true
        },
        {
            "poster": "LSHOW",
            "comment": "• Source: Chemical Engineering Paper",
            "timestamp": "1740368808",
            "is_creator": true
        },
        {
            "poster": "LSHOW",
            "comment": "• Core content: Introduces the principle and application of low-temperature plasma for removing volatile organic compounds (VOCs). Research has shown that low-temperature plasma can efficiently degrade VOCs and eliminate odors through high-energy electron excitation and chemical reactions. Meanwhile, the article also explores the coupling application of low-temperature plasma with other technologies such as catalytic oxidation, further improving the degradation efficiency of pollutants.",
            "timestamp": "1740368808",
            "is_creator": true
        },
        {
            "poster": "LSHOW",
            "comment": "3. A combined process of non thermal plasma and a low cost mineral adsorbent for VOC removal and odor mitigation in emissions of organic waste treatment plants",
            "timestamp": "1740368808",
            "is_creator": true
        },
        {
            "poster": "LSHOW",
            "comment": "• Author: Dobslaw D,Ortlinglehaus O,Dobslaw C",
            "timestamp": "1740368808",
            "is_creator": true
        },
        {
            "poster": "LSHOW",
            "comment": "• Publication time: 2018",
            "timestamp": "1740368808",
            "is_creator": true
        },
        {
            "poster": "LSHOW",
            "comment": "• Core content: Studied the combination of non thermal plasma and low-cost mineral adsorbents for the treatment of VOCs and odors emitted from organic waste treatment plants. The results indicate that this combination process can effectively remove VOCs and significantly reduce the intensity of odors.",
            "timestamp": "1740368808",
            "is_creator": true
        },
        {
            "poster": "LSHOW",
            "comment": "4. Influence of operational conditions on the performance of non thermal plasma technology for VOC pollution control",
            "timestamp": "1740368808",
            "is_creator": true
        },
        {
            "poster": "LSHOW",
            "comment": "• Author: Adelodun A A",
            "timestamp": "1740368808",
            "is_creator": true
        },
        {
            "poster": "LSHOW",
            "comment": "• Publication time: 2020",
            "timestamp": "1740368808",
            "is_creator": true
        },
        {
            "poster": "LSHOW",
            "comment": "• Core content: Explored the impact of operating conditions on the treatment of VOCs pollution using non thermal plasma technology. Research has shown that factors such as gas concentration, residence time, and discharge parameters have a significant impact on the degradation efficiency and odor elimination effect of VOCs.",
            "timestamp": "1740368808",
            "is_creator": true
        },
        {
            "poster": "LSHOW",
            "comment": "5. Post polymerization catalytic degradation of tower using atmosphere double dielectric barrier discharge combined with MnO based catalysts",
            "timestamp": "1740368808",
            "is_creator": true
        },
        {
            "poster": "LSHOW",
            "comment": "• Author: Zhang S,Liang J Y,Yu X Y,et al.",
            "timestamp": "1740368808",
            "is_creator": true
        },
        {
            "poster": "LSHOW",
            "comment": "• Publication time: 2021",
            "timestamp": "1740368808",
            "is_creator": true
        },
        {
            "poster": "LSHOW",
            "comment": "Core content: The post plasma catalytic degradation effect of toluene by atmospheric dual dielectric barrier discharge combined with MnO based catalyst was studied. The results showed that the synergistic effect of plasma and catalyst significantly improved the degradation efficiency of toluene and the selectivity of CO ₂, while reducing the generation of odors.",
            "timestamp": "1740368808",
            "is_creator": true
        },
        {
            "poster": "LSHOW",
            "comment": "6. Volatile Organic Compounds Degradation by Non Thermal Plasma: A Review",
            "timestamp": "1740368808",
            "is_creator": true
        },
        {
            "poster": "LSHOW",
            "comment": "• Author: He Y,Shen J,Alharbi N S,Chen C",
            "timestamp": "1740368808",
            "is_creator": true
        },
        {
            "poster": "LSHOW",
            "comment": "• Publication date: 2023",
            "timestamp": "1740368808",
            "is_creator": true
        },
        {
            "poster": "LSHOW",
            "comment": "• Core content: This article reviews the research progress on non thermal plasma degradation of volatile organic compounds (VOCs). The article provides a detailed analysis of the degradation mechanism, influencing factors, and coupling applications with other technologies of non thermal plasma. Research has shown that non thermal plasma technology has the advantages of high efficiency and energy saving in eliminating VOCs and odors.",
            "timestamp": "1740368808",
            "is_creator": true
        },
        {
            "poster": "LSHOW",
            "comment": "7. Non thermal plasma coupled with a wet scrubber for removing odorous VOCs",
            "timestamp": "1740368808",
            "is_creator": true
        },
        {
            "poster": "LSHOW",
            "comment": "• Author: Kim M R,Jeon W,Kim S",
            "timestamp": "1740368808",
            "is_creator": true
        },
        {
            "poster": "LSHOW",
            "comment": "• Publication date: 2023",
            "timestamp": "1740368808",
            "is_creator": true
        },
        {
            "poster": "LSHOW",
            "comment": "Core content: The study investigated the effectiveness of coupling non thermal plasma with wet scrubbers in removing odorous volatile organic compounds (VOCs). The results indicate that this combination process can effectively remove odorous VOCs and exhibits good adaptability when dealing with complex gas components.",
            "timestamp": "1740368808",
            "is_creator": true
        },
        {
            "poster": "LSHOW",
            "comment": "8. Key Technologies for Low Temperature Plasma Purification of Volatile Organic Compounds",
            "timestamp": "1740368808",
            "is_creator": true
        },
        {
            "poster": "LSHOW",
            "comment": "• Authors: Yao Shuiliang, Zhang Xuming, Lu Hao",
            "timestamp": "1740368808",
            "is_creator": true
        },
        {
            "poster": "LSHOW",
            "comment": "• Publication time: 2020",
            "timestamp": "1740368808",
            "is_creator": true
        },
        {
            "poster": "LSHOW",
            "comment": "Core content: Explored the key technologies for low-temperature plasma purification of volatile organic compounds, including discharge methods, reactor design, and optimization of operating parameters. Research has shown that low-temperature plasma technology has significant advantages in treating low concentration and high air volume VOCs, and can effectively eliminate odors.",
            "timestamp": "1740368808",
            "is_creator": true
        },
        {
            "poster": "Roy",
            "comment": "Do you have scientific results as proof of its effectiveness?",
            "timestamp": "1740008826",
            "is_creator": false
        },
        {
            "poster": "LSHOW",
            "comment": "Hi Roy,",
            "timestamp": "1740036025",
            "is_creator": true
        },
        {
            "poster": "LSHOW",
            "comment": "We have a patent certificate for a plasma generating device. At present, plasma is also widely used in the medical field. Please refer the explanation on our detail page.",
            "timestamp": "1740036025",
            "is_creator": true
        },
        {
            "poster": "LSHOW",
            "comment": "If you have any question, please send to this email : lshow0602@outlook.com",
            "timestamp": "1740036025",
            "is_creator": true
        }
    ]
}