{
    "url": "https://www.kickstarter.com/projects/1723035011/macrodock-the-ultimate-docking-and-macro-solution/comments",
    "comments": [
        {
            "poster": "MacroDock",
            "comment": "Hi Zingo,",
            "timestamp": "1739368208",
            "is_creator": true
        },
        {
            "poster": "MacroDock",
            "comment": "Thank you for your question. Currently, the MacroDock’s macro functionality is only supported on Windows and macOS. However, the docking features (ports, etc.) work on Linux without needing drivers.",
            "timestamp": "1739368208",
            "is_creator": true
        },
        {
            "poster": "MacroDock",
            "comment": "We are planning to develop Linux support for the macro functionality in future updates.",
            "timestamp": "1739368208",
            "is_creator": true
        },
        {
            "poster": "MacroDock",
            "comment": "Best regards,",
            "timestamp": "1739368208",
            "is_creator": true
        },
        {
            "poster": "MacroDock",
            "comment": "MacroDock Team",
            "timestamp": "1739368208",
            "is_creator": true
        },
        {
            "poster": "Magdi Awad",
            "comment": "Hi I just supported your Macrodock, the reason is your quick response to my questions about upgrading Ethernet port to 2.5 gbs and charging port to PD 3.1, even if PD3.1 is not possible for this project, PD 3.0 still acceptable.",
            "timestamp": "1739112207",
            "is_creator": false
        },
        {
            "poster": "Magdi Awad",
            "comment": "I have some observations that I would like the Macrodock team to address and possibly make the change:",
            "timestamp": "1739112207",
            "is_creator": false
        },
        {
            "poster": "Magdi Awad",
            "comment": "1) You have the SD/TF slots on the left side of the dock, can you please move these slots to the right side of the dock. This simple change will make workflow a lot easier to use and inset the SD card into the dock.",
            "timestamp": "1739112207",
            "is_creator": false
        },
        {
            "poster": "Magdi Awad",
            "comment": "2) The video resolution is 8K/30Hz, can you list the resolutions for 6k, 4k, 2k....",
            "timestamp": "1739112207",
            "is_creator": false
        },
        {
            "poster": "Magdi Awad",
            "comment": "3) Since this is your first campaign, can you make the pledge and posted on the top of you campaign page that you Grantee delivery and shipment.",
            "timestamp": "1739112207",
            "is_creator": false
        },
        {
            "poster": "Magdi Awad",
            "comment": "4) can you post a detailed user manual and how to document in pdf format, that is in addition to the small print one that ship with the product.",
            "timestamp": "1739112207",
            "is_creator": false
        },
        {
            "poster": "Magdi Awad",
            "comment": "5) do you have a web site that we can log into for plugin/firmware updates",
            "timestamp": "1739112207",
            "is_creator": false
        },
        {
            "poster": "Magdi Awad",
            "comment": "Lastly this is just a wish list for your future upgraded dock",
            "timestamp": "1739112207",
            "is_creator": false
        },
        {
            "poster": "Magdi Awad",
            "comment": "1) Support of PD3.1",
            "timestamp": "1739112207",
            "is_creator": false
        },
        {
            "poster": "Magdi Awad",
            "comment": "2) Support of USB 4 gen2/TB4 (5). please have at least 2 ports of this type, but also keep a least 2 usb3.2 ports for compatibility purposes",
            "timestamp": "1739112207",
            "is_creator": false
        },
        {
            "poster": "Magdi Awad",
            "comment": "3) Support to DD/TF 4 or 5",
            "timestamp": "1739112207",
            "is_creator": false
        },
        {
            "poster": "Magdi Awad",
            "comment": "4) In my humble opinion, the audio port is somehow absolute, most of the headphones/earbuds now are wireless, BT, you can use this audio port for any other purpose.",
            "timestamp": "1739112207",
            "is_creator": false
        },
        {
            "poster": "Magdi Awad",
            "comment": "5) two hdmi 2.1 port to connection two separate monitors. (you can use the audio port for the second hdmi if you choose to eliminate this audio port for future product.",
            "timestamp": "1739112207",
            "is_creator": false
        },
        {
            "poster": "Magdi Awad",
            "comment": "thanks a lot for listening and responding, Good luck and waiting for your Dock to be delivered on the stated time frame",
            "timestamp": "1739112207",
            "is_creator": false
        },
        {
            "poster": "MacroDock",
            "comment": "Hi Magdi,",
            "timestamp": "1739118832",
            "is_creator": true
        },
        {
            "poster": "MacroDock",
            "comment": "Thank you for your support and thoughtful feedback. We truly appreciate your suggestions and would like to address them one by one:",
            "timestamp": "1739118832",
            "is_creator": true
        },
        {
            "poster": "MacroDock",
            "comment": "1. SD/TF Slot Position: We can certainly consider changing the position of the SD/TF slots. We will conduct a poll after the campaign ends to decide on this modification. We want to respect the majority opinion of our backers.",
            "timestamp": "1739118832",
            "is_creator": true
        },
        {
            "poster": "MacroDock",
            "comment": "2. Video Resolution:",
            "timestamp": "1739118832",
            "is_creator": true
        },
        {
            "poster": "MacroDock",
            "comment": "• 8K @30Hz",
            "timestamp": "1739118832",
            "is_creator": true
        },
        {
            "poster": "MacroDock",
            "comment": "• 6K @30Hz",
            "timestamp": "1739118832",
            "is_creator": true
        },
        {
            "poster": "MacroDock",
            "comment": "• 4K @30Hz/60Hz",
            "timestamp": "1739118832",
            "is_creator": true
        },
        {
            "poster": "MacroDock",
            "comment": "• 2K @60Hz/120Hz/144Hz",
            "timestamp": "1739118832",
            "is_creator": true
        },
        {
            "poster": "MacroDock",
            "comment": "• 1080p @60Hz/120Hz/240Hz",
            "timestamp": "1739118832",
            "is_creator": true
        },
        {
            "poster": "MacroDock",
            "comment": "3.Delivery and Shipment Commitment: Although this is our first event, we will definitely deliver and transport. Please rest assured that we will clearly display our commitment to delivery and transportation at the top of the event page based on your suggestions.",
            "timestamp": "1739118832",
            "is_creator": true
        },
        {
            "poster": "MacroDock",
            "comment": "4. User Manual and Documentation: We will release a detailed user manual and documentation in PDF format, which will be available for download on our website in the future. This will complement the brief manual included with the product.",
            "timestamp": "1739118832",
            "is_creator": true
        },
        {
            "poster": "MacroDock",
            "comment": "5. Plugin/Firmware Updates: We are working on building a website where users can log in to access plugin and firmware updates. Our website will be built before the event ends.",
            "timestamp": "1739118832",
            "is_creator": true
        },
        {
            "poster": "MacroDock",
            "comment": "We take your suggestions seriously and will consider them for the next generation of MacroDock. This includes the potential for PD3.1 support, USB4 gen2/TB4（5） ports, and additional features like dual HDMI ports and Bluetooth audio solutions.",
            "timestamp": "1739118832",
            "is_creator": true
        },
        {
            "poster": "MacroDock",
            "comment": "Thank you once again for your valuable input. We’re excited to bring MacroDock to life, and we’ll be working hard to make the product even better in the future!",
            "timestamp": "1739118832",
            "is_creator": true
        },
        {
            "poster": "MacroDock",
            "comment": "Best regards,",
            "timestamp": "1739118832",
            "is_creator": true
        },
        {
            "poster": "MacroDock",
            "comment": "MacroDock Team",
            "timestamp": "1739118832",
            "is_creator": true
        },
        {
            "poster": "Kris McCann",
            "comment": "I also echo the sentiment about the audio jack. Most people are going to be using audio over HDMI, or if using headphones, they're likely to be wireless, and if not, it's not that much bother to plug them into the computer. A second HDMI port would be massively more useful than an audio port. I hope that you will consider this if your designs aren't finalized. I'm willing to bet that myself and OP are far from the only ones who have no use at all for an additional headphone jack, but could definitely use more than a single HDMI out. Even making the second out DisplayPort would be acceptable (though HDMI would be preferred by myself).",
            "timestamp": "1740250601",
            "is_creator": false
        },
        {
            "poster": "Kris McCann",
            "comment": "Thanks for taking the time to read this, and I'm very excited to receive my MacroDock.",
            "timestamp": "1740250601",
            "is_creator": false
        },
        {
            "poster": "MacroDock",
            "comment": "@Kris McCann",
            "timestamp": "1740564913",
            "is_creator": true
        },
        {
            "poster": "MacroDock",
            "comment": "Hi Kris,",
            "timestamp": "1740564913",
            "is_creator": true
        },
        {
            "poster": "MacroDock",
            "comment": "Thank you so much for your thoughtful suggestion! We truly appreciate your feedback, and we completely understand the desire for an additional HDMI port. We agree that this would be more useful for many users.",
            "timestamp": "1740564913",
            "is_creator": true
        },
        {
            "poster": "MacroDock",
            "comment": "For our next generation of products, we’re planning to include an extra HDMI port, and we will definitely keep your input in mind during the design process. Unfortunately, due to production timelines, we won’t be able to make any significant changes for this current generation. However, your feedback is valuable, and we’ll strive to improve in future versions.",
            "timestamp": "1740564913",
            "is_creator": true
        },
        {
            "poster": "MacroDock",
            "comment": "Thank you again for sharing your thoughts。",
            "timestamp": "1740564913",
            "is_creator": true
        },
        {
            "poster": "MacroDock",
            "comment": "Best regards,",
            "timestamp": "1740564913",
            "is_creator": true
        },
        {
            "poster": "MacroDock",
            "comment": "MacroDock Team",
            "timestamp": "1740564913",
            "is_creator": true
        },
        {
            "poster": "Corbin",
            "comment": "Hello I love what I'm seeing with this I have an idea for this I'd like to potentially see this come with either an add on or just added to it but that would be a carry case for those who plan to use this with mobile devices who may Wana take it on the go for like mobile edits or mobile workflow or simply for those who want a good macro controller when out using the mobile device for media like going to a party and hooking to say a speaker and screen for .music ect I'd love to hear what you think",
            "timestamp": "1738936582",
            "is_creator": false
        },
        {
            "poster": "Corbin",
            "comment": "I'm personally interested in like a gold and gunmetal or a gold red or because you said anodized it would be neat to have the whole blue gold orange mix you see in alot of custom knife designs I am a big pocket knife guy and love that mix personally heck even a bronze and copper mix would be nice",
            "timestamp": "1739503215",
            "is_creator": false
        },
        {
            "poster": "MacroDock",
            "comment": "Hi Corbin,",
            "timestamp": "1739503719",
            "is_creator": true
        },
        {
            "poster": "MacroDock",
            "comment": "Thanks for sharing your thoughts on color combinations! I totally get what you mean, and I will share these suggestions with our design team. We will update and let you know if we ever roll out color combination options.",
            "timestamp": "1739503719",
            "is_creator": true
        },
        {
            "poster": "MacroDock",
            "comment": "Thanks again for your input!",
            "timestamp": "1739503719",
            "is_creator": true
        },
        {
            "poster": "MacroDock",
            "comment": "Best regards,",
            "timestamp": "1739503719",
            "is_creator": true
        },
        {
            "poster": "MacroDock",
            "comment": "MacroDock Team",
            "timestamp": "1739503719",
            "is_creator": true
        },
        {
            "poster": "Corbin",
            "comment": "Awesome thank you guys for the consideration I honestly think this will make the macrodock amazing compared to.whats out there sure some companies offer a few choices but they never let the consumer customize this would be a huge leg up for you guys in my opinion I'm also very appreciative in your responses time and effort shows you care about making a great product and as a buyer that's what I like to see so keep up the good work and I can't wait to see where this goes",
            "timestamp": "1739504705",
            "is_creator": false
        }
    ]
}