{
    "url": "https://www.kickstarter.com/projects/magmirror/magmirror-create-professional-content-with-your-smartphone/comments",
    "comments": [
        {
            "poster": "Ankit Bhangar",
            "comment": "Hi Mr. E, thanks for sharing your concerns. We understand that a reliable external mic solution is crucial for your videos, and we're actively working on a USB hub for non-Bluetooth mics so you can use your existing gear without extra expense. Some details are still being finalized, but rest assured our team is working diligently and we'll keep you updated as we progress.",
            "timestamp": "1742433373",
            "is_creator": true
        },
        {
            "poster": "Ankit Bhangar",
            "comment": "Regarding production and delivery, we're on track for June 2025 and will share a detailed update in the next two days. Thank you for your support and patience!",
            "timestamp": "1742433373",
            "is_creator": true
        },
        {
            "poster": "Mustapha Mohamad (Moose)",
            "comment": "Hi team! Backer #104 here~ Unfortunately after much deliberation, I’m amending my pledge for now to monitor progress as there’s no certainty/update yet concerning using external mic after plugging MagMirror to my phone. It’s a deal breaker for me. But I will be back on board if the other usb port could address this especially with a demo of any of the mics ( rode/ dji mics) working to help confirm it.",
            "timestamp": "1742421335",
            "is_creator": false
        },
        {
            "poster": "Mustapha Mohamad (Moose)",
            "comment": "I hope you’ll get there as I MagMirror and your team looks promising! I’m rooting for you guys! 💪🏻💪🏻💪🏻",
            "timestamp": "1742421335",
            "is_creator": false
        },
        {
            "poster": "Ankit Bhangar",
            "comment": "Hi Mustapha, thank you for rooting for us and staying with us :). Research takes time, and we're actively exploring multiple hub solutions that can connect to MagMirror to attach a mic or even SSDs. We'll keep you updated as soon as we crack it. Thanks again for your support!",
            "timestamp": "1742433086",
            "is_creator": true
        },
        {
            "poster": "Joshua",
            "comment": "I canceled my pledge and came back temporarily through the chat with you. I hope the size of the monitor gets bigger by reducing or removing light. The light is just an option for me.",
            "timestamp": "1742393305",
            "is_creator": false
        },
        {
            "poster": "Ankit Bhangar",
            "comment": "Hi Joshua, thanks for your input! We’re exploring ways to increase the monitor size, but in the current version the light remains an essential feature. However, after the campaign, we may consider a variant without the light—and with a larger screen—to better suit your needs.",
            "timestamp": "1742400148",
            "is_creator": true
        },
        {
            "poster": "Ankit Bhangar",
            "comment": "Hey Ramy, Excellent timing on the comment. We are scheduling a live demo in the next 5 days on YouTube, and we will publish the video on Kickstarter as well.",
            "timestamp": "1740903875",
            "is_creator": true
        },
        {
            "poster": "Ankit Bhangar",
            "comment": "Hi, sorry for the late update. We have been traveling to shortlist the manufacturer. Please find an update video here - https://www.youtube.com/live/9ROXtwYer-4?si=WJX-2U6Ev7-5BUaO",
            "timestamp": "1741709039",
            "is_creator": true
        },
        {
            "poster": "Ankit Bhangar",
            "comment": "Hi Sanluke, we’re on the same page! We’ve already built in a circular button—right below the light mode toggle—to enable or disable wireless charging, so your battery stays ready for photos and videos. Thanks for the awesome feedback!",
            "timestamp": "1740800153",
            "is_creator": true
        },
        {
            "poster": "Ankit Bhangar",
            "comment": "Hi Ray, the image is already inverted similar to taking a picture from a front camera.",
            "timestamp": "1740620170",
            "is_creator": true
        },
        {
            "poster": "Ankit Bhangar",
            "comment": "Hi, please allow us a little more time. Due to the change in new US tariffs, we need to re-evaluate our strategy to avoid high costs for our backers. We are now finding manufacturers in India too.",
            "timestamp": "1741709147",
            "is_creator": true
        },
        {
            "poster": "Ankit Bhangar",
            "comment": "Hi Jens, 10,000 mAH would make MagMirror very bulky, so we stuck to 4,000 mAH. We are researching if we can increase the capacity to 5,000 mAH within the same dimensions.",
            "timestamp": "1740103188",
            "is_creator": true
        },
        {
            "poster": "Ankit Bhangar",
            "comment": "Hey Ingrid, you can attach the magnetic right to your case/protective cover. I would not recommend doing it on the mobile.",
            "timestamp": "1739960988",
            "is_creator": true
        },
        {
            "poster": "Ankit Bhangar",
            "comment": "Another option is to get cases with the magnetic right inbuilt.",
            "timestamp": "1739960988",
            "is_creator": true
        },
        {
            "poster": "Ankit Bhangar",
            "comment": "The tripod has 2 sides with MagSafe compatible magnet, one side you can attach you phone and the other side MagMirror.",
            "timestamp": "1739971419",
            "is_creator": true
        },
        {
            "poster": "Ankit Bhangar",
            "comment": "Currently, MagMirror is compatible with iPhone 15 and above; however, with an additional cable, older iPhones with Lightning connectors can also be used—one of the key reasons we're raising funds to complete our research for broader compatibility.",
            "timestamp": "1739971574",
            "is_creator": true
        },
        {
            "poster": "Ankit Bhangar",
            "comment": "Hi @Andrew, MagMirror uses a wired USB connection—no extra app is needed—just like connecting your phone to a TV with a cable. Unlike wireless methods such as Apple AirPlay and Google Cast, which rely on Wi-Fi and Bluetooth and can introduce lag, our approach guarantees a fast, reliable, and lag-free experience even when recording 4K 60fps videos.",
            "timestamp": "1739939654",
            "is_creator": true
        },
        {
            "poster": "Ankit Bhangar",
            "comment": "Thanks for your question. We opted against a metal body like carbon fiber or lightweight aluminum because our LED light needs a transparent or semi-transparent material to shine through effectively. Instead, we’re using strong ABS (or a similar material) to provide the durability you’re looking for.",
            "timestamp": "1739939772",
            "is_creator": true
        },
        {
            "poster": "Mustapha Mohamad (Moose)",
            "comment": "Hi team! Just wanna say that I love this but I’d like to ask if it’s possible to use this mic receiver? Or do I have to give up my mic? Thank you 🙏🏼",
            "timestamp": "1739902058",
            "is_creator": false
        },
        {
            "poster": "Erin Timmermann",
            "comment": "Thanks for asking this question. It didn't even occur to me that my mic would be useless since this has to be plugged in.",
            "timestamp": "1740678990",
            "is_creator": false
        }
    ]
}