{
    "url": "https://www.kickstarter.com/projects/arccaptain/mig-205mp-all-in-one-mig-welder-and-cutter-with-app-control/comments",
    "comments": [
        {
            "poster": "ARCCAPTAIN",
            "comment": "Hi Alan! We truly appreciate your continued support! We can't wait to see you start your welding journey and have the most fun with the ARCCAPTAIN MIG 205MP.",
            "timestamp": "1739905920",
            "is_creator": true
        },
        {
            "poster": "Cory Hendrickson",
            "comment": "Alan this will be my first arc captain how do you like your other 3 comparable to miller/esab",
            "timestamp": "1741406134",
            "is_creator": false
        },
        {
            "poster": "ARCCAPTAIN",
            "comment": "Just backed this. My son and I are starting a project truck. Hoping it's up to the tasks we are going to put it through. I'm confident it should do nicely after seeing alot of positive feedback about the other arccaptian welders.",
            "timestamp": "1739911332",
            "is_creator": false
        },
        {
            "poster": "ARCCAPTAIN",
            "comment": "Hi Amdy! Thank you so much for your support, and we're thrilled to hear about your project truck! We're confident that the ARCCAPTAIN MIG 205MP will meet your needs perfectly. Your enthusiasm for our brand means a lot to us, and we’re grateful to have you as part of our community!",
            "timestamp": "1739911332",
            "is_creator": true
        },
        {
            "poster": "ARCCAPTAIN",
            "comment": "I have been waiting for this Kickstarter and glad it is beginning. Already got myself a 100% argon tank to match the 205mp.",
            "timestamp": "1739911513",
            "is_creator": false
        },
        {
            "poster": "ARCCAPTAIN",
            "comment": "Hi Kevin! Thank you for your support! We’re excited to hear you’ve been waiting for our project and that you’ve already got a 100% argon tank ready to go with the MIG 205MP. We’re sure you’ll have an outstanding welding experience!",
            "timestamp": "1739911513",
            "is_creator": true
        },
        {
            "poster": "ciphfer",
            "comment": "Would it be possible to get a link to download the user manual early? This will be my first machine and I wanted to read up on the features so I can be ready when it arrives.",
            "timestamp": "1742134782",
            "is_creator": false
        },
        {
            "poster": "ARCCAPTAIN",
            "comment": "Hi! Thank you for your interest! We'd be happy to provide you with the user manual in advance. Please reach out to us at info@arccaptain.com, and our team will send it to you right away. Let us know if you have any other questions—we’re here to help!",
            "timestamp": "1742206900",
            "is_creator": true
        },
        {
            "poster": "Preston",
            "comment": "ive been looking for info on the plasma cutter in this machine. is it a pilot arc plasma cutter? or high frequency? can it be both a high frequency pilot arc? ive also heard of a blow back pilot arc where the air starts it? as much info you have on this the better. looking to cut through some painted and rusty material.",
            "timestamp": "1742090419",
            "is_creator": false
        },
        {
            "poster": "ARCCAPTAIN",
            "comment": "Hi Preston! Thanks for reaching out! The plasma cutter in this machine is not a pilot arc—it uses high-frequency contact start. This means the torch needs to touch the material to start cutting.",
            "timestamp": "1742208600",
            "is_creator": true
        },
        {
            "poster": "John Hughes",
            "comment": "I see all of Francisco comments I hope we are not going to have trouble with our orders",
            "timestamp": "1741875917",
            "is_creator": false
        },
        {
            "poster": "Francisco",
            "comment": "Please, if you can't make the deposit via PayPal, I've provided the card number for you to do so. If not, please make a transfer, but please sort out my refund immediately, as the wait is too long. Please sort it out now.",
            "timestamp": "1741855433",
            "is_creator": false
        },
        {
            "poster": "Francisco",
            "comment": "Please check your PayPal account, I have sent you the amount to be deposited, to see if everything is correct.",
            "timestamp": "1741609451",
            "is_creator": false
        },
        {
            "poster": "Francisco",
            "comment": "I am sponsor 427 of the sponsored model ARC 130, please respond to my messages to resolve the refund.",
            "timestamp": "1741513016",
            "is_creator": false
        },
        {
            "poster": "Francisco",
            "comment": "Soy patrocinador 427 del modelo patrocinado ARC 130, por favor responda a mis mensajes para solventar la devolución del dinero.",
            "timestamp": "1741512958",
            "is_creator": false
        },
        {
            "poster": "Travis Holtman",
            "comment": "Are there any updates? Issues that have arisen etc?",
            "timestamp": "1741277021",
            "is_creator": false
        },
        {
            "poster": "ARCCAPTAIN",
            "comment": "Hi Travis! We’re actively preparing orders to ensure we can start shipping in April as planned. Additionally, we’ll be hosting a YouTube livestream on March 11 at 8:00 PM ET, where we’ll answer questions from our community. If you’re interested, feel free to follow along here: https://www.youtube.com/live/htfQbSHxPro",
            "timestamp": "1741593139",
            "is_creator": true
        },
        {
            "poster": "ARCCAPTAIN",
            "comment": "Let us know if you have any other questions!",
            "timestamp": "1741593139",
            "is_creator": true
        },
        {
            "poster": "AngelRomero",
            "comment": "Already paid for one, but I'm second-guessing myself. First off, the duty cycle. They say it's got a 205A output, but I've seen similar machines where the duty cycle is way lower than advertised. Heard from others that this brand's welders have issues with overheating and wire feeding problems. I know it's cheap, but if they're cuttin' corners on the important stuff, this thing might not handle real work. Anyone else worried about the quality?",
            "timestamp": "1741068461",
            "is_creator": false
        },
        {
            "poster": "ARCCAPTAIN",
            "comment": "Hi! We have a local warehouse in the U.S., so after-sales service is quick and hassle-free. Our machines are designed for easy maintenance, and most parts can be replaced effortlessly. Plus, we provide detailed guides and support to walk you through the process if needed.",
            "timestamp": "1741592914",
            "is_creator": true
        },
        {
            "poster": "ARCCAPTAIN",
            "comment": "We appreciate your feedback on our customer service response times and are actively working to improve efficiency. Our after-sales support team is highly experienced to assist customers worldwide. Plus, with our 2-year warranty, you can have complete peace of mind. If you ever need assistance, don’t hesitate to reach out—we’re always here to help!",
            "timestamp": "1741592914",
            "is_creator": true
        },
        {
            "poster": "Andre",
            "comment": "Just watched their live stream and asked about duty cycle for ya, 60%. Not great, but not bad either.",
            "timestamp": "1741739703",
            "is_creator": false
        },
        {
            "poster": "Preston",
            "comment": "60% duty cycle full out is great.... look at millers and licolns its like 20-25 percent",
            "timestamp": "1742090162",
            "is_creator": false
        },
        {
            "poster": "Stephane Monette",
            "comment": "If i want to improve ground wire what is the actual size of ground wire for welding?",
            "timestamp": "1740920082",
            "is_creator": false
        },
        {
            "poster": "ARCCAPTAIN",
            "comment": "Hi Stephane! Regarding your question on improving the ground wire, our ground clamp interface features a DINSE 10-25 connector, ensuring a secure and reliable connection for your welding needs.",
            "timestamp": "1741255992",
            "is_creator": true
        },
        {
            "poster": "Stephane Monette",
            "comment": "But i had seen comments and review that some welders had found the size of ground to small for long working shot . They said that they had improve this by using a bigger cable for ground...",
            "timestamp": "1741284207",
            "is_creator": false
        },
        {
            "poster": "John Hughes",
            "comment": "I’m wondering about that myself",
            "timestamp": "1740672813",
            "is_creator": false
        },
        {
            "poster": "ARCCAPTAIN",
            "comment": "Hi! We recommend using an air compressor that can provide 4-5 CFM at 60 PSI.",
            "timestamp": "1740715992",
            "is_creator": true
        },
        {
            "poster": "Francisco",
            "comment": "I am sponsor number: 427 of the previous welder campaign: The ARC130 and I am sending you messages in your email, please reply...",
            "timestamp": "1740586145",
            "is_creator": false
        },
        {
            "poster": "Francisco",
            "comment": "I am sponsor number: 427 of the previous welder campaign: The ARC130 and I am sending you messages in your email, please reply...",
            "timestamp": "1740585996",
            "is_creator": false
        },
        {
            "poster": "ARCCAPTAIN",
            "comment": "Hi, the shipping cost to EU is $50.",
            "timestamp": "1740566671",
            "is_creator": true
        },
        {
            "poster": "George Reilley",
            "comment": "When we able to purchase this?",
            "timestamp": "1740501873",
            "is_creator": false
        },
        {
            "poster": "George Reilley",
            "comment": "Can I purchase it now? I already have $50 in the preorder. When can I pay for the machine?",
            "timestamp": "1740583342",
            "is_creator": false
        },
        {
            "poster": "George Reilley",
            "comment": "Can you send me the link to pay?",
            "timestamp": "1740583632",
            "is_creator": false
        },
        {
            "poster": "ARCCAPTAIN",
            "comment": "Thank you for your support! Please select the reward tier that includes the MIG 205MP, enter your payment details, and complete your pledge on Kickstarter. Once your order is confirmed, you will receive a confirmation email from Kickstarter.",
            "timestamp": "1740973898",
            "is_creator": true
        },
        {
            "poster": "ARCCAPTAIN",
            "comment": "Link: https://www.kickstarter.com/projects/arccaptain/mig-205mp-all-in-one-mig-welder-and-cutter-with-app-control/rewards",
            "timestamp": "1740973898",
            "is_creator": true
        },
        {
            "poster": "ARCCAPTAIN",
            "comment": "We will refund your deposit and apply the discount after the campaign ends, within 14 business days. If you have any questions, feel free to reach out.",
            "timestamp": "1740973898",
            "is_creator": true
        },
        {
            "poster": "Chris",
            "comment": "I just backed this project. I was wondering what kind of warranty comes with the machine? If it breaks down with in 2 or 3 years will we get a replacement? If so Would it be n updated version or the original kickstarter version. I only ask because I got the yeswelder mp200. And got burned with that one. I burned out 2 with in 2.5 years. And now I don't have a welder.",
            "timestamp": "1740324608",
            "is_creator": false
        },
        {
            "poster": "ARCCAPTAIN",
            "comment": "Hi Chris! Thank you for backing our project! Our ARCCAPTAIN MIG 205MP comes with a 2-year warranty, ensuring reliable support in case of any issues.",
            "timestamp": "1740542010",
            "is_creator": true
        },
        {
            "poster": "Josh",
            "comment": "I bypassed the big three welding companies and backed this project instead. Hopefully I made the right decision...only time will tell",
            "timestamp": "1740249428",
            "is_creator": false
        },
        {
            "poster": "ARCCAPTAIN",
            "comment": "We truly appreciate your trust in us! Thank you for choosing ARCCAPTAIN! We’ve put a lot of effort into making the MIG 205MP a powerful and reliable choice, and we’re confident you’ll be happy with your decision. If you ever have any questions or need assistance, we’re here to help!",
            "timestamp": "1740386675",
            "is_creator": true
        },
        {
            "poster": "Noah Katz",
            "comment": "Can the 205MP be used wth a water-cooled TIG torch?",
            "timestamp": "1740157091",
            "is_creator": false
        },
        {
            "poster": "ARCCAPTAIN",
            "comment": "Hi Noah! ARCCAPTAIN MIG 205MP does not support a water-cooled TIG torch.",
            "timestamp": "1740456133",
            "is_creator": true
        }
    ]
}