{
    "url": "https://www.kickstarter.com/projects/haplyrobotics/minverse-the-haptic-3d-mouse-for-the-digital-age/comments",
    "comments": [
        {
            "poster": "Tecrilon",
            "comment": "I sent an email 2 week ago to your sale team, my bank institution won't allow me to pay for 1000$+ with my credit card, i never got an answer from your team + i entered the wrong address when i pre-ordered the 50% thing from the website. I planned multiple uses and integration in my game projects, i have been saving up since the minverse announcement but If we can't make an arrangement unfortunately i'm gonna have turn away as i'm disabled with a thin paycheck and there's no way in 10 years i'm ever gonna buy the device full price.",
            "timestamp": "1742314643",
            "is_creator": false
        },
        {
            "poster": "Tecrilon",
            "comment": "Need minverse asap, planning complete integration as core mechanics for my games, confidential",
            "timestamp": "1742315122",
            "is_creator": false
        },
        {
            "poster": "Haply Robotics Inc.",
            "comment": "Hey Tecrilon, sorry we missed your initial email! We just sent you a reply, please check your inbox (and spam folder just in case).",
            "timestamp": "1742315827",
            "is_creator": true
        },
        {
            "poster": "Lanthern Studio",
            "comment": "Hi, i have some questions regarding the MinVerse, and Pledges, Could you check your inbox (i also sent an email) Im a developer interested in software implementations for this with C++.",
            "timestamp": "1741824685",
            "is_creator": false
        },
        {
            "poster": "Haply Robotics Inc.",
            "comment": "Hi Bartłomiej, VAT and duties will be charged upon shipping, not at the time of your pledge.",
            "timestamp": "1741877857",
            "is_creator": true
        },
        {
            "poster": "Haply Robotics Inc.",
            "comment": "Hey Martin, Our FCC testing will happen when we have our final product design samples.",
            "timestamp": "1740075536",
            "is_creator": true
        },
        {
            "poster": "Haply Robotics Inc.",
            "comment": "This is typical with any Kickstarter or new product, the testing is usually done during the full production run, because we need our approved samples first.",
            "timestamp": "1740075536",
            "is_creator": true
        },
        {
            "poster": "Haply Robotics Inc.",
            "comment": "If you look at the timeline on Kickstarter that will give you a pretty good idea of when our testing would happen.",
            "timestamp": "1740075536",
            "is_creator": true
        },
        {
            "poster": "Haply Robotics Inc.",
            "comment": "Hey Martin,",
            "timestamp": "1740495195",
            "is_creator": true
        },
        {
            "poster": "Haply Robotics Inc.",
            "comment": "Our design is set and certifications are on track as planned. The MinVerse was designed with manufacturing in mind, so moving from small to large-scale production won’t require significant changes. We’re starting with smaller in-house manufacturing runs, just as we do with our Inverse3 enterprise-level haptic device. This allows us to leverage our existing distribution network and certification expertise before scaling up to mass production.",
            "timestamp": "1740495195",
            "is_creator": true
        },
        {
            "poster": "Haply Robotics Inc.",
            "comment": "Right now, our main focus is on refining the applications and software to ensure that when you receive your MinVerse, you’ll be able to use it to its fullest potential.",
            "timestamp": "1740495195",
            "is_creator": true
        },
        {
            "poster": "Haply Robotics Inc.",
            "comment": "Key Advantages of MinVerse Over Touch X",
            "timestamp": "1739895224",
            "is_creator": true
        },
        {
            "poster": "Haply Robotics Inc.",
            "comment": "✅ More Compact & Portable – MinVerse is significantly lighter (1.2kg vs. 3.2kg) and has a smaller footprint, making it easier to integrate into workspaces or carry around.",
            "timestamp": "1739895224",
            "is_creator": true
        },
        {
            "poster": "Haply Robotics Inc.",
            "comment": "✅ Comparable Workspace in a Smaller Device – Despite being more compact, MinVerse offers a comparable or even larger effective workspace (145 x 330 x 250 mm vs. Touch X’s 355 x 228 x 180 mm).",
            "timestamp": "1739895224",
            "is_creator": true
        },
        {
            "poster": "Haply Robotics Inc.",
            "comment": "✅ Modern Connectivity & Expandability – The MinVerse supports USB-C and wireless stylus input, with plans for a wireless mouse, making it future-proof compared to Touch X’s traditional USB-only connection.",
            "timestamp": "1739895224",
            "is_creator": true
        },
        {
            "poster": "Haply Robotics Inc.",
            "comment": "While Touch X has been a standard in haptic feedback, the MinVerse provides equivalent or superior performance in a smaller, lighter, and more modern package—at half the price. With comparable workspace, better expandability, and high-end force feedback, MinVerse is the smarter choice for those looking for affordability without compromising on quality. 🚀",
            "timestamp": "1739895224",
            "is_creator": true
        },
        {
            "poster": "Haply Robotics Inc.",
            "comment": "Thank you so much for reaching out and for your support! One of our key goals with the MinVerse is to make it possible for people like you to feel their digital 3D creations before printing them. We believe haptic feedback can open up a new way to experience and verify designs without needing to 3D print them first.",
            "timestamp": "1739817910",
            "is_creator": true
        },
        {
            "poster": "Haply Robotics Inc.",
            "comment": "We also really appreciate your feedback about accessibility. We're actively working on adding alt text to our campaign to make sure more people can access the information. In the meantime, if you'd like, we'd love to chat more about how the MinVerse could work for you and get your insights on making it as useful as possible.",
            "timestamp": "1739817910",
            "is_creator": true
        },
        {
            "poster": "Haply Robotics Inc.",
            "comment": "We hear you! We uploaded our first update last week and will be sharing more updates regularly from now on. Thanks for your support and for sticking with us!",
            "timestamp": "1739817777",
            "is_creator": true
        },
        {
            "poster": "Dukerax",
            "comment": "Hmm. I've replied to both of your emails in regards to finalizing my pledge - but I've not heard back from either. So I have no idea if your spam filter ate my responses or not. Backer #27 as I've also mentioned in my emails, could you check that you got at least one of 'em?",
            "timestamp": "1738821809",
            "is_creator": false
        },
        {
            "poster": "Haply Robotics Inc.",
            "comment": "Thanks for reaching out! We’ve verified your username and confirmed your pledge—really appreciate your support! 😊 It’s possible your emails got caught up somewhere, but no worries, we’ve got you covered. Let us know if there’s anything else we can do for you!",
            "timestamp": "1738854259",
            "is_creator": true
        },
        {
            "poster": "Dukerax",
            "comment": "Alrighty, thankyou! :>",
            "timestamp": "1738858253",
            "is_creator": false
        },
        {
            "poster": "Haply Robotics Inc.",
            "comment": "Thanks for your support! The delivery for your pledge will be in October because all items in your order are shipped together as a whole package, not separately. Adding the case and 2D mouse to your pledge means the entire delivery will be scheduled for October. Let me know if you have any other questions!",
            "timestamp": "1738791894",
            "is_creator": true
        },
        {
            "poster": "Colin Gallacher",
            "comment": "The case is designed to currently handle the minverse and the stylus. It's a good point to include a section for 3rd party accessories. We'll take a look at what we can do. +:1",
            "timestamp": "1738165386",
            "is_creator": false
        },
        {
            "poster": "Colin Gallacher",
            "comment": "sorry i didn't see question #2! We're still ironing out the details on the 2d mouse attachment. We have a couple ideas around the mouse.",
            "timestamp": "1738211185",
            "is_creator": false
        },
        {
            "poster": "Colin Gallacher",
            "comment": "1) making it so the stylus (we call it the \"verse grip\") magnetically snaps into a 2D mouse dock. the reason we'd do this is so that you still use your fingertips and can get the best sense of detail rather than the palm in a mouse.",
            "timestamp": "1738211185",
            "is_creator": false
        },
        {
            "poster": "Colin Gallacher",
            "comment": "#2 is that we would design a special attachment with a base that would clip to different mice. This is nice but doesn't necessarily highlight the details in 3D",
            "timestamp": "1738211185",
            "is_creator": false
        },
        {
            "poster": "Colin Gallacher",
            "comment": "lastly we're thinking of having a dedicated mouse attachment. This is the most work but probably the best in terms of UX design. Feel free to send a message to the info at haply dot co account if you want more details or to stay up to date.",
            "timestamp": "1738211185",
            "is_creator": false
        },
        {
            "poster": "Jom",
            "comment": "How do I know if I'm a PRE-LAUNCH supporter?",
            "timestamp": "1738121351",
            "is_creator": false
        },
        {
            "poster": "Colin Gallacher",
            "comment": "Nailed it. Pre-launch supporters get a couple additional perks for their down payment before launch. The super early bird, the developer kit, and the prelaunch will have a similar price-point just not some of the things we want to give to the pre-launch supporters as a thank you.",
            "timestamp": "1738165518",
            "is_creator": false
        },
        {
            "poster": "Sébastien Ouellet",
            "comment": "Here are some ideas of what I want to try.",
            "timestamp": "1738099249",
            "is_creator": false
        },
        {
            "poster": "Sébastien Ouellet",
            "comment": "Haptics of vibrations from sound waves of an audio file with MinVerse.",
            "timestamp": "1738099249",
            "is_creator": false
        },
        {
            "poster": "Sébastien Ouellet",
            "comment": "Simulate the density of different fluids and feel the resistance on the MinVerse.",
            "timestamp": "1738099249",
            "is_creator": false
        },
        {
            "poster": "Sébastien Ouellet",
            "comment": "Simulate the feeling of friction of different textures with MinVerse.",
            "timestamp": "1738099249",
            "is_creator": false
        },
        {
            "poster": "Sébastien Ouellet",
            "comment": "Feel the weight of different objects with a weight graduation with MinVerse.",
            "timestamp": "1738099249",
            "is_creator": false
        },
        {
            "poster": "Sébastien Ouellet",
            "comment": "Make you feel the movement of a liquid in a moving container depending on the density of the liquid with MinVerse.",
            "timestamp": "1738099249",
            "is_creator": false
        },
        {
            "poster": "Sébastien Ouellet",
            "comment": "Make people feel the elasticity of different materials with breaking points with the MinVerse.",
            "timestamp": "1738099249",
            "is_creator": false
        },
        {
            "poster": "Sébastien Ouellet",
            "comment": "Translate a text into Morse code and make the letters that make up the words felt through their vibrations on the MinVerse.",
            "timestamp": "1738099249",
            "is_creator": false
        },
        {
            "poster": "Sébastien Ouellet",
            "comment": "Create a virtual instrument like the Steel Tongue Drum and play it with MinVerse.",
            "timestamp": "1738099249",
            "is_creator": false
        },
        {
            "poster": "Colin Gallacher",
            "comment": "I should have said we'll run the vibration test with the minverse too to give you a sense of the dynamic range!",
            "timestamp": "1738165785",
            "is_creator": false
        },
        {
            "poster": "Sébastien Ouellet",
            "comment": "These ideas are to satisfy my curiosity and learn new things. As Inverse3 is available and MinVerse has essentially the same functionality. I figured that ChatGPT should definitely have references for Inverse3 and could use that to answer the questions. And that I could use the answers to experiment with the MinVerse.",
            "timestamp": "1738167551",
            "is_creator": false
        },
        {
            "poster": "Sébastien Ouellet",
            "comment": "I was also able to have ChatGPT generate C++ and javascript code for Inverse3. For example to translate text into mode code or an mp3 file into vibration. I may eventually use this as a starting point with the MinVerse SDK.",
            "timestamp": "1738167551",
            "is_creator": false
        },
        {
            "poster": "Sébastien Ouellet",
            "comment": "So I asked ChatGPT this: What would be the most special feeling to feel with the Inverse3?",
            "timestamp": "1738167551",
            "is_creator": false
        },
        {
            "poster": "Sébastien Ouellet",
            "comment": "Answer from ChatGPT :",
            "timestamp": "1738167551",
            "is_creator": false
        },
        {
            "poster": "Sébastien Ouellet",
            "comment": "The Inverse3 by Haply Robotics, with its ability to apply precise haptic forces, can simulate a wide range of immersive sensations. Here are some of the most unique and special sensations you could experience with this device:",
            "timestamp": "1738167551",
            "is_creator": false
        },
        {
            "poster": "Sébastien Ouellet",
            "comment": "________________________________________",
            "timestamp": "1738167551",
            "is_creator": false
        },
        {
            "poster": "Sébastien Ouellet",
            "comment": "1. Floating or Modified Gravity Sensation",
            "timestamp": "1738167551",
            "is_creator": false
        },
        {
            "poster": "Sébastien Ouellet",
            "comment": "• Description: Simulate a low-gravity environment (like the Moon), zero-gravity (space), or high gravity (a massive planet).",
            "timestamp": "1738167551",
            "is_creator": false
        },
        {
            "poster": "Sébastien Ouellet",
            "comment": "• Feeling: A light force or counter-effect that seems to suspend the object, or alternatively, a strong pull downward.",
            "timestamp": "1738167551",
            "is_creator": false
        },
        {
            "poster": "Sébastien Ouellet",
            "comment": "• Use case:",
            "timestamp": "1738167551",
            "is_creator": false
        },
        {
            "poster": "Sébastien Ouellet",
            "comment": "o Training for astronauts or microgravity experiments.",
            "timestamp": "1738167551",
            "is_creator": false
        },
        {
            "poster": "Sébastien Ouellet",
            "comment": "o Immersive VR simulations where the user explores extraterrestrial environments.",
            "timestamp": "1738167551",
            "is_creator": false
        },
        {
            "poster": "Sébastien Ouellet",
            "comment": "________________________________________",
            "timestamp": "1738167551",
            "is_creator": false
        },
        {
            "poster": "Sébastien Ouellet",
            "comment": "2. Dynamic Non-Newtonian Fluids",
            "timestamp": "1738167551",
            "is_creator": false
        },
        {
            "poster": "Sébastien Ouellet",
            "comment": "• Description: Simulate materials like Oobleck or quicksand, where resistance depends on movement speed.",
            "timestamp": "1738167551",
            "is_creator": false
        },
        {
            "poster": "Sébastien Ouellet",
            "comment": "• Feeling: A resistance that increases with force or speed, creating the impression of plunging hands into a reactive, living material.",
            "timestamp": "1738167551",
            "is_creator": false
        },
        {
            "poster": "Sébastien Ouellet",
            "comment": "• Use case:",
            "timestamp": "1738167551",
            "is_creator": false
        },
        {
            "poster": "Sébastien Ouellet",
            "comment": "o Scientific or educational explorations to demonstrate physical concepts.",
            "timestamp": "1738167551",
            "is_creator": false
        },
        {
            "poster": "Sébastien Ouellet",
            "comment": "o Immersive, interactive experiences that intrigue the user.",
            "timestamp": "1738167551",
            "is_creator": false
        },
        {
            "poster": "Sébastien Ouellet",
            "comment": "________________________________________",
            "timestamp": "1738167551",
            "is_creator": false
        },
        {
            "poster": "Sébastien Ouellet",
            "comment": "3. Realistic Texture of a Living Object",
            "timestamp": "1738167551",
            "is_creator": false
        },
        {
            "poster": "Sébastien Ouellet",
            "comment": "• Description: Simulate the sensation of a heartbeat, breathing, or muscular contractions of a living organism.",
            "timestamp": "1738167551",
            "is_creator": false
        },
        {
            "poster": "Sébastien Ouellet",
            "comment": "• Feeling: A rhythmic vibration or movement that mimics biological patterns (e.g., heart rate or lung expansion/contraction).",
            "timestamp": "1738167551",
            "is_creator": false
        },
        {
            "poster": "Sébastien Ouellet",
            "comment": "• Use case:",
            "timestamp": "1738167551",
            "is_creator": false
        },
        {
            "poster": "Sébastien Ouellet",
            "comment": "o Medical simulations or training to feel organs in a virtual surgery environment.",
            "timestamp": "1738167551",
            "is_creator": false
        },
        {
            "poster": "Sébastien Ouellet",
            "comment": "o Emotional immersive experiences to \"feel\" the \"life\" of an object.",
            "timestamp": "1738167551",
            "is_creator": false
        },
        {
            "poster": "Sébastien Ouellet",
            "comment": "________________________________________",
            "timestamp": "1738167551",
            "is_creator": false
        },
        {
            "poster": "Sébastien Ouellet",
            "comment": "4. Magnetic Friction",
            "timestamp": "1738167551",
            "is_creator": false
        },
        {
            "poster": "Sébastien Ouellet",
            "comment": "• Description: Simulate a resistance or magnetic attraction, as if two magnets were interacting at a distance.",
            "timestamp": "1738167551",
            "is_creator": false
        },
        {
            "poster": "Sébastien Ouellet",
            "comment": "• Feeling: A variable force depending on the position or proximity of a virtual object, mimicking magnetic attraction or repulsion.",
            "timestamp": "1738167551",
            "is_creator": false
        },
        {
            "poster": "Sébastien Ouellet",
            "comment": "• Use case:",
            "timestamp": "1738167551",
            "is_creator": false
        },
        {
            "poster": "Sébastien Ouellet",
            "comment": "o Visualizing magnetic interactions for physics education.",
            "timestamp": "1738167551",
            "is_creator": false
        },
        {
            "poster": "Sébastien Ouellet",
            "comment": "o Immersive experiences where the user feels invisible forces.",
            "timestamp": "1738167551",
            "is_creator": false
        },
        {
            "poster": "Sébastien Ouellet",
            "comment": "________________________________________",
            "timestamp": "1738167551",
            "is_creator": false
        },
        {
            "poster": "Sébastien Ouellet",
            "comment": "5. Stretching and Snapping Elastic Bands",
            "timestamp": "1738167551",
            "is_creator": false
        },
        {
            "poster": "Sébastien Ouellet",
            "comment": "• Description: Simulate the sensation of an elastic band being stretched under tension and snapping back when released.",
            "timestamp": "1738167551",
            "is_creator": false
        },
        {
            "poster": "Sébastien Ouellet",
            "comment": "• Feeling: A resistance that gradually increases, followed by a rapid release (a \"snap\").",
            "timestamp": "1738167551",
            "is_creator": false
        },
        {
            "poster": "Sébastien Ouellet",
            "comment": "• Use case:",
            "timestamp": "1738167551",
            "is_creator": false
        },
        {
            "poster": "Sébastien Ouellet",
            "comment": "o Games or puzzles where users manipulate virtual ropes or elastic bands.",
            "timestamp": "1738167551",
            "is_creator": false
        },
        {
            "poster": "Sébastien Ouellet",
            "comment": "o Simulations of slingshots or archery.",
            "timestamp": "1738167551",
            "is_creator": false
        },
        {
            "poster": "Sébastien Ouellet",
            "comment": "________________________________________",
            "timestamp": "1738167551",
            "is_creator": false
        },
        {
            "poster": "Sébastien Ouellet",
            "comment": "6. Simulated Electric Shocks",
            "timestamp": "1738167551",
            "is_creator": false
        },
        {
            "poster": "Sébastien Ouellet",
            "comment": "• Description: A rapid, \"tingling\" haptic vibration mimicking an electric shock.",
            "timestamp": "1738167551",
            "is_creator": false
        },
        {
            "poster": "Sébastien Ouellet",
            "comment": "• Feeling: Short, sudden, repetitive haptic pulses to simulate a zap or electrifying contact.",
            "timestamp": "1738167551",
            "is_creator": false
        },
        {
            "poster": "Sébastien Ouellet",
            "comment": "• Use case:",
            "timestamp": "1738167551",
            "is_creator": false
        },
        {
            "poster": "Sébastien Ouellet",
            "comment": "o Simulations of dangerous environments (without real risk).",
            "timestamp": "1738167551",
            "is_creator": false
        },
        {
            "poster": "Sébastien Ouellet",
            "comment": "o Sci-fi or VR experiences (e.g., handling electrical equipment).",
            "timestamp": "1738167551",
            "is_creator": false
        },
        {
            "poster": "Sébastien Ouellet",
            "comment": "________________________________________",
            "timestamp": "1738167551",
            "is_creator": false
        },
        {
            "poster": "Sébastien Ouellet",
            "comment": "7. Hyper-Realistic Collisions",
            "timestamp": "1738167551",
            "is_creator": false
        },
        {
            "poster": "Sébastien Ouellet",
            "comment": "• Description: Simulate realistic physical impacts (e.g., touching a ball or bumping into a hard or soft surface).",
            "timestamp": "1738167551",
            "is_creator": false
        },
        {
            "poster": "Sébastien Ouellet",
            "comment": "• Feeling: A brief but powerful force with a quick rebound, giving the impression of a real collision.",
            "timestamp": "1738167551",
            "is_creator": false
        },
        {
            "poster": "Sébastien Ouellet",
            "comment": "• Use case:",
            "timestamp": "1738167551",
            "is_creator": false
        },
        {
            "poster": "Sébastien Ouellet",
            "comment": "o Sports games where the user hits a ball or interacts with physical objects.",
            "timestamp": "1738167551",
            "is_creator": false
        },
        {
            "poster": "Sébastien Ouellet",
            "comment": "o Industrial simulations to test impacts or collisions.",
            "timestamp": "1738167551",
            "is_creator": false
        },
        {
            "poster": "Sébastien Ouellet",
            "comment": "________________________________________",
            "timestamp": "1738167551",
            "is_creator": false
        },
        {
            "poster": "Sébastien Ouellet",
            "comment": "8. Dynamic Vortex or Suction",
            "timestamp": "1738167551",
            "is_creator": false
        },
        {
            "poster": "Sébastien Ouellet",
            "comment": "• Description: Simulate a force pulling the user toward a center, like a vortex, water whirlpool, or black hole.",
            "timestamp": "1738167551",
            "is_creator": false
        },
        {
            "poster": "Sébastien Ouellet",
            "comment": "• Feeling: A constant force that varies in intensity based on the user’s distance from the vortex center.",
            "timestamp": "1738167551",
            "is_creator": false
        },
        {
            "poster": "Sébastien Ouellet",
            "comment": "• Use case:",
            "timestamp": "1738167551",
            "is_creator": false
        },
        {
            "poster": "Sébastien Ouellet",
            "comment": "o VR simulations to explore natural phenomena (whirlpools, black holes).",
            "timestamp": "1738167551",
            "is_creator": false
        },
        {
            "poster": "Sébastien Ouellet",
            "comment": "o Immersive experiences where users struggle against a suction force.",
            "timestamp": "1738167551",
            "is_creator": false
        },
        {
            "poster": "Sébastien Ouellet",
            "comment": "________________________________________",
            "timestamp": "1738167551",
            "is_creator": false
        },
        {
            "poster": "Sébastien Ouellet",
            "comment": "9. Progressive Friction (Dynamic Braking or Resistance)",
            "timestamp": "1738167551",
            "is_creator": false
        },
        {
            "poster": "Sébastien Ouellet",
            "comment": "• Description: Simulate the sensation of braking or sliding on different surfaces (sand, ice, asphalt, etc.).",
            "timestamp": "1738167551",
            "is_creator": false
        },
        {
            "poster": "Sébastien Ouellet",
            "comment": "• Feeling: A force that dynamically changes based on speed or the simulated surface.",
            "timestamp": "1738167551",
            "is_creator": false
        },
        {
            "poster": "Sébastien Ouellet",
            "comment": "• Use case:",
            "timestamp": "1738167551",
            "is_creator": false
        },
        {
            "poster": "Sébastien Ouellet",
            "comment": "o Driving simulators where the user feels the braking effect.",
            "timestamp": "1738167551",
            "is_creator": false
        },
        {
            "poster": "Sébastien Ouellet",
            "comment": "o Interactive experiences where different terrains affect resistance.",
            "timestamp": "1738167551",
            "is_creator": false
        },
        {
            "poster": "Sébastien Ouellet",
            "comment": "________________________________________",
            "timestamp": "1738167551",
            "is_creator": false
        },
        {
            "poster": "Sébastien Ouellet",
            "comment": "10. Complex Pulses and Waves",
            "timestamp": "1738167551",
            "is_creator": false
        },
        {
            "poster": "Sébastien Ouellet",
            "comment": "• Description: Simulate complex vibratory patterns, such as waves or pulses at varying frequencies.",
            "timestamp": "1738167551",
            "is_creator": false
        },
        {
            "poster": "Sébastien Ouellet",
            "comment": "• Feeling: A series of undulating vibrations that give the impression of manipulating energetic phenomena (sound waves, currents).",
            "timestamp": "1738167551",
            "is_creator": false
        },
        {
            "poster": "Sébastien Ouellet",
            "comment": "• Use case:",
            "timestamp": "1738167551",
            "is_creator": false
        },
        {
            "poster": "Sébastien Ouellet",
            "comment": "o Acoustic or physical simulations.",
            "timestamp": "1738167551",
            "is_creator": false
        },
        {
            "poster": "Sébastien Ouellet",
            "comment": "o Immersive experiences where the user \"feels\" music or energetic waves.",
            "timestamp": "1738167551",
            "is_creator": false
        },
        {
            "poster": "Sébastien Ouellet",
            "comment": "________________________________________",
            "timestamp": "1738167551",
            "is_creator": false
        },
        {
            "poster": "Sébastien Ouellet",
            "comment": "Ultimate Sensation to Try: Combining Multiple Effects",
            "timestamp": "1738167551",
            "is_creator": false
        },
        {
            "poster": "Sébastien Ouellet",
            "comment": "Imagine an experience where:",
            "timestamp": "1738167551",
            "is_creator": false
        },
        {
            "poster": "Sébastien Ouellet",
            "comment": "• You plunge your hand into a living fluid (non-Newtonian with a biological feel).",
            "timestamp": "1738167551",
            "is_creator": false
        },
        {
            "poster": "Sébastien Ouellet",
            "comment": "• Feel rhythmic vibrations mimicking a beating heart underwater.",
            "timestamp": "1738167551",
            "is_creator": false
        },
        {
            "poster": "Sébastien Ouellet",
            "comment": "• Struggle against a suction force simulating a vortex.",
            "timestamp": "1738167551",
            "is_creator": false
        },
        {
            "poster": "Sébastien Ouellet",
            "comment": "• Once pulled out, a snapping elastic effect adds a dramatic final sensation.",
            "timestamp": "1738167551",
            "is_creator": false
        },
        {
            "poster": "Sébastien Ouellet",
            "comment": "________________________________________",
            "timestamp": "1738167551",
            "is_creator": false
        },
        {
            "poster": "Sébastien Ouellet",
            "comment": "Conclusion",
            "timestamp": "1738167551",
            "is_creator": false
        },
        {
            "poster": "Sébastien Ouellet",
            "comment": "The most \"special\" sensation depends on the goal: educational, immersive, artistic, or experimental. The Inverse3 excels in its ability to combine dynamic haptic forces to create ultra-realistic and unique experiences. If you'd like to explore any of these ideas in more detail (e.g., implementation), let me know, and I can assist further!",
            "timestamp": "1738167551",
            "is_creator": false
        },
        {
            "poster": "Colin Gallacher",
            "comment": "Interesting take, ChatGPT! Honestly, we're going to really be focusing on some of the UX interactions in a touchAPI because 3D UX is novel and when you throw forces and vibrations in the mix it becomes truely the wild west of user interaction. We're calling this the FUI. Force user interaction. The goal is to make the FUI for the user intuitive and to enhance, not invent, their workflow. More to come but we're into the authoring the API phase. After this we're taking some of the UX demos we put together for CES and are going to connect some of the authoring tools and FUIs that we designed into a plugin for blender. We'll start off with navigation and referencing and then move to direct object interaction. More to come!",
            "timestamp": "1738178937",
            "is_creator": false
        },
        {
            "poster": "Haply Robotics Inc.",
            "comment": "Thank you, Mark! We're so excited for you to experience the MinVerse and bring touch feedback into your 3D design workflow. 😊",
            "timestamp": "1738078095",
            "is_creator": true
        },
        {
            "poster": "Mark Frederiksen",
            "comment": "I’m looking forward to using the MinVerse to add touch feedback for 3D designs.",
            "timestamp": "1738072317",
            "is_creator": false
        },
        {
            "poster": "Haply Robotics Inc.",
            "comment": "Thank you, Mark! We're so excited for you to experience the MinVerse and bring touch feedback into your 3D design workflow. 😊",
            "timestamp": "1738078104",
            "is_creator": true
        }
    ]
}