{
    "url": "https://www.kickstarter.com/projects/82605225/vortix-titanium-turbo-fan-turn-on-the-turbulence/comments",
    "comments": [
        {
            "poster": "Lassejulius",
            "comment": "Sounds great :)",
            "timestamp": "1742282267",
            "is_creator": false
        },
        {
            "poster": "Sharon McArdle",
            "comment": "How can I get a reward",
            "timestamp": "1742057708",
            "is_creator": false
        },
        {
            "poster": "ScopePro",
            "comment": "You can still get the reward via late pledge.",
            "timestamp": "1742281873",
            "is_creator": true
        },
        {
            "poster": "P S Raju",
            "comment": "Hi team,",
            "timestamp": "1741790717",
            "is_creator": false
        },
        {
            "poster": "P S Raju",
            "comment": "What would be the estimated shipping to India and as in a backer comment it's mentioned import tariff or tax like customs clearance duty fee will be taken care of.",
            "timestamp": "1741790717",
            "is_creator": false
        },
        {
            "poster": "P S Raju",
            "comment": "Was it only for Europe or for rest of the world too.",
            "timestamp": "1741790717",
            "is_creator": false
        },
        {
            "poster": "P S Raju",
            "comment": "*if your delivery garuentee was not ensured I would have decided to opt out",
            "timestamp": "1741851515",
            "is_creator": false
        },
        {
            "poster": "Bonny Fernandes",
            "comment": "That's odd this is the first time I am hearing of packages being lost or undelivered in India. Hoping this isn't an issue this time",
            "timestamp": "1742037615",
            "is_creator": false
        },
        {
            "poster": "ScopePro",
            "comment": "Hi Robman,",
            "timestamp": "1741710648",
            "is_creator": true
        },
        {
            "poster": "ScopePro",
            "comment": "The ABS version is nearly as light as the Titanium version, both are around 200g. However, the Titanium version offers a more premium feel, enhanced durability, and a superior texture due to its high-quality material.",
            "timestamp": "1741710648",
            "is_creator": true
        },
        {
            "poster": "ScopePro",
            "comment": "Oh, sorry for the typo. 200g is the air thrust. The actual weight is 469g.",
            "timestamp": "1741740322",
            "is_creator": true
        },
        {
            "poster": "Oleksii Maksymov",
            "comment": "Will you share the CAD files of the nozzles, so I can 3d print custom one?",
            "timestamp": "1741352539",
            "is_creator": false
        },
        {
            "poster": "Oleksii Maksymov",
            "comment": "Will I be able to use this as mini vacum cleaner?",
            "timestamp": "1741352539",
            "is_creator": false
        },
        {
            "poster": "P S Raju",
            "comment": "I too would like to get the CAD files for custom 3D printing",
            "timestamp": "1741790481",
            "is_creator": false
        },
        {
            "poster": "Oleksii Maksymov",
            "comment": "sounds good! Thanks!",
            "timestamp": "1741792034",
            "is_creator": false
        },
        {
            "poster": "Darkcontrollers",
            "comment": "Where we can find the file ?",
            "timestamp": "1741860265",
            "is_creator": false
        },
        {
            "poster": "Peter",
            "comment": "How can you guarantee that this project will ship?",
            "timestamp": "1740525361",
            "is_creator": false
        },
        {
            "poster": "ScopePro",
            "comment": "Hi Peter,",
            "timestamp": "1740617189",
            "is_creator": true
        },
        {
            "poster": "ScopePro",
            "comment": "To address your concerns about the project's delivery, here are several key points that ensure we will ship successfully:",
            "timestamp": "1740617189",
            "is_creator": true
        },
        {
            "poster": "ScopePro",
            "comment": "Substantial Backer Support: We already have 600 backers, which is more than enough to move forward with mass production. This strong support demonstrates the demand and feasibility of our project.",
            "timestamp": "1740617189",
            "is_creator": true
        },
        {
            "poster": "ScopePro",
            "comment": "Proven Track Record: This is our second campaign on Kickstarter. Kickstarter only allows new projects from creators who have successfully delivered their first project. Since we’ve already fulfilled our first campaign, we’ve established credibility and trustworthiness.",
            "timestamp": "1740617189",
            "is_creator": true
        },
        {
            "poster": "ScopePro",
            "comment": "Regular Updates: After the campaign ends, we will provide consistent and transparent updates on production progress. This ensures backers are informed every step of the way, building confidence in our ability to deliver.",
            "timestamp": "1740617189",
            "is_creator": true
        },
        {
            "poster": "ScopePro",
            "comment": "Experience in Production: Having gone through the process before, we’ve refined our production and logistics strategies, minimizing risks and ensuring a smoother delivery timeline.",
            "timestamp": "1740617189",
            "is_creator": true
        },
        {
            "poster": "ScopePro",
            "comment": "In summary, our strong backer support, proven track record, commitment to transparency, and production experience all guarantee that this project will ship successfully. You can trust us to deliver as promised.",
            "timestamp": "1740617189",
            "is_creator": true
        },
        {
            "poster": "YB",
            "comment": "Where are you shipping from? Do we have to pay additional import taxes or VAT when receiving items to the EU?",
            "timestamp": "1740058899",
            "is_creator": false
        },
        {
            "poster": "ScopePro",
            "comment": "Hi YB,",
            "timestamp": "1740121232",
            "is_creator": true
        },
        {
            "poster": "ScopePro",
            "comment": "NO worry about these. You don't have to pay additional taxes or VAT, we will cover it all.",
            "timestamp": "1740121232",
            "is_creator": true
        },
        {
            "poster": "ScopePro",
            "comment": "Hi Tricade,",
            "timestamp": "1740121146",
            "is_creator": true
        },
        {
            "poster": "ScopePro",
            "comment": "Yes, our standard kit includes two additional replacement nozzles designed for cleaning electronics. One is a slim, narrow nozzle, perfect for reaching and cleaning tight crevices and small gaps. The other features bristles, making it ideal for tackling sticky dirt or grime. These nozzles provide versatility, ensuring you can clean your keyboard, PC, and other electronics with ease.",
            "timestamp": "1740121146",
            "is_creator": true
        },
        {
            "poster": "ScopePro",
            "comment": "Thank you for bringing this up. As a factory with decades of experience, we’ve built a strong and loyal customer base through direct relationships rather than heavy reliance on social media marketing. As a result, we’ve not always focused on maintaining our online presence as actively as some others.",
            "timestamp": "1739608179",
            "is_creator": true
        },
        {
            "poster": "ScopePro",
            "comment": "However, we truly appreciate your feedback, and we’re in the process of improving our social media presence to better engage with our customers. Regarding the website, we understand your concern, and we’re working to ensure it’s up and running smoothly.",
            "timestamp": "1739608179",
            "is_creator": true
        },
        {
            "poster": "ScopePro",
            "comment": "If you’re still concerned, we’d be happy to provide photos of our factory’s production lines and current stock, so you can see firsthand how we operate. We hope this gives you more confidence in our commitment to delivering on our promises.",
            "timestamp": "1739608179",
            "is_creator": true
        },
        {
            "poster": "ScopePro",
            "comment": "We truly appreciate your understanding and trust, and we’re here to answer any further questions you might have.",
            "timestamp": "1739608179",
            "is_creator": true
        },
        {
            "poster": "ScopePro",
            "comment": "Hi Alex,",
            "timestamp": "1739607793",
            "is_creator": true
        },
        {
            "poster": "ScopePro",
            "comment": "Thank you for your message and for bringing up your concerns. First, I want to reassure you that we have fulfilled the rewards for our previous project, and Kickstarter would not have allowed us to launch a second project if we had not met our previous commitments.",
            "timestamp": "1739607793",
            "is_creator": true
        },
        {
            "poster": "ScopePro",
            "comment": "However, there were a very small number of backers who experienced delivery issues. This was mainly due to situations where our shipping partners were unable to reach the recipient, causing the packages to be returned. We have already taken the necessary steps to resolve these issues and are working directly with those backers to ensure they receive their rewards.",
            "timestamp": "1739607793",
            "is_creator": true
        },
        {
            "poster": "ScopePro",
            "comment": "We take all feedback seriously and are committed to improving our communication and delivery processes. If you have any further questions or need additional clarification, please feel free to reach out.",
            "timestamp": "1739607793",
            "is_creator": true
        },
        {
            "poster": "ScopePro",
            "comment": "Thank you for the suggestion! We’ve actually considered this idea and are currently working on the design. However, we’re not sure if we’ll be able to include it in this project just yet. We’ll keep you updated!",
            "timestamp": "1739320533",
            "is_creator": true
        },
        {
            "poster": "ScopePro",
            "comment": "Hi Chris,",
            "timestamp": "1739279480",
            "is_creator": true
        },
        {
            "poster": "ScopePro",
            "comment": "Please note that this does not include free shipping. The estimated shipping cost is around $10, but the exact fee will be calculated based on the situation in May, with a potential fluctuation of 1 to 2 dollars.",
            "timestamp": "1739279480",
            "is_creator": true
        }
    ]
}