{
    "url": "https://www.kickstarter.com/projects/1062523922/chargeultra-gen-2-360-rotating-3-in-1-wireless-charger/comments",
    "comments": [
        {
            "poster": "ChargeUltra",
            "comment": "Thank you for your feedback, we will consider this in the next generation of products! If you don't need to charge your phone, you can unplug the charging cable connected to ChargeUltra so that ChargeUltra can function as a magnetic stand!",
            "timestamp": "1741656075",
            "is_creator": true
        },
        {
            "poster": "ChargeUltra",
            "comment": "Hi Erik，",
            "timestamp": "1740968472",
            "is_creator": true
        },
        {
            "poster": "ChargeUltra",
            "comment": "Thank you for your interest in our ChargeUltra 2 charger. We're glad you inquired about its compatibility with your devices.",
            "timestamp": "1740968472",
            "is_creator": true
        },
        {
            "poster": "ChargeUltra",
            "comment": "The ChargeUltra 2 is compatible with your Galaxy Fold 5 when used with a MagSafe case. The MagSafe technology in your case enables seamless wireless charging with our charger, ensuring a hassle - free and efficient charging process.",
            "timestamp": "1740968472",
            "is_creator": true
        },
        {
            "poster": "ChargeUltra",
            "comment": "However, regarding your Galaxy Watch 6, our ChargeUltra 2 has a dedicated watch - charging area that is specifically designed to work with Apple Watches. It is not directly compatible with the Galaxy Watch 6. If you also own an Apple Watch, you can use that charging area for it. But for the Galaxy Watch 6, you'll need to use the charging device provided by Samsung for optimal charging performance.",
            "timestamp": "1740968472",
            "is_creator": true
        },
        {
            "poster": "ChargeUltra",
            "comment": "We hope this information clarifies the compatibility details for you.",
            "timestamp": "1740968472",
            "is_creator": true
        },
        {
            "poster": "ChargeUltra",
            "comment": "Best",
            "timestamp": "1740968472",
            "is_creator": true
        },
        {
            "poster": "Anthony",
            "comment": "Will this have any heat dissipation for the Q charging phone?",
            "timestamp": "1740773581",
            "is_creator": false
        },
        {
            "poster": "ChargeUltra",
            "comment": "Hi there! Thank you for your question. Our ChargeUltra 2 is designed with user convenience and device safety in mind. The magnetic side of the charger is equipped with a high - quality heat - dissipating silicone pad. This pad plays a crucial role in efficiently dissipating heat generated during the Qi - charging process.",
            "timestamp": "1740796841",
            "is_creator": true
        },
        {
            "poster": "ChargeUltra",
            "comment": "When your phone is charging wirelessly, heat is an inevitable by - product. Our heat - dissipating silicone pad helps to draw the heat away from the charging area of your phone, ensuring that your device remains at a safe operating temperature. This not only helps to protect your phone's battery and internal components from potential heat damage but also contributes to a more stable and efficient charging experience. So, you can rest assured that your Qi - charging phone will be well - taken care of when using our ChargeUltra 2. If you have any other questions, feel free to reach out.",
            "timestamp": "1740796841",
            "is_creator": true
        },
        {
            "poster": "Victor",
            "comment": "Hi!!",
            "timestamp": "1740396965",
            "is_creator": false
        },
        {
            "poster": "Victor",
            "comment": "I would like to know if the base to charge the AirPods have the space to charge also the SONY WF-1000XM5, those headphones instead of charging from the back, charge from the base, they need to be stand up so the dimensions are:",
            "timestamp": "1740396965",
            "is_creator": false
        },
        {
            "poster": "Victor",
            "comment": "Height 4cm",
            "timestamp": "1740396965",
            "is_creator": false
        },
        {
            "poster": "Victor",
            "comment": "Length 6,4cm",
            "timestamp": "1740396965",
            "is_creator": false
        },
        {
            "poster": "Victor",
            "comment": "Width 2,6 cm",
            "timestamp": "1740396965",
            "is_creator": false
        },
        {
            "poster": "ChargeUltra",
            "comment": "Hi Victor,",
            "timestamp": "1740450364",
            "is_creator": true
        },
        {
            "poster": "ChargeUltra",
            "comment": "The suitable range for ChargeUltra 2 to accommodate headphones is:",
            "timestamp": "1740450364",
            "is_creator": true
        },
        {
            "poster": "ChargeUltra",
            "comment": "Height 5cm",
            "timestamp": "1740450364",
            "is_creator": true
        },
        {
            "poster": "ChargeUltra",
            "comment": "Length 7cm",
            "timestamp": "1740450364",
            "is_creator": true
        },
        {
            "poster": "ChargeUltra",
            "comment": "Width 7cm",
            "timestamp": "1740450364",
            "is_creator": true
        },
        {
            "poster": "ChargeUltra",
            "comment": "I think it can accommodate SONY WF-1000XM5, hope this helps.",
            "timestamp": "1740450364",
            "is_creator": true
        },
        {
            "poster": "ChargeUltra",
            "comment": "Best",
            "timestamp": "1740450364",
            "is_creator": true
        },
        {
            "poster": "Murat Ozdemir",
            "comment": "Hey ChargeUltra, I am a returning backer, I use your previous product daily, this wireless charger looks great too, I am hoping this will give me the same joy and satisfaction while using it 🤩",
            "timestamp": "1740174938",
            "is_creator": false
        },
        {
            "poster": "Murat Ozdemir",
            "comment": "Oh, it's for the iPhone only. I have to cancel I guess, I will wait for your next project then as I own a Sony Xperia 1 VI. Good luck with your campaign.",
            "timestamp": "1740257141",
            "is_creator": false
        },
        {
            "poster": "ChargeUltra",
            "comment": "Hi Murat",
            "timestamp": "1740361207",
            "is_creator": true
        },
        {
            "poster": "ChargeUltra",
            "comment": "Thank you for your love of our products and continued support, we appreciate it!",
            "timestamp": "1740361207",
            "is_creator": true
        },
        {
            "poster": "ChargeUltra",
            "comment": "We need to clarify that the Sony Xperia 1 VI supports Qi wireless charging, so it is compatible with ChargeUltra Gen 2! Thank you for your reminder, we will fix the compatibility list we provide.",
            "timestamp": "1740361207",
            "is_creator": true
        },
        {
            "poster": "ChargeUltra",
            "comment": "Best",
            "timestamp": "1740361207",
            "is_creator": true
        },
        {
            "poster": "Murat Ozdemir",
            "comment": "Thank you ChargeUltra for your answer and help, now I know I won't have to cancel 👍❤️",
            "timestamp": "1740434296",
            "is_creator": false
        }
    ]
}