{
    "url": "https://www.kickstarter.com/projects/1006830823/oukitel-wp100-titan-33000mah-rugged-phone-with-projector/comments",
    "comments": [
        {
            "poster": "Oukitel Titan",
            "comment": "Yes! The Titan supports multiple global network bands, including those used in India. It should work with major Indian carriers.",
            "timestamp": "1741929514",
            "is_creator": true
        },
        {
            "poster": "Jack Tan",
            "comment": "did the phone cam use (one sim card or two sim card)/(one sim card and one memory slot)",
            "timestamp": "1741842935",
            "is_creator": false
        },
        {
            "poster": "Jack Tan",
            "comment": "did it can wireless charging ?",
            "timestamp": "1741842935",
            "is_creator": false
        },
        {
            "poster": "Oukitel Titan",
            "comment": "The Titan supports dual SIM, meaning you can use two SIM cards at the same time. However, it does not have a microSD card slot for expandable storage.",
            "timestamp": "1741843225",
            "is_creator": true
        },
        {
            "poster": "Oukitel Titan",
            "comment": "As for wireless charging, this model does not support it, but we are considering adding it to future versions based on user feedback!",
            "timestamp": "1741843225",
            "is_creator": true
        },
        {
            "poster": "Cody",
            "comment": "Will the phone have an SD card slot and if so what size? Also will I be able to use Google Fi as a carrier on this phone? And one last thing, since I'm in the US will I get the standard charging cable for outlets here in the US? I've seen reviews where they seem to be different. Thanks",
            "timestamp": "1741828242",
            "is_creator": false
        },
        {
            "poster": "Oukitel Titan",
            "comment": "Thank you for your questions! Here are the details:",
            "timestamp": "1741830961",
            "is_creator": true
        },
        {
            "poster": "Oukitel Titan",
            "comment": "SD Card Slot: The Titan lacks a microSD card slot but includes 512GB of built-in storage.",
            "timestamp": "1741830961",
            "is_creator": true
        },
        {
            "poster": "Oukitel Titan",
            "comment": "Google Fi Compatibility: Titan supports a variety of bands, including T-Mobile. Therefore, it may work with Google Fi, which relies on T-Mobile’s network. We recommend confirming full compatibility with Google Fi support.",
            "timestamp": "1741830961",
            "is_creator": true
        },
        {
            "poster": "Oukitel Titan",
            "comment": "US Charging Cable: Yes! If you're in the US, your package will include a standard US-compatible charger and cable. If you ever need a replacement, a standard USB-C charger will also work.",
            "timestamp": "1741830961",
            "is_creator": true
        },
        {
            "poster": "Oukitel Titan",
            "comment": "Let us know if you have any other questions!",
            "timestamp": "1741830961",
            "is_creator": true
        },
        {
            "poster": "Cody",
            "comment": "Awesome. Thanks",
            "timestamp": "1741831310",
            "is_creator": false
        },
        {
            "poster": "Szymon",
            "comment": "Hi i have one question, will it work in Poland?",
            "timestamp": "1741818092",
            "is_creator": false
        },
        {
            "poster": "Oukitel Titan",
            "comment": "Yes! The Titan supports a wide range of global network bands, including those used in Poland. It should work with major Polish carriers.",
            "timestamp": "1741825640",
            "is_creator": true
        },
        {
            "poster": "Tankaton",
            "comment": "What carriers will this be available for",
            "timestamp": "1741804072",
            "is_creator": false
        },
        {
            "poster": "Oukitel Titan",
            "comment": "The Titan supports a wide range of global network bands, making it compatible with many carriers. To provide accurate information, could you let us know which country or carrier you’re asking about? We’ll be happy to check for you!",
            "timestamp": "1741825938",
            "is_creator": true
        },
        {
            "poster": "Tankaton",
            "comment": "USA Verizon etc",
            "timestamp": "1741900253",
            "is_creator": false
        },
        {
            "poster": "Oukitel Titan",
            "comment": "Our Titan is FCC-compliant and supports the key Verizon network bands. To ensure full compatibility with Verizon’s latest network updates, please verify directly with Verizon. Thank you!",
            "timestamp": "1741924599",
            "is_creator": true
        },
        {
            "poster": "Jacob Averi",
            "comment": "Will this work with xfinity mobile? Or can I know the IMEI to check? Obviously I don't want to spend $650 for a very fancy paperweight.",
            "timestamp": "1741732701",
            "is_creator": false
        },
        {
            "poster": "Oukitel Titan",
            "comment": "Hi Jacob. Sorry, our phones are not compatible with Xfinity Mobile. We apologize for the inconvenience.",
            "timestamp": "1741743481",
            "is_creator": true
        },
        {
            "poster": "Myk Lm",
            "comment": "1- in vids of the phone being used as a hammer, can both sides be used? or only the screen side?",
            "timestamp": "1741575446",
            "is_creator": false
        },
        {
            "poster": "Myk Lm",
            "comment": "2-i know the chip used is very mid-ranged... (I haven't had an android since 2020) my question is, will the phone eventually suffer slowdowns like the androids of the old days?",
            "timestamp": "1741575446",
            "is_creator": false
        },
        {
            "poster": "Myk Lm",
            "comment": "3-what is the lag of the projector? if used for gaming?",
            "timestamp": "1741575446",
            "is_creator": false
        },
        {
            "poster": "Myk Lm",
            "comment": "4-re:the size of the battery...have you tried bringing the phone to planes? none of them have confiscated the phone yet??",
            "timestamp": "1741575446",
            "is_creator": false
        },
        {
            "poster": "Oukitel Titan",
            "comment": "Great questions! Here’s what we can share:",
            "timestamp": "1741578235",
            "is_creator": true
        },
        {
            "poster": "Oukitel Titan",
            "comment": "Hammer test: While the WP100 Titan is exceptionally durable, the screen side is the most commonly tested for impacts. The back is also resilient during hammer tests.",
            "timestamp": "1741578235",
            "is_creator": true
        },
        {
            "poster": "Oukitel Titan",
            "comment": "Performance over time: The Dimensity 7300 is a solid processor with efficient performance and software optimizations to keep it running smoothly. Unlike older Androids, the Titan handles long-term performance better, so slowdowns should be minimal with regular updates.",
            "timestamp": "1741578235",
            "is_creator": true
        },
        {
            "poster": "Oukitel Titan",
            "comment": "Projector lag: The latency is minimal, and it has been tested for gaming, including fast-paced content. It performs well for everyday gaming without noticeable delay.",
            "timestamp": "1741578235",
            "is_creator": true
        },
        {
            "poster": "Oukitel Titan",
            "comment": "Airplane Travel: Yes, we have successfully brought the Titan to exhibitions such as CES without any issues. We also have a policy in place to ensure a smooth flight experience. If your Titan is seized at the airport or customs within six months of purchase, you can rest assured—Oukitel has you covered! Simply provide proof, such as a 'Property Irregularity Report (PIR)' or an 'Unclaimed/Seized Item Report,' and we will send you a brand-new Titan.",
            "timestamp": "1741578235",
            "is_creator": true
        },
        {
            "poster": "Myk Lm",
            "comment": "Ok. I’m sold. I had my doubts (esp the batt size and the chip) but your confidence inspires. So., I’m not canceling anymore!!",
            "timestamp": "1741597878",
            "is_creator": false
        },
        {
            "poster": "Oukitel Titan",
            "comment": "We truly appreciate the faith you've placed in us! Thank you for being a valued part of our journey.",
            "timestamp": "1741598260",
            "is_creator": true
        },
        {
            "poster": "Sergio",
            "comment": "Hello,what's the max resolution perceived of the proyector?is only 480p ?because if it comes with dlp DMD can do more resolution?like the 1080p projectors dlp that do almost real 4k?also,In a video I see that the phone can recharge with solar energy,that's true?",
            "timestamp": "1741509133",
            "is_creator": false
        },
        {
            "poster": "Oukitel Titan",
            "comment": "Great questions! The WP100 Titan projector has a native resolution of 854×480 but provides clear and sharp visuals for its size. While DLP technology is capable of higher resolutions, this model is optimized for portability and efficiency.",
            "timestamp": "1741509498",
            "is_creator": true
        },
        {
            "poster": "Oukitel Titan",
            "comment": "As for solar charging, the phone is compatible with solar charging accessories, but it does not have built-in solar panels. You can use a solar power bank to recharge it on the go!",
            "timestamp": "1741509498",
            "is_creator": true
        },
        {
            "poster": "john vallejo",
            "comment": "I know this has been talked about, but not in a way that I understand. I'm in USA. I only know locked phones and unlocked phones. so does this phone take all US carriers or only one or two of them ?",
            "timestamp": "1741464921",
            "is_creator": false
        },
        {
            "poster": "Oukitel Titan",
            "comment": "Great question! The WP100 Titan can work with different carriers. However, it supports specific network bands, so while it works with T-Mobile, it may not be fully compatible with Verizon or others that require special certification.",
            "timestamp": "1741485289",
            "is_creator": true
        },
        {
            "poster": "Oukitel Titan",
            "comment": "We recommend checking with your carrier to confirm compatibility with the phone’s supported bands!",
            "timestamp": "1741485289",
            "is_creator": true
        },
        {
            "poster": "john vallejo",
            "comment": "can you take underwater pics with this phone? how deep can this phone go and still be waterproof? is there any extra lens we can get from you, for super zoom pics? can you download phone memory to external hard drive?",
            "timestamp": "1741207109",
            "is_creator": false
        },
        {
            "poster": "Oukitel Titan",
            "comment": "Absolutely! Our Titan camera is perfect for capturing underwater moments—it's waterproof up to 1.5 meters and can handle being submerged for 30 minutes. While we don’t have any extra lenses available right now, you can easily transfer your phone’s memories to an external hard drive. Happy capturing!",
            "timestamp": "1741229621",
            "is_creator": true
        },
        {
            "poster": "john vallejo",
            "comment": "thanks for info",
            "timestamp": "1741231710",
            "is_creator": false
        },
        {
            "poster": "Oukitel Titan",
            "comment": "You can check with them those global bands the Titan supports: GSM （2/3/5/8）",
            "timestamp": "1741191518",
            "is_creator": true
        },
        {
            "poster": "Oukitel Titan",
            "comment": "CDMA （BC0/BC1/BC10 ）",
            "timestamp": "1741191518",
            "is_creator": true
        },
        {
            "poster": "Oukitel Titan",
            "comment": "WCDMA（1/2/4/5/6/8/19）",
            "timestamp": "1741191518",
            "is_creator": true
        },
        {
            "poster": "Oukitel Titan",
            "comment": "TDD （34/38/39/40/41）",
            "timestamp": "1741191518",
            "is_creator": true
        },
        {
            "poster": "Oukitel Titan",
            "comment": "FDD. （1/2/3/4/5/7/8/12/13/17/18/19/20/25/26/28/66/71）",
            "timestamp": "1741191518",
            "is_creator": true
        },
        {
            "poster": "Oukitel Titan",
            "comment": "5G. （N1/2/3/5/7/8/12/20/25/28/66/71/38/40/41/77/78/79）",
            "timestamp": "1741191518",
            "is_creator": true
        },
        {
            "poster": "Bradley Kelly",
            "comment": "Am I able to change the delivery address?",
            "timestamp": "1741108111",
            "is_creator": false
        },
        {
            "poster": "Oukitel Titan",
            "comment": "Yes! You will be able to update your delivery address when we send out the Backer Survey after the campaign ends. If your address changes later, you can also contact us directly to update it before shipping begins.",
            "timestamp": "1741133630",
            "is_creator": true
        },
        {
            "poster": "Thomas Argante",
            "comment": "Hi, I read online some concerns regarding the Google Play Store. Is the Google Play Store available on this phone?",
            "timestamp": "1741030650",
            "is_creator": false
        },
        {
            "poster": "Oukitel Titan",
            "comment": "Hi Thomas, yes. Google Play Store will be pre-installed in WP100 Titan.",
            "timestamp": "1741051686",
            "is_creator": true
        },
        {
            "poster": "Oukitel Titan",
            "comment": "Yes! The Titan supports USB-C video output. If you connect it to a compatible monitor or display using a USB-C cable, the phone's screen will be mirrored to the monitor.",
            "timestamp": "1740965383",
            "is_creator": true
        },
        {
            "poster": "Oukitel Titan",
            "comment": "Thank you for your question! The Titan is equipped with an upgraded antenna design compared to the G1, ensuring better signal reception and connectivity stability, especially in remote or challenging environments.",
            "timestamp": "1740920659",
            "is_creator": true
        },
        {
            "poster": "Raymond Young",
            "comment": "No opportunity to order two of $650?",
            "timestamp": "1740863044",
            "is_creator": false
        },
        {
            "poster": "Oukitel Titan",
            "comment": "Thank you for your interest! Currently, Kickstarter limits each backer to one reward tier per pledge. If you’d like to order two units, the easiest way would be to place a second pledge using a different Kickstarter account. We really appreciate your support! At the same time, please send an email to wp100titan@oukitel.com for more instructions.",
            "timestamp": "1740886114",
            "is_creator": true
        },
        {
            "poster": "Johnny gajewsky",
            "comment": "I just use Kickstarter. I'm not sure if I purchased it or not but didn't give me a delivery address",
            "timestamp": "1740853649",
            "is_creator": false
        },
        {
            "poster": "Oukitel Titan",
            "comment": "Thanks for your support! No worries — after the Kickstarter campaign ends, we’ll send out a Backer Survey to collect your delivery address and any other necessary details. If you see your pledge confirmed in your Kickstarter account, you’re all set for now!",
            "timestamp": "1740854308",
            "is_creator": true
        },
        {
            "poster": "Silvio Biber",
            "comment": "Bin mega gespannt habe schon das WP33 pro und bin glücklich, es kann nur besser werden",
            "timestamp": "1740814602",
            "is_creator": false
        },
        {
            "poster": "Oukitel Titan",
            "comment": "Vielen Dank für dein Feedback! Es freut uns sehr, dass du mit dem WP33 Pro zufrieden bist. Wir sind sicher, dass der WP100 Titan dich mit seiner riesigen Batterie und vielen weiteren Funktionen noch mehr beeindrucken wird. Wir sind gespannt, wie dir der Titan gefallen wird!",
            "timestamp": "1740818748",
            "is_creator": true
        },
        {
            "poster": "Jack Tan",
            "comment": "did it type c or hdmi for use with the projector or miracast only?",
            "timestamp": "1740738205",
            "is_creator": false
        },
        {
            "poster": "Oukitel Titan",
            "comment": "Hey Jack! Could you clarify your question a bit? Are you interested in learning how to connect the projector to other devices? Let’s make sure we get it all sorted!",
            "timestamp": "1740738597",
            "is_creator": true
        },
        {
            "poster": "Jack Tan",
            "comment": "yeap!conect the projector to other devicer ..",
            "timestamp": "1740748379",
            "is_creator": false
        },
        {
            "poster": "Oukitel Titan",
            "comment": "The Titan projector is built-in and mainly designed to project content directly from the phone itself. However, it also supports wireless screen mirroring, so you can mirror content from other devices (like laptops or tablets) if they support wireless display casting (Miracast, for example).",
            "timestamp": "1740750880",
            "is_creator": true
        },
        {
            "poster": "Oukitel Titan",
            "comment": "For wired connection (like connecting a PS station or other HDMI devices), you would need to use a USB-C to HDMI adapter that supports Display Input, but please note that this is not the projector's primary function — it's optimized to work with the phone itself.",
            "timestamp": "1740750880",
            "is_creator": true
        },
        {
            "poster": "Oukitel Titan",
            "comment": "If you need this type of feature, we recommend testing with a compatible adapter after you receive the device. Let us know if you need further assistance!",
            "timestamp": "1740750880",
            "is_creator": true
        },
        {
            "poster": "Jack Tan",
            "comment": "did it come with the type c earphone ?",
            "timestamp": "1740737687",
            "is_creator": false
        },
        {
            "poster": "Oukitel Titan",
            "comment": "Hi Jack, thank you for your question! The Titan is compatible with Type-C earbuds; however, the earbuds are not included in the Titan Solo package. If you'd like the earbuds, you may need to choose the Bundle instead.",
            "timestamp": "1740738247",
            "is_creator": true
        },
        {
            "poster": "Jack Tan",
            "comment": "but i dont see any bundle is inclu the type c earphone?",
            "timestamp": "1740748638",
            "is_creator": false
        },
        {
            "poster": "Oukitel Titan",
            "comment": "The Hearwatch in the Bundle is a Bluetooth earbud which can tranform into a smartwatch.",
            "timestamp": "1740750705",
            "is_creator": true
        },
        {
            "poster": "Oukitel Titan",
            "comment": "Thank you for your honest feedback! We understand your concerns and really appreciate your input. The Titan stands out with its massive battery, exceptional durability, versatility, and portability. We recommend waiting for feedback from other users once they start using the device, as real-world experience is the best way to gauge the phone’s performance.",
            "timestamp": "1740672250",
            "is_creator": true
        },
        {
            "poster": "Oukitel Titan",
            "comment": "We’re confident that it will impress you once you get your hands on it. Thanks again for your valuable thoughts!",
            "timestamp": "1740672250",
            "is_creator": true
        },
        {
            "poster": "ARTHEME BOYARSKI",
            "comment": "Hi. When will you start the delivery? How long will it take to come to France? Am I sure to be delivered? What are my warranty if the good is lost during the shipping? I already had this kind of problems with shipping from Asia.",
            "timestamp": "1740487990",
            "is_creator": false
        },
        {
            "poster": "Oukitel Titan",
            "comment": "Thank you for your questions! We plan to start deliveries in early April. The shipping to France usually takes 1 week to 2 weeks.",
            "timestamp": "1740488249",
            "is_creator": true
        },
        {
            "poster": "Oukitel Titan",
            "comment": "We ensure that all shipments are tracked and insured to minimize any issues, and we’ll support you through the process if anything goes wrong.",
            "timestamp": "1740488249",
            "is_creator": true
        },
        {
            "poster": "Oukitel Titan",
            "comment": "We understand your concerns, and we are committed to making the shipping process as smooth as possible. Thank you for trusting us!",
            "timestamp": "1740488249",
            "is_creator": true
        },
        {
            "poster": "ARTHEME BOYARSKI",
            "comment": "Thank you for your reply",
            "timestamp": "1740492121",
            "is_creator": false
        },
        {
            "poster": "Matteo Egidio",
            "comment": "i have a question to the creator, the survey to keep from me the details of shipping address will be sent to me by e-mail or what else?",
            "timestamp": "1740442574",
            "is_creator": false
        },
        {
            "poster": "Oukitel Titan",
            "comment": "Thank you for your question! The survey to collect your shipping address will be sent to you via email after the campaign ends. Please keep an eye on your inbox, and make sure to check your spam/junk folder just in case. If you have any further questions, feel free to reach out!",
            "timestamp": "1740445078",
            "is_creator": true
        },
        {
            "poster": "Oukitel Titan",
            "comment": "Thank you so much for your positive feedback and confidence in Oukitel! We're thrilled to hear that you're happy with your G1 and that you're looking forward to our Titan. Your trust in us means a lot, and we’ll work hard to ensure the Titan meets your expectations. We appreciate your support and can't wait to deliver an amazing product. All the best, and we hope the Titan lives up to your high hopes!",
            "timestamp": "1740444707",
            "is_creator": true
        }
    ]
}