{
    "url": "https://www.kickstarter.com/projects/619020748/sam-and-johnny-hb17-sleepbuds-so-light-you-wont-feel-them/comments",
    "comments": [
        {
            "poster": "Jason Chen",
            "comment": "So, I don't know what it means for this project but the recent copyright infringement action doesn't mean everything is good. I've backed other projects where the creator successfully was reinstated only to be taken down later again with legal action. One project, Sumjet, was taken down in 2023 after the project concluded and there's been no updates since then.",
            "timestamp": "1741898527",
            "is_creator": false
        },
        {
            "poster": "Jason Chen",
            "comment": "For the sake of the project, can the creator explain what the previous action was about? Thanks.",
            "timestamp": "1741898527",
            "is_creator": false
        },
        {
            "poster": "Sam&Johnny",
            "comment": "Hi Jason,",
            "timestamp": "1741918382",
            "is_creator": true
        },
        {
            "poster": "Sam&Johnny",
            "comment": "Thank you for your concern! The issue was related to our project title using a term that overlapped with another brand’s trademark. We’ve since revised the title and all project materials to ensure compliance.",
            "timestamp": "1741918382",
            "is_creator": true
        },
        {
            "poster": "Sam&Johnny",
            "comment": "The product itself is 100% original, designed and developed by our team. We take IP seriously and will be extra cautious with terminology moving forward.",
            "timestamp": "1741918382",
            "is_creator": true
        },
        {
            "poster": "Hans Bennink",
            "comment": "What is the name off the app and is it already in the playstore?",
            "timestamp": "1741422254",
            "is_creator": false
        },
        {
            "poster": "Sam&Johnny",
            "comment": "Hi,",
            "timestamp": "1741575048",
            "is_creator": true
        },
        {
            "poster": "Sam&Johnny",
            "comment": "Yes we have app now. We will send a code to all backers to scan.",
            "timestamp": "1741575048",
            "is_creator": true
        },
        {
            "poster": "Ricky Wright",
            "comment": "Sorry if I missed this but in order for the translation, I have to use my cell phone correct and it’s AI so do I have to have a AI subscription or contract?",
            "timestamp": "1741361286",
            "is_creator": false
        },
        {
            "poster": "Sam&Johnny",
            "comment": "No need, we have already paid for the artificial intelligence fee for you, which is long-term. You can use the artificial intelligence and translation functions for free.",
            "timestamp": "1741575139",
            "is_creator": true
        },
        {
            "poster": "Sam&Johnny",
            "comment": "If you like this product, please share it to your friends or family.",
            "timestamp": "1741575139",
            "is_creator": true
        },
        {
            "poster": "Sam&Johnny",
            "comment": "Hi，",
            "timestamp": "1741240366",
            "is_creator": true
        },
        {
            "poster": "Sam&Johnny",
            "comment": "Our earphones are designed to be compact and have maximized battery life due to size limitations, with a maximum battery life of 5-6 hours. There will be new technologies that can be further optimized in the future.",
            "timestamp": "1741240366",
            "is_creator": true
        },
        {
            "poster": "Sam&Johnny",
            "comment": "Snoring is indeed a troublesome thing. Our sleep headphones have noise reduction function, which can largely resist external sounds, but we cannot guarantee 100% resistance to snoring sound, as the degree and volume of snoring vary from person to person.",
            "timestamp": "1740797560",
            "is_creator": true
        },
        {
            "poster": "Sam&Johnny",
            "comment": "Thank you for your support and understanding.",
            "timestamp": "1740797560",
            "is_creator": true
        },
        {
            "poster": "Fadi",
            "comment": "Hi , I just backed the double discount reward but I want to know if the app work with Android device? I use the honor v3 and couldn't see the app compatible with iOS or android so want to confirm if there is android version of the app. Thanks and good luck with your campaign.",
            "timestamp": "1740754681",
            "is_creator": false
        },
        {
            "poster": "Sam&Johnny",
            "comment": "Hi Fadi,",
            "timestamp": "1740971199",
            "is_creator": true
        },
        {
            "poster": "Sam&Johnny",
            "comment": "Sorry for the long reply. We will check it and give you reply.",
            "timestamp": "1740971199",
            "is_creator": true
        },
        {
            "poster": "Sam&Johnny",
            "comment": "Thank you for your support and patience.",
            "timestamp": "1740971199",
            "is_creator": true
        },
        {
            "poster": "Sam&Johnny",
            "comment": "Hi Fadi,",
            "timestamp": "1740984557",
            "is_creator": true
        },
        {
            "poster": "Sam&Johnny",
            "comment": "Our headphones are compatible with iOS and Android systems, and we have an app for everyone to download. Please don't worry.",
            "timestamp": "1740984557",
            "is_creator": true
        },
        {
            "poster": "Fadi",
            "comment": "Thank you for the update, best regards",
            "timestamp": "1741020584",
            "is_creator": false
        },
        {
            "poster": "Tony Collins",
            "comment": "Hi, I've just backed you. These look great",
            "timestamp": "1740666810",
            "is_creator": false
        },
        {
            "poster": "Tony Collins",
            "comment": "I've got one question: what sort of indication do the earbuds give when the battery is running out?",
            "timestamp": "1740666810",
            "is_creator": false
        },
        {
            "poster": "Tony Collins",
            "comment": "I ask because every set of wireless earbuds I've used makes a beep-type sound which, even if it's quiet, can wake people up. When you're asleep, a small sound can disturb you.",
            "timestamp": "1740666810",
            "is_creator": false
        },
        {
            "poster": "Tony Collins",
            "comment": "What will these earbuds do? Will there be any way to completely silence a low battery warning? If you've not planned it so far, please consider it. The battery capacity is 5-6 hours which means that for most people, the batteries will run out during the night - so there's no real point in having an audible alert to say the battery is running out.",
            "timestamp": "1740666810",
            "is_creator": false
        },
        {
            "poster": "Tony Collins",
            "comment": "This might seem like a small issue, but please believe me: I still use wired earbuds at night because every single set of wireless ones has woken me up when the batteries run out",
            "timestamp": "1740666810",
            "is_creator": false
        },
        {
            "poster": "Tony Collins",
            "comment": "Thanks for listening 🙂",
            "timestamp": "1740666810",
            "is_creator": false
        },
        {
            "poster": "Sam&Johnny",
            "comment": "Hi Tony,",
            "timestamp": "1740721958",
            "is_creator": true
        },
        {
            "poster": "Sam&Johnny",
            "comment": "Thank you for your suggestion.",
            "timestamp": "1740721958",
            "is_creator": true
        },
        {
            "poster": "Sam&Johnny",
            "comment": "We need to confirm with the engineer. Perhaps there could be a mute setting.",
            "timestamp": "1740721958",
            "is_creator": true
        },
        {
            "poster": "Sam&Johnny",
            "comment": "We will let you know later if it is possible. Thank you for your support and patience.",
            "timestamp": "1740721958",
            "is_creator": true
        }
    ]
}