{
  "url": "https://www.kickstarter.com/projects/stationpc/pocketcloud/posts",
  "campaign_details": {
    "funding_period_text": "Funding period\nMar 31 2025 - May 15 2025 (45 days)",
    "funding_start_date": "2025-03-31T00:00:00.000000Z",
    "funding_end_date": "2025-05-15T20:12:06.835655Z",
    "funding_duration_days": 45,
    "pledged_amount": "S$ 235,676",
    "funding_goal": "S$ 5,128",
    "backers_count": "541",
    "days_left": 34,
    "project_launch_text": "Project launches MARCH 31, 2025"
  },
  "updates": {
    "count": 1,
    "content": [
      {
        "update_number": "UPDATE #1",
        "title": "[Over 1800% Funded!] What's Next & Amazing Giveaways Winners Announced!",
        "creator": "Firefly team\nApril 2, 2025",
        "date": "April 2, 2025",
        "content": "Dear Backers,\nWe are beyond excited to share that our PocketCloud project has reached an astonishing 1800% funding! This incredible achievement is all thanks to your amazing support and enthusiasm. We couldn’t have done it without you!\nEarn 10% Cashback as a Kickbooster Affiliate!\nWant to help us spread the word about PocketCloud and earn some extra cash? Join our Kickbooster Referral Program and get 10% cashback on every successful referral. It’s a win-win!\nHow to Join:\nSign Up for the Kickbooster Referral Program.\nShare your unique referral link with friends, family, and anyone who might be interested.\nEarn 10% cashback for every successful referral.\nGiveaway Winners Announced\nAs promised, we’ve picked the lucky winners who subscribed to our newsletter and backed PocketCloud. These winners will receive fantastic giveaways, including Free PocketClouds, 2TB SSDs, and 256GB SD cards. Check out the list of winners below.\n*Remember, all giveaways are exclusively for backers and will be shipped with their pledges. If your Kickstarter email is different from the one you used to subscribe to our newsletter, please message us with the email you used for verification.\nNot on the list? Don’t be Down, You Still Have a Chance!\nLeave a comment on our project to show your support, and then click here to fill out a quick form. We will pick one lucky winner to get a FREE PocketCloud after the campaign ends!\nThank you once again for your incredible support. We can’t wait to get PocketCloud into your hands!\nStay tuned for more updates!",
        "url": "https://www.kickstarter.com/projects/stationpc/pocketcloud/posts/4351031",
        "likes_count": 4,
        "comments_count": 15,
        "comments": [
          {
            "text": "",
            "commenter": "Firefly team",
            "timestamp": "April 3, 2025 4:51 PM AWST",
            "datetime": "1743670307",
            "relative_time": "8 days ago"
          },
          {
            "text": "Dear Backers, We sincerely apologize for the confusion regarding the lucky winners. Upon review, we found that the recent newsletter was mistakenly adapted from the SD card winners' version, and one line of text was not updated correctly. To clarify, please refer to the winner list as the final reference. If your email is not on the list, unfortunately, you didn’t win this time. However, there will be one more chance after the campaign ends. We truly regret any confusion this may have caused. If you have any questions, feel free to message us on Kickstarter. Thank you for your understanding and support!",
            "commenter": "Neerav k Patel",
            "timestamp": "April 3, 2025 10:36 PM AWST",
            "datetime": "1743690963",
            "relative_time": "8 days ago"
          },
          {
            "text": "",
            "commenter": "Neerav k Patel",
            "timestamp": "April 3, 2025 10:36 PM AWST",
            "datetime": "1743691001",
            "relative_time": "8 days ago"
          },
          {
            "text": "",
            "commenter": "boon",
            "timestamp": "April 11, 2025 8:00 AM AWST",
            "datetime": "1744329646",
            "relative_time": "about 12 hours ago"
          },
          {
            "text": "Truly innovative product! I can see how this benefits all media creators on the move with the ease of making immediate backup. My only wish list is to have cf express slot for those of us who do heavy RAW shoots on full frames",
            "commenter": "Firefly team",
            "timestamp": "April 11, 2025 3:39 PM AWST",
            "datetime": "1744357187",
            "relative_time": "about 5 hours ago"
          },
          {
            "text": "Hi Boon, thanks for your support, you can currently use a USB-A card reader to expand support. If you have any other question, please let me know.",
            "commenter": "Daren Han",
            "timestamp": "April 10, 2025 10:07 PM AWST",
            "datetime": "1744294064",
            "relative_time": "about 22 hours ago"
          },
          {
            "text": "Great project for a pocket Nas.",
            "commenter": "Neerav k Patel",
            "timestamp": "April 3, 2025 4:41 PM AWST",
            "datetime": "1743669719",
            "relative_time": "8 days ago"
          },
          {
            "text": "",
            "commenter": "Firefly team",
            "timestamp": "April 3, 2025 4:50 PM AWST",
            "datetime": "1743670245",
            "relative_time": "8 days ago"
          },
          {
            "text": "Hi Neerav, we truly appreciate your support as our first backer. Please don’t be disappointed—you still have a chance to get something special! Here’s how you can participate: 1. Comment and share PocketCloud. 2. Fill out the survey (https://www.surveymonkey.com/r/TDBHXNB) to let us know. As a thank you, you’ll receive a free silicone cover and be eligible for the lucky draw to win a free PocketCloud after the campaign wraps up. Thank you for your understanding and continued support. 😊",
            "commenter": "Neerav k Patel",
            "timestamp": "April 3, 2025 6:21 PM AWST",
            "datetime": "1743675699",
            "relative_time": "8 days ago"
          },
          {
            "text": "",
            "commenter": "Neerav k Patel",
            "timestamp": "April 3, 2025 9:15 PM AWST",
            "datetime": "1743686150",
            "relative_time": "8 days ago"
          },
          {
            "text": "",
            "commenter": "Michael Butler",
            "timestamp": "April 3, 2025 2:42 AM AWST",
            "datetime": "1743619325",
            "relative_time": "9 days ago"
          },
          {
            "text": "Regarding the add-ons, you have a protector and a zippered pouch. If I were to add the protector, could I then put it in the zippered pouch, along with a USB-C cable for recharging when away from the dock? Also, would you be looking at a version that holds two (2) SSDs? That would allow users who have upgraded to higher capacity SSDs to make use of their older SSDs, rather than putting them in a drawer. Looking forward to this. All the other NAS systems seem to be rather complicated when all one wants is effectively a cloud drive but not in a cloud.",
            "commenter": "Firefly team",
            "timestamp": "April 3, 2025 4:43 PM AWST",
            "datetime": "1743669836",
            "relative_time": "8 days ago"
          },
          {
            "text": "Hi Michael, when PocketCloud is equipped with the protective cover, it can be placed in the zippered pouch together with a USB-C cable. You may choose the PocketCloud+Dock package, which allows you to use two SSDs simultaneously.",
            "commenter": "jesse gallegos",
            "timestamp": "April 2, 2025 9:03 PM AWST",
            "datetime": "1743599029",
            "relative_time": "9 days ago"
          },
          {
            "text": "Great project. Will it support docker?",
            "commenter": "Firefly team",
            "timestamp": "April 2, 2025 11:37 PM AWST",
            "datetime": "1743608275",
            "relative_time": "9 days ago"
          },
          {
            "text": "Hi Jesse, thanks for your kind words! We are currently evaluating Docker integration and will be sure to provide updates as soon as we have more information.",
            "commenter": "James Mc Conkey Jr",
            "timestamp": "April 2, 2025 11:39 PM AWST",
            "datetime": "1743608350",
            "relative_time": "9 days ago"
          }
        ]
      }
    ]
  }
}