{
  "url": "https://www.kickstarter.com/projects/majextand/majextand-s-precision-metal-stand-a-luxury-for-your-phone/posts",
  "campaign_details": {
    "funding_period_text": "Funding period\nMar 26 2025 - May 16 2025 (51 days)",
    "funding_start_date": "2025-03-26T00:00:00.000000Z",
    "funding_end_date": "2025-05-16T21:44:39.344533Z",
    "funding_duration_days": 51,
    "pledged_amount": "S$ 97,715",
    "funding_goal": "S$ 4,278",
    "backers_count": "1,044",
    "days_left": 35,
    "project_launch_text": "Project launches MARCH 26, 2025"
  },
  "updates": {
    "count": 1,
    "content": [
      {
        "update_number": "UPDATE #1",
        "title": "We’re Funded - Thank You for an Incredible Start! & New Add-Ons Available 🙌",
        "creator": "Majextand\nMarch 28, 2025",
        "date": "March 28, 2025",
        "content": "Hello backers!\nFirst of all, thank you for joining us on this journey! The 48-hour limited offers have now ended, and we’re now in our early-bird tier - offered with limited quantities. If you know someone who might be interested, now’s the time to let them know before these deals are gone! \n📣 New Add-Ons Are Here!\nDue to popular demand, we’ve added two new add-ons for those backing Majextand (for laptops) and Majextand M: \n• Majextand Adhesive Strip Set (for laptops) \nReattach your Majextand to a different laptop with these residue-free strips, so Majextand will always stay with you through every laptop upgrade!\n• Majextand M Docking Sheet (for tablets, Kindle, Switch)\nApply the docking sheet to multiple devices so you can seamlessly switch Majextand M between them!\nWe’re also honored to have Majextand S recognized as a Project We Love by Kickstarter, which is a great acknowledgement of the effort and dedication we’ve put into making this project a reality. \nOnce again, thank you for being part of this! If you have any questions, please don’t hesitate to get in touch. We’re always happy to help!\n--------------------------------------------------------------------------------\nHere’re some exciting projects that we’d like to share with you!\nS+ Pure Thermos: Premium 316 Stainless Steel for 365 Days of Drinks\n12H Warm/Cold Double-Wall Insulation | Gasket-Free Flip Cap | Anti-Choke Spout | Odor-Resistant Ag+ | Coating-Free, Safe for Any Drinks\nCoating-Free 316 Stainless Steel: For any drinks from coffee, protein shakes to fresh smoothie\nExceptionally leak-proof: For your life on the go\nSeamless Rounded Inner Base: Super easy to clean and mix drinks\nStay-in Straw: Pops up automatically and stays inside when cap is closed\nGasket-Free, Ag+ Treated Flip Cap: Resistant to mold & lingering flavor \nDouble-Walled Insulation: Keep drinks warm & cold for 12 hours\nSlim Body Design: Fits most standard car cup holders\n25oz Big Capacity: Hydrates your whole day\nEarly bird deals with up to 50% off & April delivery will be gone soon - grab yours now!\n/\nMini Press | Effortlessly Craft 100+ Flavors\nSmallest coffee maker ever! Simplest way to enjoy coffee, cold brew, tea and more! Quick setup & cleanup, effortless for consistently flawless cups every time. \nBrew in 3 simple steps: Add coffee, stir, press - done!\nCompact & light: Perfect for travel or on the go.\nClean taste: Fine extraction holes, no paper filter needed.\nMess-free brewing: Drip-free base stand included.\nEasy to clean: Made with 304 stainless steel for quick & easy cleanup.\nOptimized for 1 cup: Get 15g easily - no measurement needed. \nIncredible versatility: Hot coffee, cold brew, tea, herbal blends, fruit infusions and any creative combos!\n🔥 Limited early bird deals up to 58% off - grab yours before they’re gone! \n/\n[Just Launched] Earthy & Eartha: Upcycled Vintage Kicks from Work to Workout\nDesigned for the modern urban lifestyle, Earthy & Eartha Sneakers seamlessly blend vintage aesthetics with cutting-edge technology, offering all-day comfort for running, workouts, and city life. \nCrafted from natural resources, keeping you effortlessly comfortable.\nEco-Innovative Materials: Made from upcycled oyster shells, bamboo, tea leaves, corn-based materials, and recycled PET.\nPatented SKIVE-ON® Outsole: Optimized support and flexibility in every step.\nSmart Casual Design: Transitions seamlessly from work to play.\nBuilt for Resilience: Long-lasting performance in any environment.\nTriple-Layer Defense: Water-repellent, breathable, and odor-free for all-day freshness.\nUltra-Lightweight: Light as three eggs, yet built to last.\nDon’t miss out the best deal– GET YOURS NOW\n/\n[Launching Soon] Spinner Drive Pro x Anti Slip Bits: Grooved for Maximum Grip\nSpinner Drive Pro redefines versatility with a sleek, ergonomic design and anti-slip bits technology, giving you unmatched grip, effortless torque, and precision control for any task. It’s time to experience a smarter, smoother way to screw.\nPower-Boosting Spinner Wheel – A larger handle diameter increases torque without bulk, delivering more force and faster rotation for big tasks.\nAnti-Slip Bits – Precision-forged grooves in S2 Tool Steel increase friction, enhance engagement, and prevent slipping under force for ultimate control.\nSilky-Smooth Rotation – A precision ball bearing enables effortless, fingertip-controlled spinning for quick tightening.\nEnhanced Grip & Stability – CNC-machined design improves handling and prevents rolling on surfaces\nFollow along now to get notified when we go live!",
        "url": "https://www.kickstarter.com/projects/majextand/majextand-s-precision-metal-stand-a-luxury-for-your-phone/posts/4348009",
        "likes_count": 6,
        "comments_count": 0,
        "comments": []
      }
    ]
  }
}