{
  "url": "https://www.kickstarter.com/projects/morfone/3-in-1-dual-head-electric-minoxidil-atomizer-scalp-massager",
  "updates": {
    "count": 4,
    "content": [
      {
        "update_number": "UPDATE #4",
        "title": "Exciting News: Get a FREE $9.98 Derma Roller When We Hit 400 Backers!",
        "creator": "Morfone\nFebruary 18, 2025",
        "date": "February 18, 2025",
        "content": "Dear Valued Backers,\nFirst and foremost, we want to extend our heartfelt gratitude to each and every one of you for helping us reach 200 backers on our Kickstarter journey! Your support has been truly inspiring, and we couldn’t have done it without you.\nBut this is just the beginning. We’re excited to announce a special challenge that will benefit every single backer if we hit our next milestone:\nIf we reach 400 backers in the next 17 days, we’ll send a FREE $9.98 Derma Roller to EVERY supporter!\nThis high-quality Derma Roller is an incredible addition to your hair care routine, and we’d love to share it with you as a token of our appreciation for making this project a success.\nHow You Can Help:\nYour support doesn’t stop at backing the project—spreading the word makes all the difference! Here’s how you can help us achieve this goal:\nShare Our Project: Tell your friends, family, and social media followers about our campaign. The more people who know about it, the greater our chances of success!\nLeave a Comment or Review: Positive feedback helps others discover why our product is worth supporting.\nEncourage Others to Back: Every new backer brings us closer to unlocking the Derma Roller reward for everyone!\nLet’s Work Together!\nWe believe in the power of community, and with your help, we’re confident we can surpass this milestone. Remember, the reward is not just for new backers—it’s for everyone who has already supported us too!\nThank you once again for being such an amazing part of our journey. Together, we can make this project even more successful and bring value to all of our supporters.\nStay tuned for more updates, and feel free to reach out if you have any questions or ideas.\nThe Morfone Team",
        "url": "https://www.kickstarter.com/projects/morfone/3-in-1-dual-head-electric-minoxidil-atomizer-scalp-massager/posts/4316861",
        "likes_count": 3,
        "comments_count": 0,
        "comments": []
      },
      {
        "update_number": "UPDATE #3",
        "title": "Join Our Kickbooster Program & Earn 15% Commission! 🚀",
        "creator": "Morfone\nFebruary 12, 2025",
        "date": "February 12, 2025",
        "content": "Dear Backers,\nWe’re thrilled to invite you to be part of our Kickbooster affiliate program and help us spread the word about our Kickstarter campaign—all while earning a 15% commission on every successful pledge!\nHow It Works:\n✔ Sign up on Kickbooster and get your unique referral link.\n✔ Share your link on social media, blogs, or with your network.\n✔ Earn 15% commission for every order placed through your link!\nThis is a fantastic way to support our campaign and get rewarded for it. We truly appreciate your help in bringing our project to life!\nClick below to join now and start boosting with us:\n👉 https://morfone.kickbooster.me/boost/electric-minoxidil-atomzier\nThank you for being part of our journey!\nBest regards,\nMorfone Team",
        "url": "https://www.kickstarter.com/projects/morfone/3-in-1-dual-head-electric-minoxidil-atomizer-scalp-massager/posts/4311497",
        "likes_count": 3,
        "comments_count": 0,
        "comments": []
      },
      {
        "update_number": "UPDATE #2",
        "title": "Giveaway Alert - Win A FREE Minoxidil Topical Solution!",
        "creator": "Morfone\nFebruary 6, 2025",
        "date": "February 6, 2025",
        "content": "We are hosting a “Comment & Share Giveaway” event to show our appreciation for your support! Be among the first 50 backers to participate in our event and receive a FREE Minoxidil Topical Solution.\nTo enter the giveaway, please follow the simple steps below:\nStep 1: Share the Morfone Electric Minoxidil Atomizer campaign with your friends and family on social media. 📢\n                                                          Click on the icons to start sharing!\nNote: You can also share projects through buttons below the project. Of course, you can use your most commonly used social media platforms to share.\nStep 2: Leave a comment under the campaign discussion and let us know, \"Why are you excited about the  Morfone Electric Minoxidil Atomizer?” Don't forget to include your pledge number and the link to your shared social post.\nPlease note that you must complete both steps to receive a full giveaway entry. The giveaway is on a first-come, first-served basis and is limited to the first 50 participants. \nIn addition, this event is only open to the Morfone Electric Minoxidil Atomizer campaign backers. We will note your entry/contribution number and ship the prize with your reward at the time of delivery.\n*A friendly reminder: please ignore the disclaimer that says \"Rewards are not guaranteed\". Our team at Morfone has a 100% delivery guarantee for our backers and you will only be charged when the campaign ends. 💯\nThank you again and we are thrilled that you are joining us on this exciting journey! 👏\nCheers,\nMorfone Team",
        "url": "https://www.kickstarter.com/projects/morfone/3-in-1-dual-head-electric-minoxidil-atomizer-scalp-massager/posts/4308075",
        "likes_count": 3,
        "comments_count": 7,
        "comments": [
          {
            "text": "so excited to receive and see the results!!! backer #247 https://x.com/toiletgoblinn/status/1892085276991803519?t=9zv_N5Ew56m4n8mxGkny3Q&s=19",
            "commenter": "Jessica Farias",
            "timestamp": "February 19, 2025 1:36 PM AWST",
            "datetime": "1739943361",
            "relative_time": "6 days ago"
          },
          {
            "text": "Hi, do you provide Minoxidil solution or I have to buy it by myself?",
            "commenter": "徐捷",
            "timestamp": "February 10, 2025 5:31 PM AWST",
            "datetime": "1739179908",
            "relative_time": "15 days ago"
          },
          {
            "text": "Hi, If you participate in and complete this activity, we will send minoxidil together with the product when sending it out.",
            "commenter": "Morfone",
            "timestamp": "February 10, 2025 5:35 PM AWST",
            "datetime": "1739180151",
            "relative_time": "15 days ago"
          },
          {
            "text": "Amazing project and I am hoping for great results. Best of luck.",
            "commenter": "Ivan Dias",
            "timestamp": "February 6, 2025 5:04 PM AWST",
            "datetime": "1738832649",
            "relative_time": "19 days ago"
          },
          {
            "text": "Hi, Thanks for your comment. Our activity requires posting project links on your social media platforms and leaving comments. If you have completed these steps, please leave a new comment below and don't forget to include your shared link.",
            "commenter": "Morfone",
            "timestamp": "February 6, 2025 5:44 PM AWST",
            "datetime": "1738835092",
            "relative_time": "19 days ago"
          },
          {
            "text": "I'm soo excited to finally have an effective tool for messaging my scalp than my hands. I can't wait to finally have stronger hair.",
            "commenter": "Yosef Shaliehsabou",
            "timestamp": "February 6, 2025 4:09 PM AWST",
            "datetime": "1738829372",
            "relative_time": "19 days ago"
          },
          {
            "text": "Hi, thanks for your comment, our activity requires posting project links on your social media platforms and leaving comments. If you have achieved it, please leave a new comment.",
            "commenter": "Morfone",
            "timestamp": "February 6, 2025 4:19 PM AWST",
            "datetime": "1738829975",
            "relative_time": "19 days ago"
          }
        ]
      },
      {
        "update_number": "UPDATE #1",
        "title": "A Heartfelt Thank You to Our Amazing Backers! 🙌",
        "creator": "Morfone\nFebruary 6, 2025",
        "date": "February 6, 2025",
        "content": "Dear Valued Backers,\nWe are thrilled to announce that, thanks to your incredible support, we have successfully reached our initial funding goal of $8,492! 💪This milestone would not have been possible without each one of you. From the bottom of our hearts, thank you for believing in our project and helping us turn our vision into reality.\nWe are excited to bring you a brand new scalp care solution with our Minoxidil Atomizer. Designed to provide an innovative approach to scalp health, we believe this product will offer you an unparalleled experience tailored to your needs. We can't wait for you to try it out and witness the difference it makes in your daily routine.❤️\nAs we move forward, please know that our commitment to you doesn't end here. We are dedicated to providing all backers with the best possible after-sales service. Should you have any questions, concerns, or feedback, don’t hesitate to reach out. Your satisfaction is our top priority.\nMoreover, we kindly ask for your continued support by sharing our project on your social media platforms. Spreading the word about what we're doing can help us reach even greater heights and bring this innovative scalp care solution to more people around the world.\nThank you once again for being part of this journey with us. Together, we can make a real difference!🚀\nWarmest regards,\nMorfone Team",
        "url": "https://www.kickstarter.com/projects/morfone/3-in-1-dual-head-electric-minoxidil-atomizer-scalp-massager/posts/4307944",
        "likes_count": 3,
        "comments_count": 0,
        "comments": []
      }
    ]
  }
}