{
  "url": "https://www.kickstarter.com/projects/1416659071/acefit-pro",
  "campaign_details": {
    "funding_period_text": "Funding period\nJan 13 2025 - Feb 27 2025 (45 days)",
    "funding_start_date": "2025-01-13T10:44:41-05:00",
    "funding_end_date": "2025-02-27T10:44:41-05:00",
    "funding_duration_days": 45,
    "pledged_amount": "HK$ 461,948",
    "funding_goal": "HK$ 12,000",
    "backers_count": "426"
  },
  "updates": {
    "count": 4,
    "content": [
      {
        "update_number": "UPDATE #4",
        "title": "Wonderful Campaign Ending & Important Updates",
        "creator": "ACEFAST\nMarch 4, 2025",
        "date": "March 4, 2025",
        "content": "Dear Backers,\nAs our campaign officially concludes, we want to extend our heartfelt gratitude for your trust and support of the ACEFAST ACEFIT Pro. Your enthusiasm has been truly inspiring. While this campaign comes to an end, the journey of making ACEFIT Pro a reality continues!\nWhat’s Next?\nShipping Information Collection\nWe will soon begin collecting your shipping details via a survey. This survey will allow you to provide your address and select your preferred color. Please check your email inbox and complete the survey within 3 days of receiving it to avoid delays.\nPayment Collection\nKickstarter will begin collecting pledges 7-14 days after the campaign ends. To ensure your payment goes through smoothly, please:\nVerify your credit card details.\nEnsure your card is valid and has sufficient credit available.\nConfirm your billing information is correct.\nContact your bank if any issues arise.\nIf you encounter any problems, please reach out to us at service@acefastacefitpro.com or contact Kickstarter at www.kickstarter.com/contact.\nProduction & Shipping Update\nWe are excited to announce that we are now ready to enter mass production! As promised, the first batch of ACEFIT Pro units will be shipped within March 2025.\nTo ensure a smooth delivery process:\nShipping Method: We will ship via express delivery.\nEstimated Delivery Time: 7-15 days for global shipping.\nShipping Cost: Free worldwide shipping, including taxes and duties.\nRewards & Announcements\nWe will announce the winners of any campaign rewards in our next update, based on successful payment completion. Stay tuned!\nThank You!\nThank you for your trust and patience as we work to deliver the ACEFIT Pro to you. We are committed to bringing you a premium product and ensuring a seamless experience. Stay tuned for further updates as we move closer to shipping!\nWith love,\nThe ACEFAST Team",
        "url": "https://www.kickstarter.com/projects/1416659071/acefit-pro/posts/4327857",
        "likes_count": 12,
        "comments_count": 3,
        "comments": [
          {
            "text": "Just done the survey 🥶 silly me make shipping late 😭",
            "commenter": "Zep",
            "timestamp": "March 12, 2025 8:01 AM AWST",
            "datetime": "1741737708",
            "relative_time": "1 day ago"
          },
          {
            "text": "Can't wait to try them!",
            "commenter": "Robert Smith",
            "timestamp": "March 11, 2025 3:00 AM AWST",
            "datetime": "1741633259",
            "relative_time": "3 days ago"
          },
          {
            "text": "My pledge was already collected. From what I understand, funds to the creator are the ones that become available after 2 weeks",
            "commenter": "DuMadeira",
            "timestamp": "March 4, 2025 3:15 AM AWST",
            "datetime": "1741029315",
            "relative_time": "10 days ago"
          }
        ]
      },
      {
        "update_number": "UPDATE #3",
        "title": "ACEFIT Pro Reliability Test Has Started!",
        "creator": "ACEFAST\nJanuary 29, 2025",
        "date": "January 29, 2025",
        "content": "Hi ACEFIT Pro Backers,\n  Following the successful conclusion of our trial production, we have now entered the production testing stage. In the video below, we've conducted several reliability tests, including:\n  Artificial Sweat Corrosion Test\nTemperature and Humidity Test\nWaterproof Test\nTransportation Reliability Test\nRF Bluetooth Connectivity and Electroacoustic Test\nACEFAST at CES\nThis month, ACEFAST showcased the ACEFIT Pro at CES in Las Vegas. We had the pleasure of inviting numerous visitors to try our headphones and received overwhelmingly positive feedback! Check out the video to see what they had to say about ACEFIT Pro.\n  Earn 15% Cashback with Kickbooster\nOur Kickbooster program is still in full swing! Refer ACEFIT Pro to a friend and earn 15% cashback for each referral. Let's do the math: if you refer ACEFIT Pro to 6 friends, you could essentially get it for free!\n  Sign Up Now: https://acefit-pro-open-ear-headphones-with.kickbooster.me/boost/acefit-pro-open-ear-headphones\n  Thank you for your continued support!\n  Best regards,\nACEFAST Team",
        "url": "https://www.kickstarter.com/projects/1416659071/acefit-pro/posts/4301822",
        "likes_count": 11,
        "comments_count": 1,
        "comments": [
          {
            "text": "Can't wait to get them",
            "commenter": "Reginald",
            "timestamp": "January 29, 2025 1:09 PM AWST",
            "datetime": "1738127357",
            "relative_time": "about 1 month ago"
          }
        ]
      },
      {
        "update_number": "UPDATE #2",
        "title": "Enjoy 15% Cashback for Referrals + In-Depth Professional Review",
        "creator": "ACEFAST\nJanuary 20, 2025",
        "date": "January 20, 2025",
        "content": "Hi ACEFIT Pro Backers,\n  We’re thrilled to announce that over 240 backers have joined our project! Your support means the world to us, and we can’t wait to bring the ACEFIT Pro to life. As mentioned in our last update, the first 200 backers will receive a stylish fanny pack as a gift. We hope you enjoy this special surprise alongside your ACEFIT Pro Headphones—it’s a small token of our appreciation for your early support!\n  Refer and Get 15% Cashback\nWe have another fantastic perk for our early supporters: our referral program! Spread the word about ACEFIT Pro to your friends and family, and for every successful referral, you’ll receive 15% cashback on your purchase. Whether it’s one friend or several, the more you refer, the more you earn! It’s a win-win situation! Don’t hesitate—sign up for Kickbooster below to start earning your cashback today.\n  Must-Watch Review from TT Technology\nWe also invite you to check out what YouTuber TT Technology has to say about the ACEFIT Pro! In their latest video, they provide an in-depth review, showcasing each feature and demonstrating how the headphones perform in real-life scenarios. This review is a great way to see the product in action and hear expert insights!\n  Thank you once again for being part of this journey with us. We’re excited to continue sharing updates and getting closer to our launch.\n  Best,\nACEFAST Team",
        "url": "https://www.kickstarter.com/projects/1416659071/acefit-pro/posts/4296015",
        "likes_count": 11,
        "comments_count": 2,
        "comments": [
          {
            "text": "Where is the link to sign up for the booster program? The boost not button in the picture/ad doesn't work",
            "commenter": "Susan Kubicki",
            "timestamp": "January 21, 2025 9:24 AM AWST",
            "datetime": "1737422687",
            "relative_time": "about 2 months ago"
          },
          {
            "text": "Here it is: https://acefit-pro-open-ear-headphones-with.kickbooster.me/boost/acefit-pro-open-ear-headphones",
            "commenter": "ACEFAST",
            "timestamp": "January 21, 2025 7:38 PM AWST",
            "datetime": "1737459539",
            "relative_time": "about 2 months ago"
          }
        ]
      },
      {
        "update_number": "UPDATE #1",
        "title": "We Are Live! Join Our Giveaway & Win An ACEFIT Pro!",
        "creator": "ACEFAST\nJanuary 14, 2025",
        "date": "January 14, 2025",
        "content": "Hi ACEFIT Pro Backers,\n  Thank you for supporting the ACEFIT Pro campaign! From dreams to reality, we've transformed our concept into the final ACEFIT Pro prototype. After finishing our initial draft in November 2023, we dedicated months to perfecting our design. Now, we are live on Kickstarter!\n  Join Our Giveaway\nTo express our gratitude, we’ve prepared special gifts for our supporters:\n🏆 First Prize: A free ACEFIT Pro for 1 lucky winner \n🥈 Second Prize: Buy 1 ACEFIT Pro, get 2 for 10 lucky winners \n🎁 Third Prize: The first 200 backers receive a free fanny pack\n  How To Enter\nBack our campaign on Kickstarter within the first 24 hours\nComment on your favorite feature of ACEFIT Pro\nWinners for the first and second prizes will be announced within 24 hours\n  Trial Production Started!\nWe’re in trial production and will begin mass production in February. Global shipping starts in March via air transport. Check out the behind-the-scenes action of ACEFIT Pro manufacturing!\n  Professional Review from Flossy Carter\nDiscover what YouTuber Flossy Carter has to say about the ACEFIT Pro! Known for his exceptional tech reviews, Flossy Carter offers a detailed look at our product. Watch the video now!\n  Thank you again for your love and support! We’ll keep you updated on the production progress.\n  Best Regards,\nACEFAST Team",
        "url": "https://www.kickstarter.com/projects/1416659071/acefit-pro/posts/4291451",
        "likes_count": 13,
        "comments_count": 2,
        "comments": [
          {
            "text": "I love the choices !",
            "commenter": "Susan Kubicki",
            "timestamp": "January 21, 2025 9:17 AM AWST",
            "datetime": "1737422228",
            "relative_time": "about 2 months ago"
          },
          {
            "text": "Long battery life, light weight and the colors of course",
            "commenter": "Amber Shay",
            "timestamp": "January 14, 2025 2:16 AM AWST",
            "datetime": "1736792176",
            "relative_time": "about 2 months ago"
          }
        ]
      }
    ]
  }
}