{
  "url": "https://www.kickstarter.com/projects/airthereal/airthereal-revive-r800-5l-wifi-smart-kitchen-composter",
  "campaign_details": {
    "funding_period_text": "Funding period\nFeb 17 2025 - Mar 19 2025 (30 days)",
    "funding_start_date": "2025-02-17T07:31:04-05:00",
    "funding_end_date": "2025-03-19T07:31:04-04:00",
    "funding_duration_days": 30,
    "pledged_amount": "$23,783",
    "funding_goal": "$5,000",
    "backers_count": "80",
    "days_left": 80
  },
  "updates": {
    "count": 2,
    "content": [
      {
        "update_number": "UPDATE #2",
        "title": "🚀 Revive R800 Update: Thank You! Next Steps – VAT/Taxes Survey, Product Upgrade & Production Testing Updates",
        "creator": "Airthereal\nMarch 19, 2025",
        "date": "March 19, 2025",
        "content": "Hi Revive R800 Backers,\nThe crowdfunding campaign for the Airthereal R800 Kitchen Composter has officially come to a successful close! \nA huge thank you to all of you for supporting this eco-friendly innovation. With WiFi smart features and carbon footprint tracking, we can’t wait to see how the R800 helps reduce waste and transform your kitchen into a greener space.\nVAT/Taxes Survey\nWe will be sending out a survey via PledgeBox to collect your shipping details and VAT/Tax information. This survey will arrive 14 days after the campaign ends, following Kickstarter’s standard payment process. We’ll also post a reminder when it’s time to complete the survey.\nUpgraded LED Screen Frame\nWe’ve upgraded the LED screen frame from black to a sleek silver-plated finish, perfectly complementing the modern gray exterior. This refined design enhances the overall look of the Revive R800, making it a stylish addition to any space.\nProduction Testing Updates\nWe’re excited to share the latest Revive R800 production update! Our production sample is currently undergoing rigorous testing, and here’s what we’ve accomplished so far:\nDrop Test Passed\nThe Revive R800 successfully endured full-unit drop testing, ensuring it can withstand shipping and handling without damage.\nThe image shows the packaging before the drop test:\nThese images show the machine after the drop test, demonstrating its durability:\nControl Panel Testing: In Progress\nWe are currently testing both the machine screen and the app interface to ensure seamless performance.\nAfter completing an Eco Mode, the Eco Mode data displayed on the machine screen matches the data shown in the app:\nWe appreciate your patience and support as we continue refining the Revive R800. Stay tuned for more updates!\nBest,\nAirthereal Team",
        "url": "https://www.kickstarter.com/projects/airthereal/airthereal-revive-r800-5l-wifi-smart-kitchen-composter/posts/4330342",
        "likes_count": 2,
        "comments_count": 0,
        "comments": []
      },
      {
        "update_number": "UPDATE #1",
        "title": "100% Funded, 10% Cashback – Join the Movement for Sustainable Living!",
        "creator": "Airthereal\nFebruary 18, 2025",
        "date": "February 18, 2025",
        "content": "Hi friends,\nThank you so much for your support! We've got some exciting news to share with you.\n🎉 We’re 100% Funded! \nWe hit our goal! Airthereal’s first Kickstarter campaign reached its target faster than we could’ve imagined. A huge thank you to everyone who supported the Revive R800 5L Kitchen Composter—together, we’re making sustainable living easier for all!\nLet’s keep the momentum going!\n🤑 Earn 10% Cashback\nDo you know someone who is interested in reducing food waste? Share this project with them and earn 10% cashback for spreading the word! Together, we can make an even bigger impact.\n👉 Click Here to Earn Cashback Now!\nCurious About Airthereal? Connect with Us:\nWebsite: airthereal.com\nHome Composting Facebook Group: Join the Conversation\nBest,\nAirthereal Team",
        "url": "https://www.kickstarter.com/projects/airthereal/airthereal-revive-r800-5l-wifi-smart-kitchen-composter/posts/4316840",
        "likes_count": 1,
        "comments_count": 0,
        "comments": []
      }
    ]
  }
}