{
  "url": "https://www.kickstarter.com/projects/thevermeil/badger-wear-your-gifs",
  "campaign_details": {
    "funding_period_text": "Funding period\nFeb 11 2025 - Mar 11 2025 (28 days)",
    "funding_start_date": "2025-02-11T08:59:16-05:00",
    "funding_end_date": "2025-03-11T08:59:16-04:00",
    "funding_duration_days": 28,
    "pledged_amount": "",
    "funding_goal": "AU$ 700",
    "backers_count": "12"
  },
  "updates": {
    "count": 2,
    "content": [
      {
        "update_number": "UPDATE #2",
        "title": "We are thankful!",
        "creator": "The Vermeil\nMarch 10, 2025",
        "date": "March 10, 2025",
        "content": "This is amazing. The project has reached the required funding goal and exceeded it! We have almost finalised our work on the mobile app required for the device and will launch it soon (in the next week or so). We are still looking good to deliver the product by the end of March or early April as we receive the money from Kickstarter. I can't express how thankful I am to everyone who has supported us so far. If you follow us on Instagram @vermeil.eng, we will be posting updates over there more frequently. Soon, we will be sending through links in your dm to ask for your delivery address.",
        "url": "https://www.kickstarter.com/projects/thevermeil/badger-wear-your-gifs/posts/4333235",
        "likes_count": 1,
        "comments_count": 0,
        "comments": []
      },
      {
        "update_number": "UPDATE #1",
        "title": "This is Great! We are 100% funded.",
        "creator": "The Vermeil\nFebruary 17, 2025",
        "date": "February 17, 2025",
        "content": "Thank you so much.\nEveryone, I can't express how happy I am that we have reached our funding goals. I'll be posting more updates on how we are going on our side so watch out! It would also be great if you guys could follow us on Instagram our Instagram ID is @vermeil.eng (link provided below). if you could spread some word about this product I would really appreciate that.\nBadger is a first step in our attempt to re-innovate clothing we are working on some insanely great stuff like hoodies and pants with dynamic art functionality! you don't wanna miss out on that.\nLastly, we are super focused on delivering on our promise we plan to start delivery in late march 2025 and in a scenario where we are unable to deliver we will arrange refunds even if we are at a loss. (SO EXCITED FOR THIS).\nhttps://www.instagram.com/vermeil.eng/",
        "url": "https://www.kickstarter.com/projects/thevermeil/badger-wear-your-gifs/posts/4316111",
        "likes_count": 0,
        "comments_count": 0,
        "comments": []
      }
    ]
  }
}