{
  "url": "https://www.kickstarter.com/projects/944362954/bapaco-the-worlds-first-keyboard-with-a-built-in-computer",
  "campaign_details": {
    "funding_period_text": "Funding period\nFeb 14 2025 - Mar 11 2025 (25 days)",
    "funding_start_date": "2025-02-14T09:46:56-05:00",
    "funding_end_date": "2025-03-11T09:46:56-04:00",
    "funding_duration_days": 25,
    "pledged_amount": "",
    "funding_goal": "HK$ 5,000",
    "backers_count": "87"
  },
  "updates": {
    "count": 2,
    "content": [
      {
        "update_number": "UPDATE #2",
        "title": "Almost there! Production Readiness",
        "creator": "Bapaco Tech\nMarch 11, 2025",
        "date": "March 11, 2025",
        "content": "Hello Everyone!\nAs we enter the final day of our Kickstarter campaign, we're overwhelmed with excitement and gratitude for the amazing support you've shown Bapaco! With your help, we're ready to take the next big step: production!\nWe've been working tirelessly behind the scenes to ensure a smooth transition from campaign to fulfillment. We're thrilled to announce that we have secured all the necessary materials and components and our manufacturing partners are ready to begin production very soon after the campaign closes. This means we are still on track to fulfill all of your orders by our estimated delivery date.\nHere's a quick recap of what we've accomplished so far:\nFinalized Design: We've completed and thoroughly tested our design, and are ready for full-scale production.\nSecured Manufacturing Partnerships: We've partnered with experienced manufacturers to bring Bapaco to life.\nProcured Materials: All necessary materials and components are now secured.\nQuality Control: We have implemented a rigorous quality control process to ensure every Bapaco meets our high standards.\nWe are so excited to get Bapaco into your hands and are working hard to make that happen as quickly as possible. We will continue to share updates on our progress throughout the production and fulfillment process.\nThank you once again for your incredible support!\nSincerely,\nThe Bapaco Team.",
        "url": "https://www.kickstarter.com/projects/944362954/bapaco-the-worlds-first-keyboard-with-a-built-in-computer/posts/4333639",
        "likes_count": 2,
        "comments_count": 0,
        "comments": []
      },
      {
        "update_number": "UPDATE #1",
        "title": "The Bapaco Community is Growing! Thank You for Your Support",
        "creator": "Bapaco Tech\nFebruary 19, 2025",
        "date": "February 19, 2025",
        "content": "Wow! We are absolutely thrilled to share that in just 6 days, Bapaco has already surpassed $25,000 in funding thanks to the incredible support of over 40 backers! 🎉 We are incredibly grateful for your enthusiasm and belief in our vision to revolutionize the keyboard. 🚀\nThis early success means the world to us. It validates our idea and motivates us even further to bring Bapaco to life. 💪 Your pledges will help us finalize development, secure manufacturing partnerships, and ultimately, deliver a truly innovative product that we believe will transform how you work, create, and connect. 💻\nWe want to express our sincere gratitude to each and every one of you who has backed Bapaco so far. 🙏 Whether you've pledged, shared our campaign with your friends, or simply left a comment of encouragement, your support means everything.\nWhat's next?\nWe're not slowing down! We'll continue to share updates on our progress, behind-the-scenes glimpses of the development process, and exciting news about Bapaco's features and functionality.\nWe're also hard at work preparing some exciting stretch goals that will unlock even more value for our backers. Stay tuned for more updates on that soon! 👀\nIn the meantime, please continue to spread the word about Bapaco. The more backers we have, the more amazing features we can unlock and the better Bapaco will be!\nThank you again for your incredible support!\nSincerely,\nThe Bapaco Team",
        "url": "https://www.kickstarter.com/projects/944362954/bapaco-the-worlds-first-keyboard-with-a-built-in-computer/posts/4317923",
        "likes_count": 3,
        "comments_count": 0,
        "comments": []
      }
    ]
  }
}