{
  "url": "https://www.kickstarter.com/projects/comicuno/beastsnow3",
  "campaign_details": {
    "funding_period_text": "Funding period\nMar 04 2025 - Apr 03 2025 (30 days)",
    "funding_start_date": "2025-03-04T00:00:00.000000Z",
    "funding_end_date": "2025-04-03T22:50:23.138735Z",
    "funding_duration_days": 30,
    "pledged_amount": "S$ 57,770",
    "funding_goal": "S$ 40,132",
    "backers_count": "1,133",
    "days_left": 8,
    "project_launch_text": "Project launches MARCH 4, 2025"
  },
  "updates": {
    "count": 5,
    "content": [
      {
        "update_number": "UPDATE #5",
        "title": "\"Carmilla Unbound\" Crossover Art Print!",
        "creator": "Phil Falco (Lifeline Comics)Collaborator\nMarch 24, 2025",
        "date": "March 24, 2025",
        "content": "\"Carmilla Unbound\" Crossover Art Print\nLooking for more awesome Vampire Comics? Our friends Clay Adams and D.E. Schrader are live with their own Sexy 1980's Vampire comic: Carmilla Unbound: 1984 - Miami Bites!\nWe're excited to announce that \"The Beast & Snow\" is partnering with Clay & D.E. to offer an EXCLUSIVE CROSSOVER ART PRINT to anyone who supports both of our live campaigns!\nGet this FREE Crossover Art Print when you support both campaigns!\nThis art print by Peter Taylor (Lines) & Falk Hänsel (Colors) sees Vampire Carmilla and Werewolf Belle back-to-back!\nCarmilla Unbound: 1984: \"More sex! More violence! More vice! The sultry vampiress returns in a taut thriller set to a pulsing, pink & blue, synth soundtrack.\"\nCarmilla Unbound: 1984 - Miami Bites is LIVE!\nBackers who support both campaigns at a Physical Pledge Level (meaning you're having some rewards shipped to you in both campaigns) will receive a both Physical copy (included in your Carmilla Unbound rewards package) and a Hi-res Digital copy of the art print.\nBackers who support both campaigns at a Digital Pledge Level (or one campaign Physically and the other Digitally) will receive just the Hi-res Digital copy of the art.\nThis Art Print will only be available via this crossover initiative, so don't miss out!\nSupport \"Carmilla Unbound\": https://www.kickstarter.com/projects/schraderopolis/carmilla-unbound-1984-miami-bites?ref=esvjcg",
        "url": "https://www.kickstarter.com/projects/comicuno/beastsnow3/posts/4344324",
        "likes_count": 25,
        "comments_count": 1,
        "comments": [
          {
            "text": "Backed! Looks fun :)",
            "commenter": "Devon Hickey",
            "timestamp": "March 25, 2025 12:24 AM AWST",
            "datetime": "1742833486",
            "relative_time": "2 days ago"
          }
        ]
      },
      {
        "update_number": "UPDATE #4",
        "title": "\"Night Wolf\" Crossover Art Print!",
        "creator": "Phil Falco (Lifeline Comics)Collaborator\nMarch 20, 2025",
        "date": "March 20, 2025",
        "content": "\"Night Wolf\" Crossover Art Print\nIf you're a fan of werewolf stories, then you're most likely already familiar with Rob Multari's long-running comic series: \"Night Wolf\" and \"Snow Paw\"!\nWe're excited to announce that \"The Beast & Snow\" is partnering with Rob to offer an EXCLUSIVE CROSSOVER ART PRINT to anyone who supports both of our live campaigns!\nFREE Crossover Art Print with NIGHT WOLF by Evan Scale\nThis art print by Evan Scale sees Night Wolf and Werewolf Belle going full-wolf and fighting over a stick!\n\"Night Wolf #1-10\" is an Urban Fantasy series that sees a young man get reluctantly thrown into a supernatural war after discovering his werewolf lineage.\nNight Wolf #1-10: Urban Fantasy Werewolf Coming-of-Age Drama is LIVE on Kickstarter!\nBackers who support both campaigns at a Physical Pledge Level (meaning you're having some rewards shipped to you in both campaigns) will receive a both Physical copy (included in your Night Wolf rewards package) and a Hi-res Digital copy of the art print.\nBackers who support both campaigns at a Digital Pledge Level (or one campaign Physically and the other Digitally) will receive just the Hi-res Digital copy of the art.\nThis Art Print will only be available via this crossover initiative, so don't miss out!\nSupport \"Night Wolf #1-10\": https://www.kickstarter.com/projects/multari/night-wolf-1-10-urban-fantasy-werewolf-coming-of-age-drama?ref=19g15p",
        "url": "https://www.kickstarter.com/projects/comicuno/beastsnow3/posts/4340934",
        "likes_count": 28,
        "comments_count": 0,
        "comments": []
      },
      {
        "update_number": "UPDATE #3",
        "title": "Dancer/Assassin Crossover Print + Next Stretch Goal",
        "creator": "Phil Falco (Lifeline Comics)Collaborator\nMarch 18, 2025",
        "date": "March 18, 2025",
        "content": "Lifeline Comics has just launched a new campaign: The Dancer: A Psychological Martial Arts Graphic Novel -- a trade collects the ENTIRE MINISERIES with an epilogue bonus chapter exclusive to the collected edition.\n\"A Dancer/ASSASSIN is forced to relive the trauma of witnessing her parents' murder as a child. COLLECTING THE COMPLETE MINISERIES!\"\nSupport \"The Dancer\" for a FREE CROSSOVER PRINT!\nAnd while we can't share the art with you just yet, we do have a CROSSOVER ART PRINT that we'll be giving FOR FREE to anyone who backers both The Dancer and The Beast & Snow!\nWhat makes this different from other Crossover Prints you'll see from this campaign is that Digital Backers of The Beast & Snow can still get this print!\nSo long as you back The Dancer Physically (having some rewards shipped to you), you'll get the crossover print as long as you also back The Beast & Snow (regardless of whether this backing is Physical or Digital).\nWe'll share the art for this print once it's complete, but we'll tease that it features Vampire Snow White biting Dancer/Assassin Mia, and is drawn by MeechDoodle!\nCheck out \"The Dancer\" here: https://www.kickstarter.com/projects/philfalco/dancer-vol-1?ref=ecfnwq\nWe're super close to unlocking our first Stretch Goal, so we thought it was a good time to announce our second one!\n🔒 $40K - Indie Bundle Expansion Pass (LOCKED 🔒)\nAll backers get the Indie Comic Book Bundle just for supporting this campaign for $1 or more. It's a collection of digital comics generously donated by the Indie community. And if this Stretch Goal is unlocked, we'll add another 4 books to the bundle!\nIncludes: Tercona #1, Ghost of the Monastery, Oh My Ghost #1, and Ms Johnni #1\n🔒 $43K - 1 Free Trading Card (LOCKED 🔒)\nIf unlocked, all Physical tier backers (backers having some rewards shipped to them) will receive one free EverAfterVerse Trading Card in addition to their pledged rewards!\nIf you're luck you might even pull a RARE HOLO FOIL CARD (Ratio 1:6)!\nMore Kickstarters\nTo end off, here's another campaign to have on your radar from a friend of ours!\nProctor: Vol. 1 - A 140 Page Supernatural Punk Rock Adventure\n\"Imagine if your favorite vampire slayer had a drinking problem and a toxic relationship with her mom. Now, ask her to save the world.\"\n\"If your favorite demon hunter had an unhealthy relationship with her mother, a slight drinking problem, and a story that challenged conventional ideas of love and loss, then PROCTOR would be the end result. With a diverse cast of characters reflective of the communities and people surrounding contemporary readers, fans of the supernatural action-adventure will appreciate Sam’s world and the friends she meets on her journey.\"\nBack it here: https://www.kickstarter.com/projects/proctorcomic/proctor-vol1-a-140-page-supernatural-punk-rock-adventure",
        "url": "https://www.kickstarter.com/projects/comicuno/beastsnow3/posts/4338874",
        "likes_count": 30,
        "comments_count": 2,
        "comments": [
          {
            "text": "what about if I backed both Campaigns Digitally (Premium PDFs)? could you add it as a High-Rez Image to one of them as an extra crossover reward?",
            "commenter": "shay dinur",
            "timestamp": "March 18, 2025 7:47 AM AWST",
            "datetime": "1742255261",
            "relative_time": "9 days ago"
          },
          {
            "text": "Yes! You'll receive the Hi-Res Digital copy for backing both campaigns digitally. Thanks!",
            "commenter": "Phil Falco (Lifeline Comics)",
            "timestamp": "March 18, 2025 7:41 PM AWST",
            "datetime": "1742298066",
            "relative_time": "8 days ago"
          }
        ]
      },
      {
        "update_number": "UPDATE #2",
        "title": "Read a free VAMPIRE Webtoon from the Creators of \"The Beast & Snow\"!",
        "creator": "Kat Calamia (Lifeline Comics)\nMarch 13, 2025",
        "date": "March 13, 2025",
        "content": "NEW WEBTOON: \"Love at Second Bite\"\nWe're excited to announce the debut of a brand new Queer Webtoon from the creators of \"The Beast & Snow\"! This webcomic is premiering as an entry in Webtoon's \"Webcomic Legends 2025\" Contest, and we're asking for YOUR help to win the contest!\n\"Love at Second Bite\" is a Vampire Boy Love series that sees cheerful and sunny vampire, Liam, start college at Hemlock University and develop a crush on his mysterious and gloomy roommate, Dean.\nFans of \"The Beast & Snow\" are sure to enjoy the sharp characters, sleek art, and steamy beats of LASB, and can even expect to see some pretty important Girl Love elements as the series progresses!\nOne of the criteria used to judge entrants in the \"Webcomic Legends\" Contest is Audience Participation. So any help you can give by Reading, Liking, Commenting, Subscribing, and Rating \"LASB\" will be VERY appreciated!\nCheck out \"Love at Second Bite\" here: https://www.webtoons.com/en/canvas/love-at-second-bite-bl/list?title_no=1032775\nAll backers get the Indie Comic Book Bundle just for supporting this campaign for $1 or more. And we'll add even more digital comics to the Indie Bundle as we hit certain Backer Milestone Goals!\n🗝️ 950 Backers  - Werewolf Frankenstein #1 (UNLOCKED 🗝️)\n🔒 1100 Backers  - Tap Dance Killer (LOCKED 🔒)\nMore Kickstarters\nWhile we have you, here are some more awesome Kickstarters you should check out from our peers!\nTHE FEW AND CURSED #11 - A Weird Western Saga 😈\n\"The Redhead is on the run from the Rapture Klan in this action-packed issue! Past books also available, grab the whole series!\"\nBack it here: https://www.kickstarter.com/projects/felipecagno/the-few-and-cursed-11?ref=1foyni\nThe Hollow Remains: 4 Haunting Italian Horror RPG Scenarios\nInstantly playable Italian scenarios for Cthulhu, Vampires, 5E, OSR & any TTRPG – embrace Italy’s dark legacy. The Hollow Remains is a handbook of four horror scenarios inspired by iconic Italian settings, each reflecting a different subgenre of horror.\nOur goal is to enrich roleplaying sessions with atmospheric and detailed scenarios and provide storytellers with ready-to-use tools for developing compelling narratives.\nBack it here: https://www.kickstarter.com/projects/reveltales/the-hollow-remains?ref=72kdol\nSpirit of Lust: Issues 1-3\n\"Get the latest issue of our modern paranormal erotic fantasy comic about a dead girl who wants nothing more than to feel again.\"\nBack it here: https://www.kickstarter.com/projects/drenproductions/spirit-of-lust-issues-1-3?ref=bm7ld9",
        "url": "https://www.kickstarter.com/projects/comicuno/beastsnow3/posts/4335329",
        "likes_count": 24,
        "comments_count": 0,
        "comments": []
      },
      {
        "update_number": "UPDATE #1",
        "title": "Funded + First Stretch/Backer Goals",
        "creator": "Phil Falco (Lifeline Comics)Collaborator\nMarch 10, 2025",
        "date": "March 10, 2025",
        "content": "FUNDED!\nThe Beast & Snow #1-3 has officially hit its funding goal!\nThank you, as always, for coming out to support out campaign in its first week! The early days of a campaign are the most critical to its success, so we're unendingly grateful to have readers who are so ready to jump on the new campaign right away!\nWe're SUPER EXCITED to share this new issue with you! It might be our favorite so far in the series (and it is artist Dorilys's favorite issue).\nWith funding out of the way, let's set our sights on some Stretch Goals!\n🔒 $40K - Indie Bundle Expansion Pass (LOCKED 🔒)\nAll backers get the Indie Comic Book Bundle just for supporting this campaign for $1 or more. It's a collection of digital comics generously donated by the Indie community. And if this Stretch Goal is unlocked, we'll add another 4 books to the bundle!\nIncludes: Tercona #1, Ghost of the Monastery, Oh My Ghost #1, and Ms Johnni #1\nIf the Expansion Pass isn't enough for you, we'll add even more digital comics to the Indie Bundle as we hit certain Backer Milestone Goals!\n🔒 950 Backers  - Werewolf Frankenstein #1 (LOCKED 🔒)\nEvery campaign, we host an Early Bird Giveaway for backers who support our projects within their first 48 hours. It's our way of saying thank you for supporting the Kickstarter during its most critical time.\nThis time, we're giving away the EXXXOTICA Exclusive Witches of Oz #1 variant cover featuring art by Xongbros.\nCongrats to the winner of this giveaway: Backer #125 Matteo!",
        "url": "https://www.kickstarter.com/projects/comicuno/beastsnow3/posts/4330872",
        "likes_count": 33,
        "comments_count": 0,
        "comments": []
      }
    ]
  }
}