{
  "url": "https://www.kickstarter.com/projects/tomberarducci/blnkr-a-diy-self-contained-led-strip-control-unit",
  "updates": {
    "count": 2,
    "content": [
      {
        "update_number": "UPDATE #2",
        "title": "Holy Dramatic Backlighting For Lego Plants, Batman! We're Funded!",
        "creator": "Tom Berarducci - TNB Technologies, LLC\nFebruary 24, 2025",
        "date": "February 24, 2025",
        "content": "The plants that I, thankfully, am incapable of killing (plus BL!NKr's warm color palette in a theater-style animation)\nFirst off, I hope everyone had a great weekend. I cannot believe that we've already met our goal!! Thank you all again for your support :D\nNow that I know I'm funded, I can start preparing for my fulfillment process so I can get your rewards to you ASAP! Please help keep the momentum going to further exceed our goal by spreading the word about what we're doing - I'm excited to see how far this goes!\nI'll keep you all informed about my progress as we move forward and let you know what's happening every step of the way :)\nIf I can clarify anything, answer any questions, or showcase a specific feature you're interested in, I'd be happy to - please feel free to comment and discuss!\n-Sara",
        "url": "https://www.kickstarter.com/projects/tomberarducci/blnkr-a-diy-self-contained-led-strip-control-unit/posts/4321436",
        "likes_count": 1,
        "comments_count": 0,
        "comments": []
      },
      {
        "update_number": "UPDATE #1",
        "title": "Thank you so much for the incredible progress!",
        "creator": "Tom Berarducci - TNB Technologies, LLC\nFebruary 22, 2025",
        "date": "February 22, 2025",
        "content": "In the first 24 hours since BL!NKr's launch, we've come so far! I'm so grateful for all of your support! I hope we can keep this momentum going - please share out on social media and send it to others who might be interested!\nThank you all again! Have a wonderful rest of your day :)\n-Sara",
        "url": "https://www.kickstarter.com/projects/tomberarducci/blnkr-a-diy-self-contained-led-strip-control-unit/posts/4319975",
        "likes_count": 1,
        "comments_count": 0,
        "comments": []
      }
    ]
  }
}