{
  "url": "https://www.kickstarter.com/projects/chargie-laptops/chargie-preserve-your-laptops-battery-health",
  "campaign_details": {
    "funding_period_text": "Funding period\nNov 26 2024 - Jan 10 2025 (45 days)",
    "funding_start_date": "2024-11-26T10:22:57-05:00",
    "funding_end_date": "2025-01-10T10:22:57-05:00",
    "funding_duration_days": 45,
    "pledged_amount": "",
    "funding_goal": "$15,000",
    "backers_count": "1,757"
  },
  "updates": {
    "count": 3,
    "content": [
      {
        "update_number": "UPDATE #5",
        "title": "Chargie for Laptops March tech update - delivery timeline",
        "creator": "Ovidiu Sandru\nMarch 6, 2025",
        "date": "March 6, 2025",
        "content": "Dear Backer,\nOver the past month, we've refined everything that worked best so far. Now, all that's left is to improve the thermal efficiency of the device and thoroughly test it in various scenarios. The almost-100W device (93, to be more precise) is a completely different beast in what regards thermals. Every part has to be perfectly matched to this power level, otherwise mess starts to happen. I even considered limiting the thing to just 60W, but I'm taking the challenge of making it work as promised.\nThe new Chargie device will also support phones using high-quality, laptop-grade PD adapters capable of delivering 9V, 12V, 15V, and 20V. If your phone wants it (like the iPhone 16 Pro Max), but your adapter doesn't support one of these voltages, the device will automatically revert to 5V. For laptops, this isn't an issue, as most already use compatible power supplies that provide 15V or 20V. Keep in mind Chargie for Laptops was designed primarily for laptops, using it with phones is an extra wonderful perk for this Kickstarter campaign.\nAdditionally, original Apple or Samsung adapters are fully compatible and will seamlessly charge your phone through Chargie.\nYou'll also have the option to slow-charge your phone when you're not in a hurry (similar to the Chargie C Basic), or configure the app to automatically scale back charging to 5V/3A if the phone gets too hot (the current Chargie C Basic only cuts off power completely).\nBelow is the latest prototype actively running on my desk around the clock, closely monitored by an excellent PD analyzer from ST. Targeting April 10 for delivery start. There's so much to do on so many fronts, but I'm really excited about how it's turning out!\nHave a happy and sunny March! :) \nOvidiu.\nP.S. If you'd like more units, feel free to order - I've not closed the Late Pledge yet. I'm working hard to find an ultra-affordable shipping option for US and EU (around $2 or $3) and aim to offer free shipping for orders containing bulk packs. It's not final yet, but there's a high chance this will happen.",
        "url": "https://www.kickstarter.com/projects/chargie-laptops/chargie-preserve-your-laptops-battery-health/posts/4330505",
        "likes_count": 37,
        "comments_count": 4,
        "comments": [
          {
            "text": "I'm a late backer and have a few questions. I backed the Chargie for Laptops + Chargie C Basic for $69 and it added $10 shipping for US. In the above update, you say you are looking for an ultra affordable shipping charge of about $3. When I selected the laptop and basic, it says 1 item included and then shows the short charging cable and that says Quantity 2. I was unclear on whether the short cable was included, so I added one and it added an additional $10 shipping, so I removed it. Please confirm I will be getting one Chargie for laptop and one Chargie for phone, each with a short cable. The $10 shipping goes against what you say in this update, but it seems reasonable enough, just not another $10 for a tiny cable. I also have a question about the app. Do I have to use it? I simply want to set the charge limit and leave it. I don't need an app nor do I want one. I backed the Leo project which is similar and that turned out to be a big disappointment and took forever to get, so I hope you have a better product.",
            "commenter": "Laurel Burik",
            "timestamp": "March 10, 2025 3:55 AM AWST",
            "datetime": "1741550135",
            "relative_time": "5 days ago"
          },
          {
            "text": "thank you for providing this information. The $3 shipping is still a work in progress. Some warehouses should theoretically be able to do this, but that's still not confirmed. I'll check the double $10 taxation. Chargie won't take forever to get, we'll start production in a couple of weeks and will deliver soon after that.",
            "commenter": "Ovidiu Sandru",
            "timestamp": "March 10, 2025 12:18 PM AWST",
            "datetime": "1741580333",
            "relative_time": "4 days ago"
          },
          {
            "text": "We appreciate the update. Thanks!",
            "commenter": "Todd R Smith",
            "timestamp": "March 6, 2025 11:50 PM AWST",
            "datetime": "1741276246",
            "relative_time": "8 days ago"
          },
          {
            "text": "Thank you for the update",
            "commenter": "Ted Austin",
            "timestamp": "March 6, 2025 10:30 PM AWST",
            "datetime": "1741271407",
            "relative_time": "8 days ago"
          }
        ]
      },
      {
        "update_number": "UPDATE #3",
        "title": "Thank you for an incredible campaign!",
        "creator": "Ovidiu Sandru\nJanuary 10, 2025",
        "date": "January 10, 2025",
        "content": "Dear Backers,\nThank you for joining us on this incredible journey! Today marks the final day of our first Kickstarter project, and we couldn’t be more grateful for your support. Reaching $105K in backings has been no easy feat, and we are fully committed to honoring each of your pledges with the highest quality product.\nThroughout December, we've been tirelessly working to refine Chargie for Laptops. This includes improvements to the app, firmware, hardware, thermal efficiency, safety, ease of use, and cost. Balancing these advancements with marketing efforts has been challenging, as real-world testing takes time. Over the past month, we've prototyped multiple ideas in parallel, invested heavily in shipping fees, and conducted rigorous testing. Except for Christmas Day, there hasn’t been much of a break—but it’s all been worth it. \nAs a result, our delivery timeline has shifted by a couple of weeks to ensure we provide you with a complete and polished product. Here’s what we’ve learned along the way:\nSlower charging is better. Avoid charging at 100+ watts to significantly extend your battery's lifespan.\nMost charging sessions require only 30-60W. Maximum charging speeds are often unnecessary for laptops that remain plugged in most of the time.\nCycle your battery between 40-60%. This ensures maximum battery life and efficiency. Our scheduler will allow you to top it up when needed.\nIf you’d like to order additional Chargies or help us reach a milestone of $110K, now is the perfect time! Every extra contribution fuels more research and helps us develop even better products for you.\nWe’ll keep you updated with the exciting advancements we’re working on, one step at a time. Thank you for being a vital part of this journey.\nCheers,\nOvidiu",
        "url": "https://www.kickstarter.com/projects/chargie-laptops/chargie-preserve-your-laptops-battery-health/posts/4287585",
        "likes_count": 23,
        "comments_count": 6,
        "comments": [
          {
            "text": "Hello Ovidiu, My initials are DDH. I’m from DeKalb, IL., in the U.S. I’m a Backer of a ‘Chargie, Early Bird Double Pack (2pcs).’ Unfortunately, it has become too apparent that the acquisition of his & hers sets of ‘Optional add-ons’ are most necessary. Those being: (2) pair [total 4 cables] ‘Very Short 4” (10cm) USB-C cable; (1) set ‘the 4.5mm DELL male + DELL female barrel connector adapters’; and (1) set ‘the 7.4mm DELL male + DELL female barrel connector adapters.’ These items were totally and most sadly overlooked when pledging earlier. Shall we have ourselves a dialog on how to close on a purchase of these cables/adapters, to have them included with the Chargie(s)? Thanking you in advance, and good luck. Doug",
            "commenter": "Douglas Hendrickson",
            "timestamp": "February 6, 2025 7:24 AM AWST",
            "datetime": "1738797883",
            "relative_time": "about 1 month ago"
          },
          {
            "text": "Please tell me the range will be customisable. 40% to 60% is not the optimal range for modern batteries, so it's critical that it's possible to change that, otherwise the device is useless.",
            "commenter": "Craig",
            "timestamp": "January 10, 2025 11:30 PM AWST",
            "datetime": "1736523026",
            "relative_time": "2 months ago"
          },
          {
            "text": "You can use any range you want. Just set the limit at the desired charge limit (x) and the Allowed Charge Drop (c). The charge will bounce between x and x-c. MId-range is always better for any battery, produces less stress.",
            "commenter": "Ovidiu Sandru",
            "timestamp": "January 11, 2025 12:07 AM AWST",
            "datetime": "1736525274",
            "relative_time": "2 months ago"
          },
          {
            "text": "The research I've been able to find says that 25% to 85% is optimal for the battery life of modern lithium ion batteries. So knowing I'll be able to set it to something other than 30% to 60% is critical for the value of the product.",
            "commenter": "Craig",
            "timestamp": "January 23, 2025 9:15 PM AWST",
            "datetime": "1737638152",
            "relative_time": "about 2 months ago"
          },
          {
            "text": "hello Ovidiu and good luck. I'm a backer, and wish to buy an additional pledge. is it possible?",
            "commenter": "Alex Bodnaru",
            "timestamp": "January 10, 2025 8:47 PM AWST",
            "datetime": "1736513231",
            "relative_time": "2 months ago"
          },
          {
            "text": "Thanks for the clear update! Can't wait to test these!",
            "commenter": "Yves Van Cleven",
            "timestamp": "January 10, 2025 6:21 PM AWST",
            "datetime": "1736504488",
            "relative_time": "2 months ago"
          }
        ]
      },
      {
        "update_number": "UPDATE #2",
        "title": "Chargie for Laptops is now fully funded!",
        "creator": "Ovidiu Sandru\nNovember 28, 2024",
        "date": "November 28, 2024",
        "content": "We did it, folks!\nChargie has reached its $15k goal! It is going to get funded thanks to each of you!\nShare this project with your social media friends and followers and let's take it to the next level!\n$50k is the next stretch goal! I have big plans with this little device and I am going to share them as things progress. \nOne day, Chargie might become a self-regulating system with the charging experience of the whole network. You'll be able to share your charging habits with the network and it will predict the level of degradation after X months of usage. But that takes development money and time, which is why I resorted to crowdfunding.\nBe a part of huge CO2 and resource savings and have the huge satisfaction of a job well done! Tell your friends about our mission!\nhttps://www.kickstarter.com/projects/chargie-laptops/chargie-preserve-your-laptops-battery-health/\nHappy Thanksgiving!\nOvidiu",
        "url": "https://www.kickstarter.com/projects/chargie-laptops/chargie-preserve-your-laptops-battery-health/posts/4263137",
        "likes_count": 6,
        "comments_count": 0,
        "comments": []
      }
    ]
  }
}