{
  "url": "https://www.kickstarter.com/projects/1062523922/chargeultra-gen-2-360-rotating-3-in-1-wireless-charger",
  "campaign_details": {
    "funding_period_text": "Funding period\nFeb 21 2025 - Mar 14 2025 (21 days)",
    "funding_start_date": "2025-02-21T01:36:28-05:00",
    "funding_end_date": "2025-03-14T01:36:28-04:00",
    "funding_duration_days": 21,
    "pledged_amount": "HK$ 181,809",
    "funding_goal": "HK$ 5,000",
    "backers_count": "337",
    "days_left": 19
  },
  "updates": {
    "count": 2,
    "content": [
      {
        "update_number": "UPDATE #2",
        "title": "🎉 Thank You for Your Support! ChargeUltra Kickstarter Campaign a Huge Success! 🎉",
        "creator": "ChargeUltra\nMarch 14, 2025",
        "date": "March 14, 2025",
        "content": "Hi Guys,\nWe’re thrilled to announce that the ChargeUltra Kickstarter campaign has been a complete success! Your enthusiasm and support have made this project a reality, and we couldn't be more grateful.\n🔧 Production & Next Steps\nOur production plan is already in motion, and our team is working diligently to stay on schedule. We will provide regular updates to keep you informed about our progress every step of the way.\n💳 Important: Payment Processing\nKickstarter is currently processing payments, and in some cases, payment issues may arise due to insufficient balances or other errors. To avoid missing out on your rewards, please update your payment method as soon as possible.\nYou can click on this link to see how to change your payment method: https://help.kickstarter.com/hc/en-us/articles/115005132933-How-can-I-change-my-payment-method-before-funding-ends\n📦 PledgeBox Survey & Shipping Information\nOnce payments are processed(10 working days), we will send out the PledgeBox survey via email to collect your shipping details. We appreciate your patience and will begin shipping as soon as possible.\n\n📩 Need Help? Contact Us!\nYour feedback is invaluable to us! If you have any questions, thoughts, or concerns, feel free to reach out:\n📧 Email: Charge-Ultra@outlook.com\nSincerely,\nChargeUltra Team",
        "url": "https://www.kickstarter.com/projects/1062523922/chargeultra-gen-2-360-rotating-3-in-1-wireless-charger/posts/4336908",
        "likes_count": 5,
        "comments_count": 0,
        "comments": []
      },
      {
        "update_number": "UPDATE #1",
        "title": "ChargeUltra Gen 2 Latest Kickstarter Campaign is now LIVE!🎉",
        "creator": "ChargeUltra\nFebruary 24, 2025",
        "date": "February 24, 2025",
        "content": "Dear backers,\nExciting news! ChargeUltra Gen2 is officially launched, bringing you an unprecedented charging experience!\nThis brand-new version has achieved a full-scale performance leap, especially a major breakthrough in the charging stability of AirPods. Over the years, the heat dissipation problem in wireless charging has been a tough nut to crack in the industry. However, we have successfully overcome it with our outstanding technological innovation. By optimizing the heat dissipation management during the charging process, we have not only significantly enhanced the charging stability but also accelerated the charging speed, enabling your AirPods to charge more steadily and quickly.\nWe are always committed to creating the highest - quality products for you, and your support and feedback are our greatest driving force. Whether you encounter any problems during use, have unique suggestions, or are not entirely satisfied with certain aspects of the product, please feel free to let us know without reservation. Every piece of your feedback is extremely precious to us. We will definitely take it seriously, respond promptly, and do our best to meet your expectations.\nIf you have any novel ideas or functional requirements for ChargeUltra Gen2 or other products in our product line, you are welcome to communicate with us at any time. Our professional production team is looking forward to turning your creative ideas into tangible products.\n\nAt this moment, let's work hand in hand, break through the boundaries of innovation, and explore more possibilities together!\nOnce again, we sincerely thank you for your continuous companionship and firm support!\nChargeUltra Team",
        "url": "https://www.kickstarter.com/projects/1062523922/chargeultra-gen-2-360-rotating-3-in-1-wireless-charger/posts/4321454",
        "likes_count": 1,
        "comments_count": 0,
        "comments": []
      }
    ]
  }
}