{
  "url": "https://www.kickstarter.com/projects/cometdrive/comet-thunderbolt-5-portable-ssd-drive",
  "campaign_details": {
    "funding_period_text": "Funding period\nFeb 1 2025 - Mar 3 2025 (30 days)",
    "funding_start_date": "2025-02-01T06:03:33-05:00",
    "funding_end_date": "2025-03-03T06:03:33-05:00",
    "funding_duration_days": 30,
    "pledged_amount": "",
    "funding_goal": "HK$ 24,000",
    "backers_count": "621"
  },
  "updates": {
    "count": 4,
    "content": [
      {
        "update_number": "UPDATE #4",
        "title": "Second Stretch Goal Unlocked",
        "creator": "Comet\nFebruary 25, 2025",
        "date": "February 25, 2025",
        "content": "Dear Comet Backers, \nWe're excited to announce that we've reached our second stretch goal of $100,00! This means every backer will receive a free protective pouch with their Comet TB5 SSD.\nThe protective pouch is for keeping your Comet TB5 SSD safe during transport and daily use. Made with durable materials, it offers excellent protection against scratches and minor impacts while maintaining a slim profile that won't add bulk to your gear bag. \nWith this milestone achieved, we're now pushing toward our next stretch goal of $150,000 which will unlock three premium color variants: Red + Black Top, Titanium + Silver Top, and the all-Titanium edition. \nThank you for your incredible support in helping us reach this milestone. We're grateful for your trust and enthusiasm in the Comet TB5 SSD project. \nBest regards, \nThe Comet Team",
        "url": "https://www.kickstarter.com/projects/cometdrive/comet-thunderbolt-5-portable-ssd-drive/posts/4322307",
        "likes_count": 3,
        "comments_count": 0,
        "comments": []
      },
      {
        "update_number": "UPDATE #3",
        "title": "First Stretch Goal Unlocked and New Add-on",
        "creator": "Comet\nFebruary 18, 2025",
        "date": "February 18, 2025",
        "content": "Dear Comet Backers,\nWe're thrilled to announce that we've reached our first stretch goal of $50,000! Thanks to your incredible support, we can now offer two additional color combinations for the Comet TB5 SSD: Black + Silver Top and Black + Black Top.\nThese new color options will be available to all backers during the post-campaign survey, where you'll be able to select your preferred color combination. The original Black + Titanium Top remains available as well.\nWith this milestone achieved, we're now setting our sights on our next stretch goal: the free protective pouch at $100,000. We're excited to see what we can accomplish together!\nAt this time we are also releasing a new add-on: a phone case for iPhones (15Pro, 15Pro Max, 16Pro, 16Pro Max). This phone case will help you keep the Comet TB5 SSD in place while you shoot videos in up to 4K/120fps ProRes with zero frame drops. The new add-on will be available at US$29 and it includes the phone case an USB C to C connector. This makes Comet TB5 SSD the perfect companion for mobile filmmaking. \nThank you for your continued support and enthusiasm,\nThe Comet Team",
        "url": "https://www.kickstarter.com/projects/cometdrive/comet-thunderbolt-5-portable-ssd-drive/posts/4316873",
        "likes_count": 3,
        "comments_count": 0,
        "comments": []
      },
      {
        "update_number": "UPDATE #2",
        "title": "Introducing Stretch Goals!",
        "creator": "Comet\nFebruary 10, 2025",
        "date": "February 10, 2025",
        "content": "Dear Comet Backers,\nWe're excited to announce our stretch goals for the Comet TB5 SSD campaign! Your incredible support has motivated us to offer even more value and options for all our backers.\nHere's what we have planned:\nAt $50,000, we'll introduce two stunning new color combinations: Black + Silver Top and Black + Black Top. These sleek options will complement our original Titanium + Black Top design perfectly.\nWhen we reach $100,000, every backer will receive a free protective pouch with their Comet TB5 SSD, ensuring your device stays safe and pristine wherever you go.\nFinally, at $150,000, we'll unlock three premium variants: Red + Black Top, Titanium + Silver Top, and the ultimate all-Titanium edition.\nEach stretch goal represents our commitment to delivering more value while maintaining the exceptional quality you expect from Comet. We can't wait to unlock these goals together!\nThank you for your continued support,\nThe Comet Team",
        "url": "https://www.kickstarter.com/projects/cometdrive/comet-thunderbolt-5-portable-ssd-drive/posts/4310661",
        "likes_count": 3,
        "comments_count": 1,
        "comments": [
          {
            "text": "How bout a free longer cable choice?",
            "commenter": "Andro",
            "timestamp": "February 14, 2025 10:33 PM AWST",
            "datetime": "1739543623",
            "relative_time": "27 days ago"
          }
        ]
      },
      {
        "update_number": "UPDATE #1",
        "title": "Funded in 1 Hour!",
        "creator": "Comet\nFebruary 3, 2025",
        "date": "February 3, 2025",
        "content": "Dear Comet Backers,\nWe are absolutely thrilled to announce that Comet reached its funding goal in just one hour after launch!\nThis incredible milestone demonstrates the amazing support and enthusiasm from all of you. This rapid success not only validates our concept but also energizes our team to deliver an exceptional product that will exceed your expectations. \nAs we continue this journey, we'll keep you updated on our progress and the exciting stretch goals we have planned. Each one of you who backed us at this stage has played a crucial role in making Comet a reality. \nStay tuned for more updates as we work diligently to bring Comet to life!\nWith gratitude,\nThe Comet Team",
        "url": "https://www.kickstarter.com/projects/cometdrive/comet-thunderbolt-5-portable-ssd-drive/posts/4305447",
        "likes_count": 2,
        "comments_count": 0,
        "comments": []
      }
    ]
  }
}