{
  "url": "https://www.kickstarter.com/projects/claudiearseneault/common-bonds-2",
  "updates": {
    "count": 2,
    "content": [
      {
        "update_number": "UPDATE #2",
        "title": "$8000 and a little Common Bonds history",
        "creator": "Claudie Arseneault\nFebruary 21, 2025",
        "date": "February 21, 2025",
        "content": "Here we are, flying over the $8000 mark on the fifth day of our campaign, and I wanted to talk about it a little! First of all, thank you!! What an incredible amount to have achieved already. I’ve celebrated every 1000 mark since this started, but $8000 is particularly significant to me, and to this project. \nWhen we launched a Kickstarter for Common Bonds 1, $8000 was our goal. In 2019, $8000 was the minimum we needed to make the first aromantic anthology a reality. We were four authors with limited reputation and had no idea what was possible.\nAs with Common Bonds 2, we started our campaign during Aro Week, which also was on February 16. We funded on March 22, 2019. It had taken us over a month to gather what we achieved today, in 5 days. This is how far we’ve come! \"We\", the editors behind the anthology, in reputation and skill and reach, but more importantly \"We\", the community willing to support bold queer indie projects with our money and enthusiasm. \nIf we were running on Common Bonds 1 goals, we would already be funded. In 2019, we managed to gather $10,000 -- funding our first stretch goal, to pay our writers 6¢ / words. The Common Bonds 2 goal was set with 6¢ / words as our base pay. Five years later, it felt unthinkable to give writers less for their work. They are the heart of the anthology, and our top priority (which is why you will note our first stretch goal is go move up to 8¢ / words).\nSo let's get them paid, shall we? Onward to $11,000!",
        "url": "https://www.kickstarter.com/projects/claudiearseneault/common-bonds-2/posts/4319473",
        "likes_count": 7,
        "comments_count": 0,
        "comments": []
      },
      {
        "update_number": "UPDATE #1",
        "title": "Five Thousands and Still Counting",
        "creator": "Claudie Arseneault\nFebruary 18, 2025",
        "date": "February 18, 2025",
        "content": "I am sitting at my desk and staring at the $5,400 on my dashboard, and I cannot help but remember how stressed I was that we were not going to fund this anthology. We’re not there yet, but it seems almost silly now, a handful of backers away from the 50% mark.\nYesterday I went to bed with 40% of Common Bonds 2 funded, from the pledges of 121 people. I was bewildered and thrilled and touched. This is a lot—of money, of trust, of enthusiasm and love and commitment! The entire team has been very professionally ™ screaming about it, I promise.\nBut we’re just getting started. We have 21 more days to go, and I, for one, am eager to see how far we can raise this total. It’s a beautiful Aro Week, and we are eager to pay human writers to make gorgeous art.",
        "url": "https://www.kickstarter.com/projects/claudiearseneault/common-bonds-2/posts/4316266",
        "likes_count": 5,
        "comments_count": 0,
        "comments": []
      }
    ]
  }
}