{
  "url": "https://www.kickstarter.com/projects/ghostfiregaming/companion-quest",
  "campaign_details": {
    "pledged_amount": "S$ 73,814",
    "funding_goal": "S$ 13,377",
    "backers_count": "960",
    "days_left": 59
  },
  "updates": {
    "count": 9,
    "content": [
      {
        "update_number": "UPDATE #11",
        "title": "Production Progress & Timeline",
        "creator": "Ghostfire Gaming\nMarch 26, 2025",
        "date": "March 26, 2025",
        "content": "Welcome adventurers, in this update you’ll find: \n\n- An Update on the Game's Production Progress & Timeline\n- Gnome Background #5\n\nProduction Progress & Timeline\nThe team is hard at work to get Companion Quest in your hands. Here's the roadmap to get there:\n\nMarch - May\n- Game development concludes. \n- Editing and proofreading. \n- Final pieces of art are complete.\n- Final files are with our manufacturer.\n\nJune - August\n- Work with our manufacturer to review and approve files and mass production prototypes. \n\nSeptember - December\n- Mass production underway.\n- Fulfillment commences.\n\nRest assured we'll keep you updated with our progress along the way :)\nMumbles is the oldest gnome in the family, and by far the most powerful. His wisdom and magical abilities possibly rival Gu’Gu’s, but his mind is so full of wonder that it has begun to blur. When he begins to murmur a spell, any intelligent creature should start to run; not even Mumbles knows what’s about to happen! Melody, an ancient moon dragon, has decided to watch over him and calm his mind with her song. His cap doubles as a hearing horn, which he needs to hear the melody. They’ll help Stibbles and the team catch up to Gu’Gu, but Mumbles might not know why he’s even here.\nMelody\nMumbles\nThe Ghostfire Gaming Team",
        "url": "https://www.kickstarter.com/projects/ghostfiregaming/companion-quest/posts/4346120",
        "likes_count": 7,
        "comments_count": 0,
        "comments": []
      },
      {
        "update_number": "UPDATE #10",
        "title": "Development Progress & Timeline",
        "creator": "Ghostfire Gaming\nMarch 24, 2025",
        "date": "March 24, 2025",
        "content": "Welcome adventurers, in this update you’ll find: \n\n- An Update on the Game's Development & Timeline\n- Portal Problem Puzzle #4\n\nDevelopment Progress & Timeline\n\nOver the last couple of months we've been busy refining Companion Quest. As we mentioned in our last update, we sent out over 50 copies of the game and many people that covered it were kind enough to send us feedback or share their critical thoughts via a review. This is in addition to the many playtests we conducted. Here's what we've been working on these last few months:\n\nGame Difficulty\nThe number one piece of feedback we received from players was that the game is quite challenging. This was sometimes positive or negative depending on the player. We decided to leave the \"normal difficulty\" unchanged but have since been focused on providing streamlined rulesets for Easy and Hard modes so that players can customize the experience to their preferred difficulty. \n\nGame Balance \nA trend we noticed amongst playthroughs and from playtester feedback was that the game was harder at lower player counts and easier and higher player counts. We have made several small tweaks to the game to balance the difficulty of the game so that the game provides a similar challenge regardless of player count.\n\nFine Tuning Companion & Gnome Effects\nEnsuring that the effects players can activate are fun! Whilst we want a balanced game, we also want one that is focused on fun so that players can pull off crazy combos and create memorable moments! We reviewed all abilities and made sure they were balanced but still kept their fun factor!\n\nGame development is set to conclude at the end of March, in just one weeks time. With our commitment of having Companion Quest in your hands by this December, we're keeping up the pace to ensure we meet this commitment. More on the production timeline in the next update!\n\nPortal Problem Puzzle #4: One Big Problem - Easy\nIn One Big Problem, you have a lot of dice showing #1 - go figure! This presents a problem, Unstable Portal says that is cannot have dice of the same number placed on it. Ensure you use your companions wisely to manipulate the dice and overcome this problem!\nOne Big Problem - Easy\nIf you would like to try to solve this puzzle, you can find it setup in Tabletop Simulator to try right now! Please let us know how you went in the comments section. \n\nIf you want to see an example of how to complete this puzzle or you're having trouble solving it, watch the video below to see one of the possible solutions to this puzzle.\n\n\nThe Ghostfire Gaming Team",
        "url": "https://www.kickstarter.com/projects/ghostfiregaming/companion-quest/posts/4344113",
        "likes_count": 15,
        "comments_count": 0,
        "comments": []
      },
      {
        "update_number": "UPDATE #9",
        "title": "What the other Gnomes are Saying",
        "creator": "Ghostfire Gaming\nMarch 21, 2025",
        "date": "March 21, 2025",
        "content": "Welcome adventurers, in this update you’ll find: \n\n- Initial Impressions & Reviews\n- Gnome Background #4 - Rabbles\n\nInitial Impressions & Reviews\nWe'd like to take the time to share with you what others have been saying about Companion Quest. In the lead up to the Kickstarter launch, we sent out roughly 50 pre-production copies of Companion Quest  to content creators. Here's what they thought...\n\nAll For One Games\nhttps://www.instagram.com/p/DFadtvrsegA/?img_index=1 \n\"Highlights so far:\n📖 2 minute teach\n👯 1-4 players\n🧩 Adjustable difficulty for all skill levels\n🎲 Beautiful dice with fun tableau building and combos!\n🥰 Adorable companions with powerful abilities\"\n\nPositively Board\nhttps://www.instagram.com/positively.board/p/DGWFWVMoRy4/?img_index=1 \n“Component-wise, all is excellent. Fantastic art style, lovely big Quest and Problem cards (the latter are amazing to look at). The dice are vibrant, and choosing the ones to play is a bit like visiting a sweet shop.”\n\n“This one’s a keeper. I’ve enjoyed the surprisingly tough challenge because the mechanics are spot on. If you love dice management games, you simply can’t miss this. I suspect this will make big waves in 2025…”\n\n“Verdict: Excellent”\n\nWhat Board Game - Jim Gamer\nhttps://www.whatboardgame.com/post/companion-quest-board-game-preview\n“This is an addictive game.”\n\n“The art is gorgeous, the production quality is right up there, and the rules are simple. The process you go through as you place the dice, complete the card challenges, and slowly make your way to victory is incredibly addictive.”\n\n“The engine building part of the game is a hidden gem within the mechanics you may not first spot in the rules, but as the game goes on and you get better, it quickly becomes the most satisfying part.”\n\n“As you start to get the hang of the strategy for this game and winning becomes a little more common, you can very easily ramp up the difficulty. This desire to win is what is making me come back to the game time and time again. The losses are always close, and you feel fully in control of your own destiny. So the losses are down to your own bad choices, and you want to get better so you make better ones next time!”\n\nLeige of Games \n4 Unexpectedly Awesome Board Games You Shouldn’t Ignore! \n\"It's freaking clever and it freaking works, it's really good.\"\n\n\"It's still going to be challenging enough that you can play it with your gamer group.\"\n\n\"This one easily exceeded expectations.\"\n\nWhere There’s a Wilz, There’s a Play\n[KICKSTARTER PREVIEW]-Companion Quest-Initial Impressions \n“Even for a prototype, this is really well done. This right now is as good as some final copies of games that we own.”\n\n“When you look at each one of the individual components,  the Problems, Companion deck, Gnomes, and Quests, each one of those alone has a wide bit of variability. So you put all of those together and the replay-ability is great in this.”\n\n“I like the communication you have to have… You do have to work together to get through everything that you need to do.”\n\nMerry Married Meeples\nCompanion Quest Preview - Work Together To Bring Peace To Our Gnome\n“There's quite a bit of depth to the decisions you have to make, and how you have to balance and manage things.”\n\n“There’s a lot of wonderful touches I’ve already seen in this prototype version that makes me excited for what they’re going to do in the final version.”\n\n“If you are looking for a game that has fun artwork, that has really fun tense decisions in a coop, that everyone can really work together and optimize what they’re doing then this is going to be it for you.”\n  Rabbles considers herself the proud leader of the McScooples family, although most of her siblings are very bad at listening to orders. She was once a chivalrous knight who served an influential noble family, but Rabbles grew tired of fighting for other people, and eventually retired from her job to live quietly in the woods. While gathering berries one day, she came across an injured Pygmy Owlbear and nursed him back to health. Now along with Runt, she will have to step back onto the path of danger to help save her family and the world, like she’s done a hundred times before.\nRunt\nRabbles\nThe Ghostfire Gaming Team",
        "url": "https://www.kickstarter.com/projects/ghostfiregaming/companion-quest/posts/4342204",
        "likes_count": 9,
        "comments_count": 2,
        "comments": [
          {
            "text": "Let's hope for the late push for that $60,000 to happen. I'm curious about the puzzle book. I think my dreams of that second new gnome are dashed.",
            "commenter": "Ian Wilz",
            "timestamp": "March 21, 2025 10:47 PM AWST",
            "datetime": "1742568432",
            "relative_time": "5 days ago"
          },
          {
            "text": "There may still be some surprises in store, Ian!",
            "commenter": "Ghostfire Gaming",
            "timestamp": "March 24, 2025 8:17 AM AWST",
            "datetime": "1742775469",
            "relative_time": "3 days ago"
          }
        ]
      },
      {
        "update_number": "UPDATE #8",
        "title": "Expansion Deep Dive",
        "creator": "Ghostfire Gaming\nMarch 19, 2025",
        "date": "March 19, 2025",
        "content": "Welcome adventurers, in this update you’ll find: \n\n- An Expansion Deep Dive\n- Portal Problem Puzzle #3\n\nExpansion Deep Dive\nThe Wild Expansion - In this expansion, you may find a Wild die! This die is capable of being used as any other color, making it a powerful resource. However, in order to find the wild die you will need to find a Wild Card or tame a Wild Companion!\n\nThe Legendary Expansion - In this expansion, you may find and tame Legendary Companions. These companions are particularly useful not only because of their unique and powerful abilities but they also ready up when you place a certain number instead of color. Which allows you to potentially ready up two Companions with one die placement. \n\nFor example, I place a yellow #5 die, I have a Legendary Companion that readies up when a #5 die is placed and a regular Companion that readies up when a yellow die is placed. Therefore, you can ready up two Companions with one die placement. \nRegular Companions that have the ability to turn dice to a certain number compliment Legendary Companions very well!\n\nPortal Problem Puzzle #3: Pesky Problems - Medium\nIn Pesky Problems, you can deduce which dice must be placed on which danger card due to the color restrictions they have. The difficulty of this puzzle is getting the dice numbers high enough to meet or exceed the dangers health totals and defeat them. You must place your dice in the right order to take out the dangers.  \nPesky Problems - Medium\nIf you would like to try to solve this puzzle, you can find it setup in Tabletop Simulator to try right now! Please let us know how you went in the comments section. \n\nIf you want to see an example of how to complete this puzzle or you're having trouble solving it, watch the video below to see one of the possible solutions to this puzzle.\n\n\nThe Ghosfire Gaming Team",
        "url": "https://www.kickstarter.com/projects/ghostfiregaming/companion-quest/posts/4340559",
        "likes_count": 17,
        "comments_count": 2,
        "comments": [
          {
            "text": "I enjoy the puzzles. Thanks for the updates!",
            "commenter": "Javan",
            "timestamp": "March 19, 2025 9:24 PM AWST",
            "datetime": "1742390699",
            "relative_time": "7 days ago"
          },
          {
            "text": "Thanks Javan, I'm glad you're enjoying them!",
            "commenter": "Ghostfire Gaming",
            "timestamp": "March 20, 2025 8:48 AM AWST",
            "datetime": "1742431734",
            "relative_time": "7 days ago"
          }
        ]
      },
      {
        "update_number": "UPDATE #7",
        "title": "Component Showcase & New Stretch Goal Unlocked!",
        "creator": "Ghostfire Gaming\nMarch 17, 2025",
        "date": "March 17, 2025",
        "content": "Welcome adventurers, in this update you’ll find: \n\n- A Component Showcase\n- A Newly Unlocked Stretch Goal \n- Gnome Background #3 - Crumbles\n\nComponent Showcase\nWe'd like to share with you a short video we put together showcasing the game in action with plenty of close up shots of the components throughout.\nLeading us perfectly into our next topic... a component upgrade has been unlocked!\n\nNew Stretch Goal Unlocked!\n\nWe're happy to share with you that Companion Quest will now come with screen printing on the Gnome, Gnome Hat, and Gu'Gu meeples!\nGnome Background #3 - Crumbles\nCrumbles is the youngest gnome of the bunch, and has a sweet tooth that living in the Candy Kingdom can satisfy. As a baker, chef and alchemist she’s got a lot of passion for cooking… and almost no experience. She can whip up just about any dish or potion you can think of, but often mixes up the ingredients. Bubbles and Gribbles have suffered months worth of tummy aches as her taste testers. Luckily, her magical mug Prost can help change the flavors and keep the dishes clean. Crumbles is more than happy to join the quest and explore new foods all over the world!\n\n\nThe Ghostfire Gaming Team",
        "url": "https://www.kickstarter.com/projects/ghostfiregaming/companion-quest/posts/4338642",
        "likes_count": 13,
        "comments_count": 0,
        "comments": []
      },
      {
        "update_number": "UPDATE #6",
        "title": "Art Showcase!",
        "creator": "Ghostfire Gaming\nMarch 14, 2025",
        "date": "March 14, 2025",
        "content": "Welcome adventurers, in this update you’ll find: \n\n- An Art Showcase \n- Portal Problem Puzzle #2\n\nArt Showcase\nWith so many amazing pieces of art in this game, made by extremely talented artists, we would like to take the time to showcase their work! \nPlayer Mat #1 by Rodrigo Camilo\nPlayer Mat #2 by Rodrigo Camilo\nPlayer Mat #3 by Rodrigo Camilo\nPlayer Mat #4 by Rodrigo Camilo\nQuest Card - Odd Oasis by Angga Dwipayana\nChallenge Card - A Mountainous Decision by Wiktor Paluch\nDanger Card - Heavily Armored Mouse by Pauliina Linjama\nGnome Card - Mumbles by Rodrigo Camilo\nCompanion Card - Lopsy by Cynthia F.G.\nPortal Problem #2: Flitter of Hope - Easy\nIn a Flitter of Hope you only have one companion to help you solve this puzzle! Use your yellow dice wisely to ready up Flitterbell when you need its +3 ability! \nA Flitter of Hope - Easy\nIf you would like to try to solve this puzzle, you can find it setup in Tabletop Simulator to try right now! Please let us know how you went in the comments section. \n\nIf you want to see an example of how to complete this puzzle or you're having trouble solving it, watch the video below to see one of the possible solutions to this puzzle.\n- The Ghostfire Gaming Team",
        "url": "https://www.kickstarter.com/projects/ghostfiregaming/companion-quest/posts/4336748",
        "likes_count": 9,
        "comments_count": 0,
        "comments": []
      },
      {
        "update_number": "UPDATE #5",
        "title": "Replayability & Solo Play",
        "creator": "Ghostfire Gaming\nMarch 12, 2025",
        "date": "March 12, 2025",
        "content": "Welcome adventurers, in this update you’ll find: \n\n- A Replayability Deep Dive\n- Rules for Solo Play\n- Gnome Background #2 - Bubbles\n\nReplayability Deep Dive\nCompanion Quest comes with a ton of cards! More than you will use in each game, which allows each playthrough to feel exciting and different each time you play. Outlined below are some of the highlights from a replayability stand point. \n \n- 57 Starting & Wild Companion Cards, 5-20 used per game depending on player count.\n48 of the 57 Companions cards have unique abilities, there are not many duplicate abilities in the deck, making it exciting to discover new companions and the strategies they allow.\n\n- 28 Portal Problem Cards. (20 Challenges, 10 used per game. 8 Dangers, 2 used per game)\nAll unique cards with varied dice requirements requirements and dice placement rules modifier.\n\n- 12 Quest Cards, 4 used per game.\nEach quest has a unique game changing rules modifier, dice requirements and detailed art.\n\n- 7 Gnome Cards, 1-4 used per game depending on player count.\nEach come with a unique, once per game ability and unique starting companion.\n\nIn addition to the cards that come in the game, Companion Quest will come with an easy and hard setting so you can customize the experience depending on who you're playing with or the level of challenge you want. \n \n\nRules for Solo Play\nBelow you'll find an excerpt from the rulebook outlining how to play Companion Quest solo.\nTo summarize, you gain 1 additional snack token, can use your gnome ability on yourself, and keep one unused die to carry over to your next turn! As well as gaining some extra rewards along the way too! It's that easy! \nBubbles stands tall over his siblings, which isn’t saying much since they’re all gnomes. But don’t let his height or strength confuse you, Bubbles is the softest and most caring member of the family. He ventured far from home, where he first found his faithful pup Arlo abandoned in the streets of Evensville. Missing his family, Bubbles created an orphanage to share a new one with lost children. He uses a trusty hammer called scoops, crafted from a large mug, that lets him bash evil and scoop friends out of danger. With Arlo’s wings and Bubbles’ brawn, there isn’t anything they can’t overcome!\nBubbles\nArlo\n- The Ghostfire Gaming Team",
        "url": "https://www.kickstarter.com/projects/ghostfiregaming/companion-quest/posts/4334111",
        "likes_count": 12,
        "comments_count": 0,
        "comments": []
      },
      {
        "update_number": "UPDATE #4",
        "title": "Gameplay Spotlight",
        "creator": "Ghostfire Gaming\nMarch 10, 2025",
        "date": "March 10, 2025",
        "content": "Welcome adventurers, in this update you’ll find: \n\n- A Gameplay Spotlight\n- Portal Problem Puzzle #1\n- Tabletop Simulator Instructions\nGameplay Spotlight\nWe would like to share with you some examples from the draft version of the rulebook about how Companion Quest plays. Below you will find an example turn about some of the choices you can make during play. \nWhile this example turn shows the basics of how a turn could play out, one of the most fun and exciting aspects of Companion Quest is Resting Companions (to use their ability) and having them Ready Up (so their abilities can be used again). \n\nAs seen in the example below when you place a die onto any Quest or Portal Problem card you Ready Up a Companion with a matching color, if you have any. You can begin to combo multiple uses of your Companions on a single turn as they change your rolls to the results you need!\nIf you would like to learn more about how the game plays, please check out this amazing How to Play video from A Dicey Review.\nPortal Problem Puzzle #1: Contraption Distraction - Easy\nIntroducing..... Portal Problem Puzzles, these mini games are a great way to learn Companion Quest, and solve small challenging puzzles using components found in the core game. \nContraption Distraction - Easy\nYour task is to complete Pressure Plates and Malfunctioning Machine using the dice shown above with Mumbles the gnome, and Snaps and Luna the companions helping you along the way. \n\nIf you would like to try and solve this puzzle, you can find it setup in Tabletop Simulator to try right now! Please let us know how you went in the comments section. \n\nIf you want to see an example of how to complete this puzzle or you're having trouble solving it, watch the video below to see one of the possible solutions to this puzzle.\nTabletop Simulator Instructions\nTo try the Portal Problem Puzzle or play Companion Quest digitally, please follow the instructions below:\n\n1. Click on this link: https://steamcommunity.com/sharedfiles/filedetails/?id=3025474584\n2. Press the green \"Subscribe\" button.\n3. Open your Steam program.\n4. Launch Tabletop Simulator.\n5. Press \"Create\" then \"Singleplayer\" (if you're playing solo) OR \"Multiplayer\" (if you're playing with others)\n6. Press \"Companion Quest\" next to the \"Workshop\" icon then \"Load\".\n7. Enjoy playing Companion Quest!\n\nThat's all from us today, happy puzzling! \n\n- The Ghostfire Gaming Team",
        "url": "https://www.kickstarter.com/projects/ghostfiregaming/companion-quest/posts/4333054",
        "likes_count": 10,
        "comments_count": 2,
        "comments": [
          {
            "text": "The ability for Mumbles states \"Allow another gnome to change a die to any number\", but he used it on himself for the solution. I assume that was done for the sake of the puzzle, otherwise the wording of the ability should be adjusted to specify it can be used for himself also.",
            "commenter": "Troy Prendergast",
            "timestamp": "March 10, 2025 7:07 PM AWST",
            "datetime": "1741604851",
            "relative_time": "16 days ago"
          },
          {
            "text": "Hi Troy, you are correct. This is part of the solo rules for the game, a gnome ability may be used on themself if they are the only gnome. In a multiplayer game it must be used on another gnome.",
            "commenter": "Ghostfire Gaming",
            "timestamp": "March 11, 2025 10:49 AM AWST",
            "datetime": "1741661361",
            "relative_time": "16 days ago"
          }
        ]
      },
      {
        "update_number": "UPDATE #3",
        "title": "What’s In Store",
        "creator": "Ghostfire Gaming\nMarch 7, 2025",
        "date": "March 7, 2025",
        "content": "Welcome adventurers, in this update you’ll find:\n- The Update Schedule\n- Components & Color Limited Vision Information\n- Meet the Gnomes - Stibbles\nThe Update Schedule\nWe would like to share with you the planned updates we have coming up during the campaign. For those of you interested in learning more about the different aspects of the game, we've got you covered!\n\nUpdate 3 - Gameplay Deep Dive\nUpdate 4 - Replayability & Solo Play\nUpdate 5 - Art Showcase\nUpdate 6 - Component Showcase\nUpdate 7 - Expansions Deep Dive\nUpdate 8 - What the Gnomes are Saying\nUpdate 9 - Development Progress & Timeline\nUpdate 10 - Production Progress & Timeline\nComponents & Color Limited Vision Information\nWe would like to take some time to ensure anyone who has color limited vision, that this game will be fully accessible to you. With so many colored components and icons, we’re paying close attention to this aspect of the game and making sure Companion Quest is accessible to all players. We are actively working with individuals that have color limited vision to ensure that the final game is accessible to them.\nPlease note that the prototype copies you’ve seen on Youtube videos are all pre-production and the dice colors and icons are not reflective of the exact colors that will be used in the final version of the game. In particular, we are aware of the closeness of the orange and yellow dice in this current version and are working to have them easily distinguished from one another.\nStibbles McScooples is the ultimate adventurer, who spends his time between quests cataloging all the strange creatures he comes across. In his nearly 200 years of life, Stibbles has been through it all; fighting demigods, becoming a werewolf, stealing from kings, ruling over rats, and even dying! Thanks to Gu’Gu’s time portals, he survived that last one without a scratch. Now he’s back, with his best friend Stibbles Jr. the little treant, to help save the world again!\n    He’s the fourth of his twelve siblings, who all grew up tending stables in a little gnome village in the woods. Each of them eventually left home in their own time, but Stibbles was the first! His thirst for adventure eventually brought him to a magical pet shop, where his shenanigans led to the rampage Gu’Gu has begun. With his knack for finding friends in unlikely places, his companions are the key to setting things right.\nStibbles\nStibbles Jr.\n- The Ghostfire Gaming Team",
        "url": "https://www.kickstarter.com/projects/ghostfiregaming/companion-quest/posts/4331209",
        "likes_count": 12,
        "comments_count": 0,
        "comments": []
      }
    ]
  }
}