{
  "url": "https://www.kickstarter.com/projects/djtalkstrash/dangerboi",
  "updates": {
    "count": 1,
    "content": [
      {
        "update_number": "UPDATE #1",
        "title": "Fantastic First Days!",
        "creator": "DJ Wooldridge\nFebruary 21, 2025",
        "date": "February 21, 2025",
        "content": "Greetings from Las Torres! I want to thank everyone who's joined us in our first couple days of launch! A strong launch is super important to a successful Kickstarter and thanks to you we're 65% Funded! Not only that, Kickstarter has labelled us a \"Project We Love\"!\nLet's keep this amazing momentum going! Once we've funded we have some amazing Stretch Goals in store that will make this project even more epic! So, if you're excited for DANGER BOi & THE ANTAGONiSTS be sure to get the word out so even more people can go on this wild ride with us! \nDISCUSSING DANGER BOi!\nI've been dropping in with various pals to discuss DANGER BOi! You can find me with the ValleyFolk, ComicPop Returns, and Geekscape! \nI discuss superhero movies with Sal at ComicPop Returns!\nWe talk Disney Adults on the ValleyCast!\nI chat with Jonathan of Geekscape!\nALSO ON KICKSTARTER!\nHere are some other great Kickstarters you should check out!\nSpeaking of Jonathan from Geekscape, he just launched his own comic, a swashbuckling swords and sorcery adventure, HERO OF THE PROPHECY! I've read it and really dug it!\nKeeping on the fantasy side of things, check out Erik Warfield's EVIL, I: THE DEPTHS OF DECEIT! A fantasy comic where black comedy meets blood-red violence. A tale of paranoia, greed, and revenge told in 36, full-color pages of backstabbing, frontstabbing, and murder! \nFinally, you only have a few more hours to back THE LITTLE MERMAID & THE PIRATE QUEEN! Kat Calamia and the Lifeline team are pretty much Kickstarter royalty at this point, so they need no introduction, but I mean... look at that amazing Terry Moore cover!",
        "url": "https://www.kickstarter.com/projects/djtalkstrash/dangerboi/posts/4319241",
        "likes_count": 7,
        "comments_count": 0,
        "comments": []
      }
    ]
  }
}