{
  "url": "https://www.kickstarter.com/projects/chonisi/darkness-holds-the-son-limited-leather-edition",
  "updates": {
    "count": 8,
    "content": [
      {
        "update_number": "UPDATE #8",
        "title": "Stretch Goal #2 Reached!",
        "creator": "Dianne Gardner\nFebruary 22, 2025",
        "date": "February 22, 2025",
        "content": "You all are amazing! \nWe hit our next stretch goal that will put colored illustrations in the eBook! I'll be formatting that this week and post a sample in an update and on the campaign page.\nI've also been working on that short story that you've all earned. I started by creating a cover for it. \nThere are a few different ways to send the story to you when the campaign is over so let me know what works best. I'll choose the most popular.\nAn ePub file that you can read on your digital reader and download from BookFunnel.\nA PDF that you can download and read on your computer which will be delivered through Google Doc.\nOr a private webpage where you can read it and download a PDF. I did this for my last campaign and it was really enjoyable to create. Let me know!\nCampaigns  you might want to check out.\nCaravan of Blades - The first hardcover, paperback, and ebook editions of this cozy deckbuilder, filled with heists, clueless isekaied heroes, and goats!\nBeyond Oakenwald -Two stories about two elf-human couples. Love forged in war, plucky heroines, swoonworthy heroes, plus dragons! Exclusive early access.",
        "url": "https://www.kickstarter.com/projects/chonisi/darkness-holds-the-son-limited-leather-edition/posts/4320350"
      },
      {
        "update_number": "UPDATE #7",
        "title": "NEW Stretch goal and add ons.",
        "creator": "Dianne Gardner\nFebruary 19, 2025",
        "date": "February 19, 2025",
        "content": "Good afternoon!\nA new add on for you all.\nName a character in Another Man's Storm\nThis  book is in the draft stage and wide open for a few character names. 5 to be exact. With credits to you included in the book. \nThese characters will be a few of the mountain villagers - the tribe who volunteer their Dragon Riders to fight with King Rudolph's army against the Sethlanders. \nYou'll receive a complimentary paperback book when it's published.\nNext Stretch goals\nLOCKED $6,000 locked- color illustrations in the eBook.\nLOCKED $6500 3 PDF word art cards with quotations from the book for all tier levels.\nSome friends campaigns below. Another PNW author:\nContests of Strength': Historical Novel Special Edition\nForbidden love, whale hunts, and war. A lush survival story about the Pacific Northwest earthquake and tsunami of 1700.\nAnd Pre Launches below! \nShade: Special Edition Illustrated Hardback by Merrie Destefano.\nFrankenstein meets Dracula in this award-winning Gothic Romance. Sprayed Edges, Foil Cover, Color Illustrations, Alternate Ending.",
        "url": "https://www.kickstarter.com/projects/chonisi/darkness-holds-the-son-limited-leather-edition/posts/4317314"
      },
      {
        "update_number": "UPDATE #6",
        "title": "Back on Track!",
        "creator": "Dianne Gardner\nFebruary 17, 2025",
        "date": "February 17, 2025",
        "content": "Good news! We hit that stretch goal after all. I'll have to take a break from writing Another Man's Storm to get the short story ready for you! \nUNLOCKED  $5500 stretch reward. When The Birds Sang  Barin and Anna's Courtship before the exile. A short backstory. For all tier levels\nNEXT GOAL: LOCKED $6,000 Color illustrations in the eBook. This might be something some of you will want to upgrade to include the eBook in your tiers because as of now the only illustrations in both the paperbacks and hardcovers are monochromatic. So double check to see if your tier includes the eBook. \nLocked: $6,500 will get us select word art included in the books! \nCampaign to check out:\nComplete sweet YA fantasy series with M/M romance, found family and magical familiars, with holographic foil, edges and full-color art.",
        "url": "https://www.kickstarter.com/projects/chonisi/darkness-holds-the-son-limited-leather-edition/posts/4315951"
      },
      {
        "update_number": "UPDATE #5",
        "title": "Making Plans for book 5",
        "creator": "Dianne Gardner\nFebruary 16, 2025",
        "date": "February 16, 2025",
        "content": "We've had a slight hiccup in the funding and the first stretch goal has not been met because of it. I haven't written the short story yet, but I will most likely write it anyway.  We still have 17 days left in the campaign. \nI am really sorry about not being able to offer the hardcover to my European customers. I'm going to look into ways that would make it possible, so if you are in Europe, and you have purchased the other books of this series, please stay in contact and I'll see what I can do. The best way to do that is to join one of my email lists. \nPart of the problem is that other printers who do offer GPSR assistance, do not have leather binding. If any of you are aware of a printer who does and has a representative for GPSR distribution, please let me know. \nBook 5 of this set is titled The Keeper. I'm not sure when I will be launching the limited leather edition of this book. Because I'm in the Beta program for the Kickstarter Pledge Over Time, and I'm not sure how that program is going to work, I decided to hold off that next campaign for a little while. \nIf I do that, I may have book 6 Another Man's Storm ready and can offer the two together. I'm halfway done with it and have been keeping subscribers up to date on it's process on Substack.\nAgain, I thank you all so much for your support and for reading these works.",
        "url": "https://www.kickstarter.com/projects/chonisi/darkness-holds-the-son-limited-leather-edition/posts/4315429"
      },
      {
        "update_number": "UPDATE #4",
        "title": "First Stretch Goal Unlocked!",
        "creator": "Dianne Gardner\nFebruary 14, 2025",
        "date": "February 14, 2025",
        "content": "The first stretch goal has been unlocked!\nThat's right! I've been commissioned to write Barin and Anna's courtship story. It's an interesting relationship, and the short story will whisper of what might come in Darkness Holds the Son. \nThat puts us on course for the next stretch goal.\n$6500 will get us some PDF artwork and word art that you can print or use as screen savers. I'll post some samples in the next day or so. \nI'm really hoping we get to the $8,000 level because then I can afford colored illustrations in the hardcover book and eBooks. \nIn the meantime, check out these other campaigns by my creator friends.\nSpirited Away meets Adventureland in this theme park cozy fantasy! The construction of a new Fae-enchanted ride unlocks a secret past.\nIn pre-order now\nBestselling epic fantasy dragon rider series in 2 deluxe, illustrated collector's edition omnibuses - faux leather, foil & gilt edges! \n\nA tale of dragons, mysterious powers, overcoming trauma, & no-spice romance, in two books with special edition foiled covers.\nA collection of thoughtful essays on caring for each other in a fraught and sometimes dangerous world.",
        "url": "https://www.kickstarter.com/projects/chonisi/darkness-holds-the-son-limited-leather-edition/posts/4314135"
      },
      {
        "update_number": "UPDATE #3",
        "title": "Dedication Edition Added",
        "creator": "Dianne Gardner\nFebruary 13, 2025",
        "date": "February 13, 2025",
        "content": "Two quick updates for you for Darkness Holds the Son.\nI've added a Dedication Hardcover tier. This book will not only have your name in the acknowledgments, but it will also have the dedication of the book to you or someone you choose. I will also hand write a personalized note to you. There is only 1 of these available, of course, as I can only insert one dedication page. The cost is $200.\nI've added another stretch goal. If we reach $8,000 I'll be able to make the illustrations in the book color. So tell your friends, send them a link, ask them to pledge. I would love to do this.\nBe looking for some digital word art for stretch goals as the campaign goes on. We're almost to the first stretch goal for that short story.\nHave a great rest of the day.",
        "url": "https://www.kickstarter.com/projects/chonisi/darkness-holds-the-son-limited-leather-edition/posts/4313614"
      },
      {
        "update_number": "UPDATE #2",
        "title": "First Stretch Goal introduced.",
        "creator": "Dianne Gardner\nFebruary 13, 2025",
        "date": "February 13, 2025",
        "content": "NEW in the campaign\nComing up... $5500 stretch reward.\nWhen The Birds Sang  Barin and Anna's Courtship before the exile. A short backstory. This story is brand new. In fact it's so new I haven't written it yet. But I will before the campaign is over. \nNew add on\nBeasts and Oddities of the Cho Nisi World. Some of you who have pledged on my other campaigns have this book, but if you'd like additional copies, or you haven't seen it before, there is a limited supply available in the add -ons for $20.",
        "url": "https://www.kickstarter.com/projects/chonisi/darkness-holds-the-son-limited-leather-edition/posts/4312758"
      },
      {
        "update_number": "UPDATE #1",
        "title": "I want to thank every one of you!",
        "creator": "Dianne Gardner\nFebruary 12, 2025",
        "date": "February 12, 2025",
        "content": "Thank you so much for your support for Darkness Holds the Son and for the Cho Nisi series as a whole. I see so many of you coming back and getting all the books! it's thrilling and I hope you are enjoying the story. \nIf you see anything missing please message me and I'll try to accommodate your wishes. \nI have a lot of swag that's accumulated during these last campaigns and I'm considering putting some extras that I have in the add-ons so let me know if you'd be interested in: There wouldn't be enough for stretch goals, but I can put them as add-ons with limited supplies.\nBeasts and Oddities of the Cho Nisi World saddle stitch book.\nEscapades of a Magic Thief (short story that goes with my the Ian's Realm Saga).\nGold foil bookmarks of each book in the series, plus bookmarks for Tales of Wonder, Thread of a Spider, and An Unconventional Mr. Peadlebody. \nIf you've joined me at SubStack, you'll know I'm in the process of writing book 6 to the Sword of Cho Nisi series and I'd love for you to take the Name the Dragon poll. \nAgain, you've been the best backers ever. We're now close to $5,000 on the first day. We funded in 7 minutes. So I'm thrilled with the team and stay tuned as I conjure up an extra reward for you for being so faithful.  I'm thinking something along the lines of a short story...?",
        "url": "https://www.kickstarter.com/projects/chonisi/darkness-holds-the-son-limited-leather-edition/posts/4312352"
      }
    ]
  }
}