{
  "url": "https://www.kickstarter.com/projects/dockcaseexplorerepro/dockcase-smart-usb-c-hub-7-in-1-with-m2-ssd-enclosure",
  "campaign_details": {
    "funding_period_text": "Funding period\nFeb 5 2025 - Mar 7 2025 (30 days)",
    "funding_start_date": "2025-02-05T08:00:02-05:00",
    "funding_end_date": "2025-03-07T08:00:02-05:00",
    "funding_duration_days": 30,
    "pledged_amount": "$70,335",
    "funding_goal": "$5,000",
    "backers_count": "439"
  },
  "updates": {
    "count": 2,
    "content": [
      {
        "update_number": "UPDATE #2",
        "title": "Thank You!",
        "creator": "Seesaw\nMarch 7, 2025",
        "date": "March 7, 2025",
        "content": "Dear Dockcasers,\nThank you for your continued trust in us！\nNext, Payment Collection Process.\nWhen a campaign ends, Kickstarter starts a 7-day pledge collection process, so please keep an eye on your mailbox and \"Action Needed\" banner from Kickstarter in case the pledge fails to collect. \nIf your pledge has been declined, you’ll need to log in to your Kickstarter account and click the “Fix payment” button in the banner at the top of your screen. This will guide you through the process of changing or retrying your payment method. Kickstarter'll also send you an email every 48 hours with a direct link to correct the issue.\nReference:\n My pledge was declined, can I fix this through the app? \nA project I'm backing just succeeded but my pledge was declined. What do I need to do next?\nWhat forms of payment can I use to make a pledge?\nCommon Pledge Problems\nWhat Happens if Collection Issues Aren't Resolved?\nIf backers don't resolve the payment issues within 7 days from campaign's deadline, their pledges are unfortunately dropped.\nWe will send you the survey and post an update after the 7-day pledge collection process. If you have any questions or concerns, please do not hesitate to reach out to us(service@dockcase.com). \nBest regards,  \nDockcase",
        "url": "https://www.kickstarter.com/projects/dockcaseexplorerepro/dockcase-smart-usb-c-hub-7-in-1-with-m2-ssd-enclosure/posts/4328424",
        "likes_count": 5,
        "comments_count": 0,
        "comments": []
      },
      {
        "update_number": "UPDATE #1",
        "title": "We Hit the Goal! Thank You! 🎉",
        "creator": "Seesaw\nFebruary 5, 2025",
        "date": "February 5, 2025",
        "content": "Dear Dockcasers, \nWe’ve officially hit our funding goal! 🎯✨ \nThanks to your incredible support, we couldn’t have done it without each and every one of you who believed in our vision and joined us on this journey.  \nReaching this milestone is only the beginning, and we’re so grateful to have you with us as we take the next steps. Let’s keep this momentum going—if you know someone who’d love what we’re creating, please share our campaign and earn 10% commission cash back!  \nThank you again for believing in us!\nWith gratitude, \nDockcase",
        "url": "https://www.kickstarter.com/projects/dockcaseexplorerepro/dockcase-smart-usb-c-hub-7-in-1-with-m2-ssd-enclosure/posts/4307403",
        "likes_count": 5,
        "comments_count": 0,
        "comments": []
      }
    ]
  }
}