{
  "url": "https://www.kickstarter.com/projects/1889053217/doze-micro-geiger-measure-your-daily-radiation-dose",
  "updates": {
    "count": 2,
    "content": [
      {
        "update_number": "UPDATE #2",
        "title": "Incredible! Thanks to you, we've reached the stretch goal!",
        "creator": "Wekos\nMarch 4, 2025",
        "date": "March 4, 2025",
        "content": "Dear Backers,\nWe can hardly believe it, but thanks to your fantastic support, we have already reached our stretch goal. This means that we will use the injection molding process for the Doze case instead of a printing process.\nWe are very grateful for your continued support.\nTo give you, our Backers, a first impression of Doze and its capabilities, we have uploaded a short video. This video showcases Doze with a radioactive test body and the measurements it takes.\nYou can view the original video, which includes the audio of the individual clicks, here:\nThe Wekos Team",
        "url": "https://www.kickstarter.com/projects/1889053217/doze-micro-geiger-measure-your-daily-radiation-dose/posts/4328535",
        "likes_count": 5,
        "comments_count": 0,
        "comments": []
      },
      {
        "update_number": "UPDATE #1",
        "title": "Doze was funded! We are completely over the moon!",
        "creator": "Wekos\nMarch 1, 2025",
        "date": "March 1, 2025",
        "content": "Dear Backers,\n\nYou are fantastic! Doze was funded in only 36 hours! With your help, we are one step closer to making our dream a reality. We started with the idea of enabling people to measure nuclear radiation with a device that is not bulky but simply fits in your pocket. Now, we cannot wait to successfully finish this project and see you holding Doze in your own hands!\n\nWe will keep you updated as we move forward. \nStay safe! \n\nThe Wekos Team",
        "url": "https://www.kickstarter.com/projects/1889053217/doze-micro-geiger-measure-your-daily-radiation-dose/posts/4326190",
        "likes_count": 2,
        "comments_count": 0,
        "comments": []
      }
    ]
  }
}