{
  "url": "https://www.kickstarter.com/projects/giraffe-design/dragon-grit-1-4",
  "campaign_details": {
    "funding_start_date": "2025-03-04T00:00:00.000000Z",
    "pledged_amount": "S$ 22,810",
    "funding_goal": "S$ 6,688",
    "backers_count": "557",
    "days_left": 61,
    "project_launch_text": "Project launches MARCH 4, 2025"
  },
  "updates": {
    "count": 3,
    "content": [
      {
        "update_number": "UPDATE #3",
        "title": "First stretch goal unlocked!",
        "creator": "Caleb Palmquist\nMarch 11, 2025",
        "date": "March 11, 2025",
        "content": "Hello! Early this morning we hit 12k, which means every single backer will get this incredible trading card illustrated by Kay Woolhiser:\nDigital backers will receive a high-res file.\nThanks so much for the incredible support - we are well on our way to hitting our next stretch goal and adding four pages of backmatter to the comic.\nWhile I'm here, I have two awesome projects for you to check out.\nThe first is another epic fantasy western on Kickstarter right now:\nTHE FEW AND CURSED #11 - A Weird Western Saga\nI've been following this series for a while, and as always, Felipe is absolutely crushing it.\nFrom the Kickstarter page:\n\"Imagine a world where the apocalypse happened back in 1840 and opened up the doors to all sorts of monsters, curses and demons. One day the world just dried up and whatever little water that was left, being now the most precious resource on the planet, started to be used as currency. \nDecades have gone by and mankind barely lingered on. There's good water to be made hunting down the wicked and Curse Chasers are always eager to help those in need (for the right flask of water of course). The Redhead is a hardened survivor and a Curse Chaser in this alternate Old West reality.\"\nIf you'd like to check it out, here's the link: https://www.kickstarter.com/projects/felipecagno/the-few-and-cursed-11 \nThe second project is by a good friend of mine, Joe Karg:\nDear Bernadette: A Collection of Illustrations and Letters\nI've known Joe for a long time, and I'm thrilled he's back on Kickstarter after about 9 years away. He's got a very sweet book that is a collection of writings and illustrations for his young daughter.\nFrom the Kickstarter page:\n\"Dear Bernadette is a love letter to my daughter—literally. It’s a collection of illustrations and essays written to my daughter, Bernadette, about the things that matter most to me: art, storytelling, death, politics, comedy, friendship, and the strange ways life unfolds. Each piece is framed as a letter to her in the future, offering reflections on the movies I love, the people who shaped me, and the creative work that has defined my life.\"\nJoe is an incredible artist, and the way he writes about his life and his hopes for his daughter is really captivating. If you want to give it a look check it out here: https://www.kickstarter.com/projects/dearbernadette/dear-bernadette-a-collection-of-illustrations-and-letters \nThat's it for today. I'll be back soon with more updates!\n-Caleb",
        "url": "https://www.kickstarter.com/projects/giraffe-design/dragon-grit-1-4/posts/4333952",
        "likes_count": 20,
        "comments_count": 4,
        "comments": [
          {
            "text": "I see you will be at C2E2! I’ll be there to get everything signed! I can’t wait (I’ll be the bald littler person in a cheap Dopey costume with a shirt that says “Legalize Gay Mar**uana”)",
            "commenter": "Ben Saylor",
            "timestamp": "March 11, 2025 7:29 AM AWST",
            "datetime": "1741649359",
            "relative_time": "16 days ago"
          },
          {
            "text": "Looking forward to it!",
            "commenter": "Caleb Palmquist",
            "timestamp": "March 12, 2025 8:08 AM AWST",
            "datetime": "1741738123",
            "relative_time": "15 days ago"
          },
          {
            "text": "The trading card is lovely.",
            "commenter": "Madeleine Holly-Rosing",
            "timestamp": "March 11, 2025 7:18 AM AWST",
            "datetime": "1741648726",
            "relative_time": "16 days ago"
          },
          {
            "text": "right?!",
            "commenter": "Caleb Palmquist",
            "timestamp": "March 11, 2025 7:22 AM AWST",
            "datetime": "1741648944",
            "relative_time": "16 days ago"
          }
        ]
      },
      {
        "update_number": "UPDATE #2",
        "title": "New Add-Ons: Previous Collector's Editions + Stretch Goals",
        "creator": "Caleb Palmquist\nMarch 7, 2025",
        "date": "March 7, 2025",
        "content": "Hello. A number of people have asked about the Collector's Editions of previous campaigns. Up till this point I haven't offered Collector's Editions from previous campaigns on new campaigns, but I looked through my stock and discovered I had a few more than I thought, so I'm going to go ahead and offer them here.\nAs a special promotion, I'm offering the original early bird prices ($18) on these covers until Sunday, March 9th (this coming Sunday) at 9pm PST. After that, whatever stock I have left will be available at the normal price ($20).\nHere are the covers available. The Cover A versions have a decent number of copies, but the Cover B and C versions have between 10-15 copies left. Unfortunately, I am completely sold out of Dragon Grit #1 Collector's Edition Cover B.\nIssue #1 Collector's Edition Cover A, cover art by Kay Woolhiser.\nIssue #2 Collector's Edition Cover A, cover art by Kay Woolhiser.\nIssue #2 Collector's Edition Cover B, cover art by Jamie Jones.\nIssue #2 Collector's Edition Cover C, cover art by Luigi Criscuolo.\nIssue #3 Collector's Edition Cover A, cover art by Kay Woolhiser.\nIssue #3 Collector's Edition Cover B, cover art by K Lynn Smith.\nIssue #3 Collector's Edition Cover C, cover art by David Hahn.\nI'll keep offering these until they are sold out. If you missed an issue and want to grab the Collector's Editions, now is the time.\nAs for the other bits that would have come with the Collector's Bundles on previous issues like stickers, bookmarks, and trading cards, those will all be available on the Backerkit survey after the campaign.\nStretch Goals\nOn that note, let's talk about stretch goals! We cruised past our goal on day 1, and we just keep climbing. If we hit 12k, every backer will get an awesome Blaze trading card, illustrated by Kay. Check out the stretch goals:\nWe are close. I'm positive we will hit that first goal.\nConfederate Monster!\nMy good friend and frequent collaborator, Dave Swartz (Vampire Detective in Space) is back on Kickstarter right now with the fifth issue of his series Confederate Monster. It's an amazing book, and I highly recommend you check it out.\nThe series is essentially about the cast of Frankenstein getting caught up in the events of the Civil War. It's fun, it's gruesome, and it's weird as hell.\nHere's the link: https://www.kickstarter.com/projects/daveswartzart/confederate-monster-1-5 \nIf you decide to back his project, leave him a comment on his page letting him know I sent you. :) \n-Caleb",
        "url": "https://www.kickstarter.com/projects/giraffe-design/dragon-grit-1-4/posts/4331299",
        "likes_count": 14,
        "comments_count": 2,
        "comments": [
          {
            "text": "How do I add the collector editions (issues 1 to 3) to my pledge? I do not see them listed under add-ons. Thanks and have a great day.",
            "commenter": "Michael Kassab",
            "timestamp": "March 12, 2025 4:31 AM AWST",
            "datetime": "1741725092",
            "relative_time": "15 days ago"
          },
          {
            "text": "My bad! I had accidentally set the start time for those rewards incorrectly, so they weren't appearing. They should be there now. Please let me know if you're able to add them.",
            "commenter": "Caleb Palmquist",
            "timestamp": "March 12, 2025 8:07 AM AWST",
            "datetime": "1741738046",
            "relative_time": "15 days ago"
          }
        ]
      },
      {
        "update_number": "UPDATE #1",
        "title": "Incredible, record-breaking first day!",
        "creator": "Caleb Palmquist\nMarch 5, 2025",
        "date": "March 5, 2025",
        "content": "Hello! Dropping a quick update to say WOW. Today we broke 300 backers on day one, a first for me. Not only did this campaign set a day one record for Dragon Grit, it's the most backers I've had on day one for any any campaign. I'm blown away and incredibly honored.\nBoth Lorelei and I are incredibly proud of this series, and we can't wait for you to see where the story is going.\nI'll be back again soon with more updates, but for now I just wanted to express my gratitude, and celebrate the best first day I've ever had on Kickstarter.\nThank you, thank you, thank you.\n-Caleb",
        "url": "https://www.kickstarter.com/projects/giraffe-design/dragon-grit-1-4/posts/4329426",
        "likes_count": 19,
        "comments_count": 1,
        "comments": [
          {
            "text": "Congratulations Caleb and Lorelei🙂",
            "commenter": "Alexander Haller",
            "timestamp": "March 5, 2025 4:40 PM AWST",
            "datetime": "1741164024",
            "relative_time": "21 days ago"
          }
        ]
      }
    ]
  }
}