{
  "url": "https://www.kickstarter.com/projects/1650060842/e-pisteme-space-immersive-stem-kits-on-all-things-space",
  "updates": {
    "count": 2,
    "content": [
      {
        "update_number": "UPDATE #2",
        "title": "Keeping the momentum going 🚀",
        "creator": "Marlon RadaCollaborator\nFebruary 13, 2025",
        "date": "February 13, 2025",
        "content": "🚀 We’ve Passed 50% – Thank You! 🎉\nE-pistemers, we’re beyond grateful! Thanks to your incredible support, we’ve already surpassed 50% of our initial goal in just a few days. Compared to other projects, the enthusiasm around our E-Tellurion kit is amazing, and that fuels us to keep pushing forward!\nBut we’re not there yet! Reaching 100% as soon as possible is crucial to making this project a reality. More than just backing the campaign, sharing it with friends, family, and communities who might be interested makes a huge difference. Every share brings us closer to unlocking more rewards and making this an even bigger success!\nNext week, we’ll be in the EdTech Congress Barcelona, showcasing our kit and spreading the word about our mission. If you know anyone who might love this project, now is the perfect time to tell them!\nLet’s keep the momentum going—Let's keep building knowledge! 🚀\nES:\n🚀 ¡Hemos superado el 50% – Gracias! 🎉\nE-pistemers, ¡estamos enormemente agradecidos! Gracias a vuestro apoyo, ya hemos superado el 50% de nuestra meta inicial en solo unos días. Comparado con otros proyectos, el interés en nuestro kit E-Tellurion es increíble, y eso nos motiva a seguir adelante con más fuerza.\nPero aún no hemos llegado a la meta. Es fundamental alcanzar el 100% lo antes posible para que el proyecto sea viable. Más allá de colaborar, compartir la campaña con amigos, familiares y comunidades que puedan estar interesadas es clave. ¡Cada vez que alguien la comparte, nos acercamos más a desbloquear más recompensas y hacer de esto un gran éxito!\nLa próxima semana estaremos en el EdTech Congress Barcelona, mostrando nuestro producto y difundiendo nuestra misión. Si conoces a alguien que pueda estar interesado, ¡este es el momento perfecto para hablarles del proyecto!\nSigamos con esta energía, ¡Sigamos construyendo conocimiento! 🚀",
        "url": "https://www.kickstarter.com/projects/1650060842/e-pisteme-space-immersive-stem-kits-on-all-things-space/posts/4312750",
        "likes_count": 2,
        "comments_count": 0,
        "comments": []
      },
      {
        "update_number": "UPDATE #1",
        "title": "Almost halfway there 🎉",
        "creator": "Raul HernandezCollaborator\nFebruary 6, 2025",
        "date": "February 6, 2025",
        "content": "We couldn’t have imagined a better start to our Kickstarter campaign—almost halfway funded in less than 48 hours! Thank you to everyone who has trusted us so far 😊.\nWe are thrilled to bring E-pisteme Space into your homes, and the incredible support we’ve received is giving our team even more motivation.\nNow is the perfect time to share the campaign with family, friends, and anyone else you know so they can take advantage of the early bird discount.\nTogether we can keep building knowledge!\nThanks from Manuel, Greta, Carlos, Raúl, Marlon, and everyone who has helped us along the way. 🚀\nES: ¡No podríamos haber imaginado un mejor comienzo para nuestra campaña de Kickstarter: casi alcanzamos la mitad de la financiación en menos de 48 horas! Muchas gracias a todos los que han confiado en nosotros hasta ahora 😊.\nEstamos emocionados de llevar E-pisteme Space a vuestros hogares, y el increíble apoyo que hemos recibido está dando a nuestro equipo aún más motivación.\nAhora es el momento perfecto para compartir la campaña con familiares, amigos y con quien se te ocurra, para que puedan aprovechar el descuento de early bird.\n¡Juntos podemos seguir construyendo conocimiento!\nGracias de parte de Manuel, Greta, Carlos, Raúl, Marlon y de todos los que nos han ayudado en el camino. 🚀",
        "url": "https://www.kickstarter.com/projects/1650060842/e-pisteme-space-immersive-stem-kits-on-all-things-space/posts/4306416",
        "likes_count": 2,
        "comments_count": 0,
        "comments": []
      }
    ]
  }
}