{
  "url": "https://www.kickstarter.com/projects/milerd/ecotracker",
  "campaign_details": {
    "funding_period_text": "Funding period\nJan 28 2025 - Feb 25 2025 (28 days)",
    "funding_start_date": "2025-01-28T08:10:20-05:00",
    "funding_end_date": "2025-02-25T08:10:20-05:00",
    "funding_duration_days": 28,
    "pledged_amount": "",
    "funding_goal": "$5,000",
    "backers_count": "1,125"
  },
  "updates": {
    "count": 1,
    "content": [
      {
        "update_number": "UPDATE #1",
        "title": "🎉 Together We Did It: Thank You for Making EcoTracker a Reality! 🙌",
        "creator": "MILERD TECHNOLOGY\nFebruary 27, 2025",
        "date": "February 27, 2025",
        "content": "Dear Backers,\nAfter successfully launching over 80 different models in the past 15 years, we're excited to announce our first venture into the Kickstarter community with the Milerd EcoTracker. We are thrilled to share that the EcoTracker has successfully achieved its Kickstarter goal! 🙌\nYour incredible support has been invaluable, and we couldn't have achieved this milestone without each of you. Your enthusiasm, feedback, and commitment have been the driving force of this journey, and we’re eager to continue our adventure together!\nThanks to the dedication of over 1,100 backers, we're now well on our way to bringing the Milerd EcoTracker to life! Your belief in our vision to revolutionize food and water safety means everything to us.\nHere's what to expect next:\nProduction Kicks Off Soon: We are putting the final touches on our preparations at our manufacturing facility in Poland to ensure a seamless start.\nProcessing Your Payments: Kickstarter will now process your pledges. Please check your credit card statements to ensure everything goes through without a hitch, as any issues might delay your EcoTracker shipment.\nShipping Information: We will soon send out a post-campaign survey to gather your shipping details. Please look out for this survey to ensure a smooth delivery process.\nRegular Updates: We’ll keep you informed with regular updates on our progress. Expect to hear from us about key milestones such as production achievements and shipping schedules.\nWe are beyond excited to embark on this next chapter with all of you. Thank you once again for your incredible support. We can’t wait to get the EcoTracker into your hands and help you achieve your health and wellness goals.\nIn the meantime, feel free to explore our other eco-safety products at milerd.com.\nWith heartfelt gratitude,\nThe Milerd EcoTracker Team",
        "url": "https://www.kickstarter.com/projects/milerd/ecotracker/posts/4301224",
        "likes_count": 11,
        "comments_count": 2,
        "comments": [
          {
            "text": "I was trying to back out of supporting this but was unabl to. Can someone help me?",
            "commenter": "Chancellor Pell",
            "timestamp": "March 1, 2025 2:02 AM AWST",
            "datetime": "1740765726",
            "relative_time": "13 days ago"
          },
          {
            "text": "Hi, our support team will address your issue.",
            "commenter": "MILERD TECHNOLOGY",
            "timestamp": "March 1, 2025 8:06 PM AWST",
            "datetime": "1740830795",
            "relative_time": "12 days ago"
          }
        ]
      }
    ]
  }
}