{
  "url": "https://www.kickstarter.com/projects/abraham-cozar/elusive",
  "campaign_details": {
    "funding_period_text": "Funding period\nMar 05 2025 - Apr 05 2025 (31 days)",
    "funding_start_date": "2025-03-05T00:00:00.000000Z",
    "funding_end_date": "2025-04-05T20:13:44.216674Z",
    "funding_duration_days": 31,
    "pledged_amount": "S$ 331,988",
    "funding_goal": "S$ 57,876",
    "backers_count": "4,027",
    "days_left": 12,
    "project_launch_text": "Project launches MARCH 5, 2025"
  },
  "updates": {
    "count": 8,
    "content": [
      {
        "update_number": "UPDATE #8",
        "title": "Game Beta Access",
        "creator": "Abraham Cozar\nMarch 22, 2025",
        "date": "March 22, 2025",
        "content": "Surprise!\nWe've been thinking a lot about how positive it has been for both us and our last release (Mika and the Witch's Mountain) to go through a beta with our backers. While it obviously requires more time, it allows us to deliver a better game thanks to your help!\nLet's do it again with Elusive! We're getting incredible support, so we've added the Game Beta Access as an addon and it will also be automatically included in these 4 contributions:\nELUSIVE COLLECTOR'S EDITION\nYOUR MESSAGE IN GAME\nHANDSIGNED LIMITED EDITION\nHANDSIGNED COLLECTOR'S EDITION\n*If you have supported any of these 4, you don't need to select this as addon.\nGame Beta Access important considerations (Read carefully, please!)\nThis version will have a representative part of the content, with several hours of gameplay, but it will not be the full content until the release of the game.\nThis will add the game to the Steam library and when the game is released it will be an identical version of the final game with all the functionalities: trophies, cloud save, etc. \nParticipants in the Beta program will have the full content a few days before the release.\nThe beta will be private and closed, so it will not be allowed to share content (no videos, no screenshots, no streaming). The content shown in the beta will not be the final one, and we don’t want to tarnish the experience of future players.\nThe beta keys will be only for Steam and very limited. 1000 Steam key units for addons to be added for any pledge and 1500 Steam key units will be included automatically on the Pledges mentioned above.\nAnd when will you have access? In 2026, so the wait until the full release will be more bearable :)\nWe encourage you to select this reward only for those who want to actively participate in this process of testing and improving the game by providing feedback (Discord and forms), given its limited nature.\nADD THE GAME BETA ACCESS TO YOUR PLEDGE NOW\nHope you liked the surprise, let's keep pushing together these last weeks!",
        "url": "https://www.kickstarter.com/projects/abraham-cozar/elusive/posts/4342475",
        "likes_count": 51,
        "comments_count": 5,
        "comments": [
          {
            "text": "You said four tiers will get this key. One of them called your message in game tier but I do not see that in the tiers. I backed to get the physical game and figure at 129. Do I get a beta key?",
            "commenter": "Caleb G.",
            "timestamp": "March 22, 2025 1:24 AM AWST",
            "datetime": "1742577888",
            "relative_time": "3 days ago"
          },
          {
            "text": "Hello Caleb, the beta key is included on top tier rewards over 149, and they are also available as addon for other rewards. In your case I think is better jump to Collector's edition reward instead of the addon.",
            "commenter": "Abraham Cozar",
            "timestamp": "March 22, 2025 1:32 AM AWST",
            "datetime": "1742578331",
            "relative_time": "3 days ago"
          },
          {
            "text": "You would think you would want a much larger pool of people beta testing a game. Why limit it to a paid access?",
            "commenter": "James Robbins",
            "timestamp": "March 22, 2025 12:36 AM AWST",
            "datetime": "1742575009",
            "relative_time": "3 days ago"
          },
          {
            "text": "Hi James! The max number of Beta Steam Keys are limited by Steam, and this is a key that grant access to the final game on release.",
            "commenter": "Abraham Cozar",
            "timestamp": "March 22, 2025 12:49 AM AWST",
            "datetime": "1742575773",
            "relative_time": "3 days ago"
          },
          {
            "text": "¡Poned más recompensas!, ya ha pasado la mitad del tiempo de la campaña y esto puede dar aún más de sí (si queréis, claro).",
            "commenter": "Marcos Santiago Becerra",
            "timestamp": "March 22, 2025 12:21 AM AWST",
            "datetime": "1742574114",
            "relative_time": "3 days ago"
          }
        ]
      },
      {
        "update_number": "UPDATE #7",
        "title": "5th Stretch Goal achieved: the Scent Cloak + artbook",
        "creator": "Abraham Cozar\nMarch 17, 2025",
        "date": "March 17, 2025",
        "content": "Good news to start a new week: the Scent Cloak will be added to Elusive!\nNow the real challenge has come:\nSpecial Combat Attacks\nSome animals act strangely, and they will make things really difficult for Zoe and the rest of Elusive from the Red-Watering Can. You must be brave and stop them!\nAlso, it looks like he may be able to give us some clues as to the whereabouts of Zoe's father. How might he be related?\nELUSIVE ARTBOOK\nAt Chibig, we always put a lot of effort into developing the characters and the world of our video games through extensive concept art. Thanks to our illustrators, we have a wealth of graphic material that we love to compile.\nThat’s why we always create an artbook featuring all the concept art and illustrations we’ve made for the final game.\nElusive is the project where we’ve dedicated the most work to the artistic side, which is why we’re convinced it will result in a stunning artbook of at least 80 pages. If we receive more support for this reward, we’ll be able to expand it with even more pages.\nThis reward will be available in both digital and physical formats. We encourage you to get the physical edition, as it will be one of the elements that make our Collector’s Edition unique and memorable.\nUPGRADE NOW TO THE COLLECTOR'S EDITION\nWe must keep pushing, friends, but we trust you!\nLet us know what you think on Discord or in the comments!",
        "url": "https://www.kickstarter.com/projects/abraham-cozar/elusive/posts/4336206",
        "likes_count": 62,
        "comments_count": 5,
        "comments": [
          {
            "text": "Wow, lots of things happening. Love the progress. ❣️",
            "commenter": "Yvonne Huby",
            "timestamp": "March 17, 2025 5:25 AM AWST",
            "datetime": "1742160306",
            "relative_time": "8 days ago"
          },
          {
            "text": "Is there any chance the physical artbook will be available as an add-on?",
            "commenter": "Amit Ungar",
            "timestamp": "March 17, 2025 3:03 AM AWST",
            "datetime": "1742151816",
            "relative_time": "8 days ago"
          },
          {
            "text": "Not for now, sorry!",
            "commenter": "Abraham Cozar",
            "timestamp": "March 18, 2025 4:52 PM AWST",
            "datetime": "1742287922",
            "relative_time": "6 days ago"
          },
          {
            "text": "I’m so excited! I hope we can push this past 500k!",
            "commenter": "Beck Hinton-Stratton",
            "timestamp": "March 17, 2025 12:24 AM AWST",
            "datetime": "1742142258",
            "relative_time": "8 days ago"
          },
          {
            "text": "Omg that would be amazing!",
            "commenter": "Abraham Cozar",
            "timestamp": "March 18, 2025 4:52 PM AWST",
            "datetime": "1742287941",
            "relative_time": "6 days ago"
          }
        ]
      },
      {
        "update_number": "UPDATE #6",
        "title": "4th Stretch Goal achieved: Fishing Minigame + Physical update",
        "creator": "Abraham Cozar\nMarch 14, 2025",
        "date": "March 14, 2025",
        "content": "Get your gear ready, Elusive friends, because we're going fishing ✨\nThe Elusive have no interest in trying to catch a fish - have you seen its size? Too risky!\nResource fishing makes much more sense, so we'll have to help Zoe to get a powerful magnet that can help us clean the bottom of the waters in search of real treasures.\nNow we're in the middle of an important step, and we need your support and feedback: It's time to talk about combat in Elusive\nWe've been thinking about it a lot in the last few days and we think it can add a layer of fun and relevance to the story with the approach we have in mind.\nFor now, let's go for the next Stretch Goal: the Scent Cloak!\nWe can't give too many details at this time as it is in process, but we would very much like it to have some effect on the (harmless) animals or Zoe's health.\nWe’re not so far, let’s do it! \nYOU REALLY LIKE PHYSICAL THINGS!\nThank you so much for the incredible support you’ve shown for our collector’s editions! \nIn just one day, 100 units have already been reserved.\nWe’d like to highlight a very special item included in this edition:\n✨ The Zoe Figurine ✨\nAn exclusive 4''/10 cm full-color figurine, carefully crafted by our friends at Undigital.\n3D printed real prototype\nThe quality of Undigital’s figurines is truly outstanding, as you can see in previous pieces like the Mika and the Witch's Mountain figurine with this amiibo like style!\nWe’re getting close to reaching 500 units of Zoe's figurine, and once we hit that number, we’ll reveal a secret stretch goal with upgrades that we know you’re going to love!\nDon’t miss out! this edition is exclusive to Kickstarter! \nUPGRADE NOW TO THE COLLECTOR'S EDITION\nHere's our Discord community, a chill and safe place to share your thoughts, requests and asking any question!",
        "url": "https://www.kickstarter.com/projects/abraham-cozar/elusive/posts/4336178",
        "likes_count": 51,
        "comments_count": 1,
        "comments": [
          {
            "text": "Combat: Seeing that the title is Elusive; I think combat should be focused on dodging and jumping mechanics. Since Elusives are hidden from us maybe the boss fights could be \"stages\" and use parts of the environment (or the body of the boss, think sneaking around to \"itch\" their head and they smack themselves or guiding them to \"ropes\" that causes the boss to fall/ trap themelves) to take them down vs a full frontal attack with blocking and parry mechanics. Regular combat could be a method of stunning the \"enemies\" with a staff or could leave \"food\" to distract them and find a peaeful way around them. If use this method, then next tiem in the area the \"enemies\" become friendly to you with little emoticons to the main character. I feel like Elusives would not want to terrorize their ecosystem...literally off the top of my head (but if you need help designing let me know lol) (also posted this in the Comments section)",
            "commenter": "Dominic",
            "timestamp": "March 15, 2025 12:55 AM AWST",
            "datetime": "1741971307",
            "relative_time": "10 days ago"
          }
        ]
      },
      {
        "update_number": "UPDATE #5",
        "title": "New Pledge Available: Elusive Collector’s Edition",
        "creator": "Abraham Cozar\nMarch 12, 2025",
        "date": "March 12, 2025",
        "content": "Some of you have already noticed (and supported it!), but we wanted to officially announce that we've added ✨ the Collector's Edition ✨ pledge to the Elusive campaign.\nAfter the incredible support to get the physical edition upgrade, our publisher proposed to create a Collector's Edition for Kickstarter with some additional items. Also, some of you had already shared with us your requests and suggestions about elements such as the soundtrack and artbook, so we took the opportunity!\nUPGRADE NOW TO THE COLLECTOR'S EDITION\nThis is our sixth Kickstarter campaign (we survived the Mika and the Witch's Mountain campaign with 24,000 backers!) and we also have experience with the Collector's Edition of our already released games, so we are confident we can create a great new edition.\nThe Elusive Collector’s Edition includes:\nElusive - Physical Game (Nintendo Switch/2/PS5)\nElusive - Digital Game in your platform\nZoe color figure 4”/ 10cm PVC/Vynil\nPhysical Artbook - New!\nPhysical Soundtrack - New!\n4x Postcards - New!\nDigital Artbook\nDigital Soundtrack\nKickstarter Exclusive Outfit\nDiscord server exclusive for backers\nDigital goodies pack\nYour name in the credits - gold section\nWe can't confirm how this edition will look yet, but we can expect something pretty similar to this:\nWe’re getting closer to the next Stretch Goal - The Fishing Minigame! So hopefully we’ll be here with a new update soon. \n\nWatch your steps!",
        "url": "https://www.kickstarter.com/projects/abraham-cozar/elusive/posts/4335243",
        "likes_count": 64,
        "comments_count": 14,
        "comments": [
          {
            "text": "Wish I could swing the CE. I all the goodies for Witch but funds low. Physical edition will have to do.",
            "commenter": "James Robbins",
            "timestamp": "March 16, 2025 4:49 PM AWST",
            "datetime": "1742114954",
            "relative_time": "8 days ago"
          },
          {
            "text": "Any chance to get a physical art book as an add-on? 🙏🏻😁",
            "commenter": "Amit Ungar",
            "timestamp": "March 14, 2025 7:09 AM AWST",
            "datetime": "1741907352",
            "relative_time": "11 days ago"
          },
          {
            "text": "Not for now, sorry :x",
            "commenter": "Abraham Cozar",
            "timestamp": "March 14, 2025 6:06 PM AWST",
            "datetime": "1741946804",
            "relative_time": "10 days ago"
          },
          {
            "text": "I did wonder where the Collector’s Edition was! I’ve upgraded my pledge; I cannot miss out!",
            "commenter": "Derek Chandler",
            "timestamp": "March 14, 2025 3:26 AM AWST",
            "datetime": "1741894014",
            "relative_time": "11 days ago"
          },
          {
            "text": "Muchas gracias, acabo de cambiar la Handsighted Edition que había elegido por la Handsighted Collector's Edition <3",
            "commenter": "andorranicozgz",
            "timestamp": "March 13, 2025 7:56 PM AWST",
            "datetime": "1741867005",
            "relative_time": "11 days ago"
          },
          {
            "text": "Bummed to see that the \"Your message in-game\" isn't included with the handsigned collector's editions like it is for the handsigned limited edition.",
            "commenter": "Brent Galloway",
            "timestamp": "March 13, 2025 12:26 AM AWST",
            "datetime": "1741796779",
            "relative_time": "12 days ago"
          },
          {
            "text": "Oh, this is a mistake and we can't fix It now in the reward information, but it will be also included. We'll put the info in the campaign and FAQ. Thanks for your comment!",
            "commenter": "Abraham Cozar",
            "timestamp": "March 13, 2025 12:32 AM AWST",
            "datetime": "1741797179",
            "relative_time": "12 days ago"
          },
          {
            "text": "Amazing! Thanks for clarifying!",
            "commenter": "Brent Galloway",
            "timestamp": "March 13, 2025 3:59 AM AWST",
            "datetime": "1741809570",
            "relative_time": "12 days ago"
          },
          {
            "text": "Thanks for the Update! Just changed my pledge :)",
            "commenter": "S.C. Lovelace",
            "timestamp": "March 13, 2025 12:24 AM AWST",
            "datetime": "1741796689",
            "relative_time": "12 days ago"
          },
          {
            "text": "Do you have a fix editor to publish this collector edition ?",
            "commenter": "Killerjumper",
            "timestamp": "March 12, 2025 11:43 PM AWST",
            "datetime": "1741794213",
            "relative_time": "12 days ago"
          },
          {
            "text": "Not yet! At least for the worldwide production, we're in conversations still",
            "commenter": "Abraham Cozar",
            "timestamp": "March 13, 2025 5:11 PM AWST",
            "datetime": "1741857070",
            "relative_time": "11 days ago"
          },
          {
            "text": "So the physical and the digital games are on the same platform then? Or can I chose the physical Switch version and the digital PC version?",
            "commenter": "Sten Seifert",
            "timestamp": "March 12, 2025 11:31 PM AWST",
            "datetime": "1741793489",
            "relative_time": "12 days ago"
          },
          {
            "text": "Hi! You can choose different platforms for your physical and digital game (I.e. Nintendo Switch for the physical copy and Xbox Series for the digital).",
            "commenter": "Abraham Cozar",
            "timestamp": "March 12, 2025 11:33 PM AWST",
            "datetime": "1741793622",
            "relative_time": "12 days ago"
          },
          {
            "text": "Cool, that is a deal then. Had a early physical pledge with digital and figureine addon, now I get even more for a bit less <3",
            "commenter": "Sten Seifert",
            "timestamp": "March 12, 2025 11:35 PM AWST",
            "datetime": "1741793738",
            "relative_time": "12 days ago"
          }
        ]
      },
      {
        "update_number": "UPDATE #4",
        "title": "Second Stretch Goal achieved: Physical Edition Upgrade",
        "creator": "Abraham Cozar\nMarch 10, 2025",
        "date": "March 10, 2025",
        "content": "Good start of the week, everyone!\nAnd there's no better way to do it than with an achievement: the Physical Edition Upgrade!\nNow all the physical editions (including Nintendo Switch, Nintendo Switch 2 and PlayStation 5) will include a printed booklet, like good old times hehe\nNote: the booklet won’t be included as reward in digital format in any pledge, for now.\nNow it’s time to unveil the next Stretch Goal and take a look to what will be next…if you support the campaign enough!\nFishing Minigame - Fish like an Elusive!\nAnd you may be wondering: how can a tiny being catch something that is probably bigger than you? Well, while we have yet to design this minigame, we can share our intentions.\nOne of the many things we are proud of about Mika and the Witch's Mountain is that we have proposed a fishing minigame that is very eye-catching and fun for players, and that is also more respectful of animals (yes, we know they are not real animals!).\nWe would like to follow this path in Elusive, so instead of trying to catch fish or other aquatic creatures, we are considering a type of junk fishing that allows you to get special resources.\nMaybe magnet fishing? Hook diving? We will share more information when the time comes.\nLet’s hit the next one!",
        "url": "https://www.kickstarter.com/projects/abraham-cozar/elusive/posts/4333377",
        "likes_count": 65,
        "comments_count": 8,
        "comments": [
          {
            "text": "Totally dig the idea of 'Resource Fishing'... that really does feel like an underexplored concept. Could have Tiers of Progression to it as well from the humble Hook attempting to literally hook basic lewt like Buttons floating on the surface to Magnet Fishing to try to nab useful metallic stuff that woulda been heavy and naturally float to the bottom of the Water to maybe something really high tier, like a Baby Sub with Wireless Camera, or a Elusive Tech equivalent... :D (Bet Baby Sub Fishing would be one way for Zoe to go to really flex her Resource Prowess and well earned Status late game!)",
            "commenter": "Tyrax Lightning",
            "timestamp": "March 12, 2025 7:35 AM AWST",
            "datetime": "1741736124",
            "relative_time": "13 days ago"
          },
          {
            "text": "Some ideas are a little out of our league, but overall, are awesome ideas, thank you so much!",
            "commenter": "Abraham Cozar",
            "timestamp": "March 12, 2025 4:41 PM AWST",
            "datetime": "1741768860",
            "relative_time": "12 days ago"
          },
          {
            "text": "Love the magnet fishing angle.",
            "commenter": "Yvonne Huby",
            "timestamp": "March 11, 2025 5:43 AM AWST",
            "datetime": "1741642999",
            "relative_time": "14 days ago"
          },
          {
            "text": "I love the idea of magnet fishing for resources/ supplies.",
            "commenter": "Penny James VanDieren",
            "timestamp": "March 11, 2025 5:32 AM AWST",
            "datetime": "1741642363",
            "relative_time": "14 days ago"
          },
          {
            "text": "Although if it's a magnet then it should only work on metal. I know we could just ignore that for game logic but I like when game mechanics take asuch physics into account as they can. So something more like Rex in Xenoblade Chronicles 2 where you dive off with a Bungie cord and come back with stuff appeals to me more.",
            "commenter": "Metazoxan No. 60187",
            "timestamp": "March 11, 2025 9:00 PM AWST",
            "datetime": "1741698009",
            "relative_time": "13 days ago"
          },
          {
            "text": "Hmm... possible idea: Maybe the Hook upgrades into a Magnetized Hook...? :D",
            "commenter": "Tyrax Lightning",
            "timestamp": "March 16, 2025 3:42 AM AWST",
            "datetime": "1742067753",
            "relative_time": "9 days ago"
          },
          {
            "text": "Hi! There are no Xbox physical edition, we're going to make the Nintendo Switch, Nintendo Switch 2 and PlayStation 5 physical editions. Thank you!",
            "commenter": "Abraham Cozar",
            "timestamp": "March 11, 2025 3:36 PM AWST",
            "datetime": "1741678598",
            "relative_time": "13 days ago"
          },
          {
            "text": "I see. Slightly disappointed we aren't fishing Goku style :p But junk fishing works. Reminds me of Divers in Xenoblade Chronicles 2.",
            "commenter": "Metazoxan No. 60187",
            "timestamp": "March 10, 2025 9:44 PM AWST",
            "datetime": "1741614251",
            "relative_time": "14 days ago"
          }
        ]
      },
      {
        "update_number": "UPDATE #3",
        "title": "Second Stretch Goal achieved: Mice Side Quest",
        "creator": "Abraham Cozar\nMarch 8, 2025",
        "date": "March 8, 2025",
        "content": "You have put your foot on the accelerator and you are not going to stop, uh? Well, let's go for it! 🏎️💨\nThe support Elusive is receiving is literally unbelievable and that only makes us want to give our all with this new adventure. So the Mice Quest will be included now in the development roadmap!\nNow we are going to put the focus on something that had a spectacular reception in the campaign of Mika and the Witch's Mountain and that is the booklet of the physical edition.\nNew Stretch Goal Unlocked: Physical Edition Upgrade!\nAs gamers, we have suffered the sadness of opening the box of a newly purchased game and finding the cartridge or disc inside an empty box. Oh, the good old days when there was an instruction and curiosities manual included!\nSupport it and we will succeed in creating a physical edition for Nintendo Switch, Nintendo Switch 2 and PlayStation 5 that truly stands out in your physical collection and that we will be proud of.\nOur Discord community is having a great time now with the campaign, so join us to chat about Elusive and other funny things!\nHave a good raid!",
        "url": "https://www.kickstarter.com/projects/abraham-cozar/elusive/posts/4331556",
        "likes_count": 66,
        "comments_count": 8,
        "comments": [
          {
            "text": "More cute friends in our life? Yes please! :)",
            "commenter": "Tyrax Lightning",
            "timestamp": "March 9, 2025 7:45 AM AWST",
            "datetime": "1741477554",
            "relative_time": "16 days ago"
          },
          {
            "text": "Always! hehe",
            "commenter": "Abraham Cozar",
            "timestamp": "March 10, 2025 5:38 PM AWST",
            "datetime": "1741599520",
            "relative_time": "14 days ago"
          },
          {
            "text": "HECK YES!! Love me some mice.",
            "commenter": "Bennett",
            "timestamp": "March 9, 2025 4:14 AM AWST",
            "datetime": "1741464850",
            "relative_time": "16 days ago"
          },
          {
            "text": "will there be a digital add on of the booklet? Since there’s only a physical copy available as early bird",
            "commenter": "Jessica Bruzzese",
            "timestamp": "March 9, 2025 12:50 AM AWST",
            "datetime": "1741452638",
            "relative_time": "16 days ago"
          },
          {
            "text": "Hi Jessica! The booklet will be added in all the physical copies, no worries, but not for now in digital format, sorry.",
            "commenter": "Abraham Cozar",
            "timestamp": "March 10, 2025 5:39 PM AWST",
            "datetime": "1741599588",
            "relative_time": "14 days ago"
          },
          {
            "text": "Wouldn't fishing be rather dangerous for tiny people? ;p I'm generally not a big fan of fishing minigames. But I'm rather curious how it would be done in this context. So fingers crossed momentum doesn't stop before that.",
            "commenter": "Metazoxan No. 60187",
            "timestamp": "March 8, 2025 4:56 AM AWST",
            "datetime": "1741380989",
            "relative_time": "17 days ago"
          },
          {
            "text": "What if we \"fish\" for things like dust mites, tardigrades or different types of plankton?",
            "commenter": "Bennett",
            "timestamp": "March 9, 2025 4:15 AM AWST",
            "datetime": "1741464918",
            "relative_time": "16 days ago"
          },
          {
            "text": "We're still working on the design and the challenge itself! We don't want to harm animals (like we did in Mika and the Witch's Mountain with the fishbowls) so, we'll see :D",
            "commenter": "Abraham Cozar",
            "timestamp": "March 10, 2025 5:40 PM AWST",
            "datetime": "1741599657",
            "relative_time": "14 days ago"
          }
        ]
      },
      {
        "update_number": "UPDATE #2",
        "title": "1st Stretch Goal achieved: New Zoe’s Cloak",
        "creator": "Abraham Cozar\nMarch 6, 2025",
        "date": "March 6, 2025",
        "content": "Hello again!\nThis is getting fast, thank you for smashing the first Stretch Goal ♥️\nNow Zoe will have a New Cloak! And not just for looking good, but with some pretty cool effects hehe\nIt's called The Lizard Cloak, so you can imagine where it's going, but what do you think it will look like? Green? With scales? WITH A TAIL?\nWell, we should be unveiling the next Stretch Goal so…brrrrrrrr…Here it is:\nNew Animal Side Quest — Help the Mice!✨\nPerhaps you noticed a little mouse walking around at the Red Watering Can (and even on the cover of the game 😳) and we were wondering if this little friend could play a more interesting role in the Elusive beyond “a cute addition”.\nWanna know what we thought about involving them in the game? Let’s push the campaign to the next goal!\nYou can also join our Discord server to chat about Elusive and other Chibig games.\nWatch your steps!",
        "url": "https://www.kickstarter.com/projects/abraham-cozar/elusive/posts/4330462",
        "likes_count": 48,
        "comments_count": 5,
        "comments": [
          {
            "text": "Totally wouldn't say no to mousey friends. :)",
            "commenter": "Tyrax Lightning",
            "timestamp": "March 9, 2025 6:58 AM AWST",
            "datetime": "1741474709",
            "relative_time": "16 days ago"
          },
          {
            "text": "I tried to join the discord but it says invited are paused.",
            "commenter": "Holly",
            "timestamp": "March 9, 2025 1:16 AM AWST",
            "datetime": "1741454202",
            "relative_time": "16 days ago"
          },
          {
            "text": "Hi. After some scam attempts, we needed to pause the invitations on the weekend, but it should be working again now. Thank you!",
            "commenter": "Abraham Cozar",
            "timestamp": "March 10, 2025 5:38 PM AWST",
            "datetime": "1741599497",
            "relative_time": "14 days ago"
          },
          {
            "text": "Brilliant! I’m hoping We smash through to the physical edition upgrade!",
            "commenter": "Samuel Burnett",
            "timestamp": "March 7, 2025 4:13 PM AWST",
            "datetime": "1741335187",
            "relative_time": "17 days ago"
          },
          {
            "text": "Hopefully the lizard cloak looks like it was made from the actual skin of a lizard that once lived around the house lol",
            "commenter": "Heath Cady",
            "timestamp": "March 6, 2025 11:00 PM AWST",
            "datetime": "1741273256",
            "relative_time": "18 days ago"
          }
        ]
      },
      {
        "update_number": "UPDATE #1",
        "title": "WOOHOO! WE DID IT!",
        "creator": "Abraham Cozar\nMarch 6, 2025",
        "date": "March 6, 2025",
        "content": "We can now say it out loud: ELUSIVE IS GOING TO HAPPEN.\nYour support will never cease to amaze us. Every new game and every new campaign, you are there supporting us and sharing the excitement for indie games. As simple as this: THANK YOU SO MUCH ❤️\nBut this is just the beginning, what's next?\nNew goal: New Zoe's Cloak - 80K\nCharacter customization is something we know you like (and, not gonna lie, we also do), but what if this cloak had additional functions or effects?\nHelp us reach our goal!\nRemember that these two pledges are discounted for a limited time and that you can share the campaign with your friends to join Zoe's first raid: a Kickstarter campaign✨\nYou can also join our Discord server to talk to the community about Elusive and other Chibig games.\nSee you in the next update!",
        "url": "https://www.kickstarter.com/projects/abraham-cozar/elusive/posts/4329929",
        "likes_count": 45,
        "comments_count": 0,
        "comments": []
      }
    ]
  }
}