{
  "url": "https://www.kickstarter.com/projects/linknlink/emotion-ultra-one-device-for-multi-smart-home-automations",
  "updates": {
    "count": 3,
    "content": [
      {
        "update_number": "UPDATE #3",
        "title": "Detection Range and Motion Tracking Tested – eMotion Ultra Meets Expectations!",
        "creator": "LinknLink Pty Ltd\nJanuary 24, 2025",
        "date": "January 24, 2025",
        "content": "Dear eMotion Ultra Pledgers and Smart Home Enthusiasts,\nThe development of eMotion Ultra is progressing smoothly, and we’ve successfully tested its detection range and motion tracking performance. You can view the test video in the \"Product Development\" section or watch it on YouTube:\nIt reliably detects presence up to 7 meters (30 feet). Additionally, the video demonstrates the fast and smooth response to motion, with eMotion Ultra capable of tracking up to 4 people simultaneously.\nThank you for your continued support. We are excited to bring you even more features and surprises in the future!\nBest regards,\nLinknLink",
        "url": "https://www.kickstarter.com/projects/linknlink/emotion-ultra-one-device-for-multi-smart-home-automations/posts/4298760",
        "likes_count": 9,
        "comments_count": 0,
        "comments": []
      },
      {
        "update_number": "UPDATE #2",
        "title": "Exciting News: eMotion Ultra Now Doubles as a BLE Hub!",
        "creator": "LinknLink Pty Ltd\nJanuary 23, 2025",
        "date": "January 23, 2025",
        "content": "Say Goodbye to Extra Hubs – Connect Your BLE Sensors Directly!\nWe’re thrilled to share some fantastic news: the eMotion Ultra will be equipped with a powerful BLE hub feature! With this upgrade, there’s no need for an extra BLE hub – you can connect up to 16 BLE sensors directly to your eMotion Ultra.\nWhat can you connect?\nBLE Temperature and Humidity Sensor (with screen display) from LinknLink\nBLE Contact Sensor from LinknLink\nEnjoy a maximum BLE range of 30 meters (98 feet), making it easier than ever to monitor your space with seamless connectivity.\nTo thank for the support from our fans, we won't increase the price for the added great feature but it may save you another $20 for a hub.\nThis is just the beginning of our commitment to innovation and enhancing your smart home experience.\nMake your pledge now and choose the accessories that best suit your needs!\nThank you for being part of the LinknLink journey. Stay tuned for more exciting updates!\nBest Regards\nLinknLink",
        "url": "https://www.kickstarter.com/projects/linknlink/emotion-ultra-one-device-for-multi-smart-home-automations/posts/4298190",
        "likes_count": 7,
        "comments_count": 2,
        "comments": [
          {
            "text": "Is the BLE hub limited to 2 devices? Could I connect other, non-LinknLink BLE devices?",
            "commenter": "Martin Lomax",
            "timestamp": "January 23, 2025 6:31 PM AWST",
            "datetime": "1737628282",
            "relative_time": "about 1 month ago"
          },
          {
            "text": "Hi Martin, The eMotion Ultra can connect to a maximum of 30 BLE devices, but these devices must be from LinknLink. Unfortunately, BLE does not currently have a unified smart home standard, so it’s not a matter of us not wanting to ensure compatibility—it’s simply a limitation that no one can overcome at this time. Thanks",
            "commenter": "LinknLink Pty Ltd",
            "timestamp": "January 23, 2025 6:40 PM AWST",
            "datetime": "1737628803",
            "relative_time": "about 1 month ago"
          }
        ]
      },
      {
        "update_number": "UPDATE #1",
        "title": "Technology Upgrade Announcement: eMotion Ultra Adopts 2nd-Gen mmWave Radar Module",
        "creator": "LinknLink Pty Ltd\nJanuary 23, 2025",
        "date": "January 23, 2025",
        "content": "Dear Pledgers and Smart Home Enthusiasts,\nOver the past few months, our team has made comprehensive improvements, refining everything from the antenna’s physical design to the signal processing architecture. Today, we are excited to introduce the eMotion Ultra will be powered by the 2nd-Gen 60GHz mmWave radar module, expertly designed by the LinknLink team!\nThe upgrade from our 1st-Gen 60GHz mmWave Radar technology focuses on optimizing antenna design and enhancing transmission efficiency.\nTechnical Improvements:\nAntenna Optimization: The new 2T2R antenna design reduces signal scattering, suppresses multipath interference, and improves weak signal detection at long distances. It maintains a ±60° beam angle, with better sensitivity at the edges.\nIncreased Power Efficiency: The effective radiated power (ERP) is increased by 20%, while maintaining 12dBm transmission power. A stable power supply ensures consistent performance even in fluctuating conditions.\nCo-optimized Algorithms and Hardware: Upgraded signal processing algorithms accurately identify static and micro-motion targets, while dynamic interference shielding filters out fixed interferences. The low-power mode reduces consumption to 2.5mA during idle times.\nTest Results: Internal tests show a 7-meter detection range with 98% accuracy for static targets, outperforming the first-gen model in complex environments.\nCommitment: eMotion Ultra is a hardware upgrade and a step towards smarter, seamless interaction. We’ll continue to improve the product with future OTA updates. Thank you for your support - eMotion Ultra is nearing mass production, promising an enhanced smart experience.\nBest Regards\nLinknLink Team",
        "url": "https://www.kickstarter.com/projects/linknlink/emotion-ultra-one-device-for-multi-smart-home-automations/posts/4297387",
        "likes_count": 7,
        "comments_count": 0,
        "comments": []
      }
    ]
  }
}