{
  "url": "https://www.kickstarter.com/projects/eryone/eryone-thinker-x400-and-3d-printing-farm",
  "campaign_details": {
    "funding_period_text": "Funding period\nFeb 25 2025 - Apr 11 2025 (45 days)",
    "funding_start_date": "2025-02-25T00:00:00.000000Z",
    "funding_end_date": "2025-04-11T21:11:54.477495Z",
    "funding_duration_days": 45,
    "pledged_amount": "S$ 656,964",
    "funding_goal": "S$ 8,600",
    "backers_count": "325",
    "days_left": 18,
    "project_launch_text": "Project launches FEBRUARY 25, 2025"
  },
  "updates": {
    "count": 4,
    "content": [
      {
        "update_number": "UPDATE #4",
        "title": "Exciting Update: Stretch Goals Announced!",
        "creator": "Eryone\nMarch 17, 2025",
        "date": "March 17, 2025",
        "content": "Hi Thinker X400 Backers,\n  We are thrilled to share that we are approaching our $500,000 stretch goal! As a token of our appreciation, we will be giving away a free PEI build plate to all eligible backers. This high-quality surface enhances print adhesion and ensures a smooth printing experience.\n  But the excitement doesn't stop there! We have even more rewards waiting to be unlocked at $800,000 and $1,000,000. These additional gifts will be revealed soon, and we believe they will truly surprise you. Thank you for your continued enthusiasm and support as we reach these milestones together!\n    New Review from Prince Armory\nIn addition, we're excited to announce a recent review from YouTuber Prince Armory. He has conducted a thorough evaluation of the Thinker X400, providing insights and feedback that you won't want to miss. Check out his review here: Watch Now.\n    Thank you once again for being a vital part of our journey. Your support means the world to us!\n  Best regards,\nThe Eryone Team",
        "url": "https://www.kickstarter.com/projects/eryone/eryone-thinker-x400-and-3d-printing-farm/posts/4339020",
        "likes_count": 9,
        "comments_count": 0,
        "comments": []
      },
      {
        "update_number": "UPDATE #3",
        "title": "We Heard You! Active Heater is Now Available",
        "creator": "Eryone\nMarch 6, 2025",
        "date": "March 6, 2025",
        "content": "Hi Dear Thinker X400 Backers,\n  We've received numerous comments about adding an Active Heater, and we're thrilled to announce it's now available as an add-on for our backers. At a room temperature of 20°C, the chamber temperature reaches 50-60°C without the heater. With the Active Heater, it can rise to 60-70°C. During the Kickstarter campaign, the Active Heater is priced at just $14, with a future retail price of $19.\n    Regarding Stretch Goals \nWe have noted your suggestions and are actively discussing stretch goal ideas. We’ll be announcing them officially in a few days!\nThank you again for your fantastic suggestions and support. Stay tuned for our next update!\n  Best,\nThe ERYONE Team",
        "url": "https://www.kickstarter.com/projects/eryone/eryone-thinker-x400-and-3d-printing-farm/posts/4329875",
        "likes_count": 9,
        "comments_count": 3,
        "comments": [
          {
            "text": "come ordianre il riscaldatore?",
            "commenter": "Raffaele Greco",
            "timestamp": "March 8, 2025 1:34 AM AWST",
            "datetime": "1741368856",
            "relative_time": "17 days ago"
          },
          {
            "text": "Ciao! Puoi andare al tuo impegno nel tuo account e aggiungere il riscaldatore lì",
            "commenter": "Eryone",
            "timestamp": "March 11, 2025 2:01 PM AWST",
            "datetime": "1741672901",
            "relative_time": "13 days ago"
          },
          {
            "text": "Great news!",
            "commenter": "James Harry",
            "timestamp": "March 6, 2025 12:31 AM AWST",
            "datetime": "1741192263",
            "relative_time": "19 days ago"
          }
        ]
      },
      {
        "update_number": "UPDATE #2",
        "title": "New Add-on: Nozzle Pack is now Available",
        "creator": "Eryone\nFebruary 28, 2025",
        "date": "February 28, 2025",
        "content": "Dear Thinker X400 Backers,\n  We’ve received numerous requests to add a Nozzle Pack featuring various sizes: 0.4mm, 0.6mm, 0.8mm, and 1.0mm. Thank you for your fantastic suggestions! After careful consideration, we are excited to announce that the Nozzle Pack is now available as an add-on!\n  How to Add the Nozzle Pack\nStep 1: Visit the Thinker X400 campaign page\n  Step 2: Click the ''Manage your pledge\" button\n  Step 3: On the following page, select \"Change your pledge\" and add Nozzle Pack to your reward\n  Share & Earn 5% Cashback\nJoin our Kickbooster program by referring the Thinker X400 to your friends! You will receive 5% cashback from every referral. Join Kickbooster Now: https://eryone-thinker-x400-high-speed-3d.kickbooster.me/boost/eryone-thinker-x400-high-speed\n  Gathering Stretch Goal Ideas\nWe’ve also taken note of your comments about stretch goals. If you have any great ideas, please share them in the comments on our page! We’d love to hear your suggestions!\n  Thank you again for your love and support.\n  Best,\nERYONE Team",
        "url": "https://www.kickstarter.com/projects/eryone/eryone-thinker-x400-and-3d-printing-farm/posts/4325451",
        "likes_count": 3,
        "comments_count": 1,
        "comments": [
          {
            "text": "YAAAAAAS!!! Making this update right away, thank you soooo much 🙏🙏🙏",
            "commenter": "Waldo Broodrÿk",
            "timestamp": "February 28, 2025 11:08 PM AWST",
            "datetime": "1740755333",
            "relative_time": "24 days ago"
          }
        ]
      },
      {
        "update_number": "UPDATE #1",
        "title": "Thank You for Being Part of Our Journey",
        "creator": "Eryone\nFebruary 26, 2025",
        "date": "February 26, 2025",
        "content": "Hi Thinker X400 Backers,\n  We are grateful for your support of the ERYONE Thinker X400! After two years of development and one year of rigorous in-house testing, we are excited to announce that the Thinker X400 is finally ready for public release. Many of you have been with us from the very beginning, and your unwavering enthusiasm has been crucial in bringing this project to life.\n  We have officially kicked off small-batch production, which is progressing smoothly as planned. Mass production will commence in April, with global shipping starting in late April. Local deliveries are scheduled for around May and June.\n    As a token of our appreciation, we’re offering lifetime benefits to our campaign backers, including a lifetime discounted price of $1999 for the Thinker X400 (shipping fees and taxes included) and a lifetime 10% discount on all filaments from ERYONE, only on https://eryone3d.com/. Coupon codes will be sent to you at the end of the campaign, along with a survey to collect your shipping information.\n  Thank you once again for your incredible support!\n  Best,\nThe ERYONE Team",
        "url": "https://www.kickstarter.com/projects/eryone/eryone-thinker-x400-and-3d-printing-farm/posts/4322727",
        "likes_count": 5,
        "comments_count": 2,
        "comments": [
          {
            "text": "I wish you a good job and a great production, it will certainly be very useful to my company",
            "commenter": "Angelo",
            "timestamp": "February 26, 2025 2:54 AM AWST",
            "datetime": "1740509640",
            "relative_time": "27 days ago"
          },
          {
            "text": "So I'm backer #7 and 7 is my favorite number, so I'm doubly delighted to be taking part in this project. The Eryone X400 can undoubtedly bridge, at least in part, the gap between home and industrial printers, offering professionals with modest but regular production needs a new way of 3D printing. The next step, however, is to establish a network of reliable resellers, installers, trainers and local repair outlets, if this machine is to be a success in this market segment. The Eryone team knows it can already count on me.",
            "commenter": "Fred BOURHIS",
            "timestamp": "February 26, 2025 1:39 AM AWST",
            "datetime": "1740505154",
            "relative_time": "27 days ago"
          }
        ]
      }
    ]
  }
}