{
  "url": "https://www.kickstarter.com/projects/albertandsimeon/feco-the-footprint-economy",
  "campaign_details": {
    "funding_period_text": "Funding period\nFeb 04 2025 - Mar 27 2025 (51 days)",
    "funding_start_date": "2025-02-04T00:00:00.000000Z",
    "funding_end_date": "2025-03-27T20:22:02.979842Z",
    "funding_duration_days": 51,
    "pledged_amount": "S$ 0",
    "funding_goal": "S$ 36,172",
    "backers_count": "0",
    "days_left": 3,
    "project_launch_text": "Project launches FEBRUARY 4, 2025"
  },
  "updates": {
    "count": 3,
    "content": [
      {
        "update_number": "UPDATE #3",
        "title": "Invest in the Future: Footprint Economy Offers Equity Stake!",
        "creator": "Albert and Simeon\nFebruary 5, 2025",
        "date": "February 5, 2025",
        "content": "We are incredibly excited to announce that our Minimum Viable Product (MVP) for the Footprint Economy platform is officially complete! This is a massive milestone. We're so proud of what we've built so far and can't wait to share it with you.\nNow, the real work begins! With the MVP in hand, we're focusing on securing the investment needed to bring the Footprint Economy to its full potential. We're actively seeking developers to join our team and help us scale the platform for launch. If you know any talented devs passionate about sustainability and innovative tech, please send them our way!\nWe've also just introduced a new, limited-edition reward tier for our most dedicated backers: the Founders' Circle! Only 10 packages are available at the $500 level, and these backers will receive a 1% stake in the company. This is a unique opportunity to be a part of the Footprint Economy's future.\nThank you again for your belief in our vision. Stay tuned for more updates!",
        "url": "https://www.kickstarter.com/projects/albertandsimeon/feco-the-footprint-economy/posts/4307270",
        "likes_count": 0,
        "comments_count": 0,
        "comments": []
      },
      {
        "update_number": "UPDATE #2",
        "title": "What Problems Does FECO Solve?",
        "creator": "Albert and Simeon\nFebruary 5, 2025",
        "date": "February 5, 2025",
        "content": "Retail Investments Often Fail: Over 70% of retail investments end in total loss. FECO offers an alternative—investing in real-world impact instead of speculative risks.\nImpact Without Empty Promises: Traditional investments chase profit. With FECO, your money fuels measurable change—leaving the planet better than we found it.\nBreaking Value Chain Inequality: Today’s global value chains benefit a few at the cost of many. FECO shifts this dynamic, creating a system where impact and equity come first.\nImpact Investing, Made Simple: As impact investing gains traction, FECO provides a transparent, accessible way to align your investments with your values.\nWe’ve put our hearts into this, and today, we invite you to be part of it.Let’s create a future where every contribution leaves a meaningful footprint.",
        "url": "https://www.kickstarter.com/projects/albertandsimeon/feco-the-footprint-economy/posts/4306664",
        "likes_count": 0,
        "comments_count": 0,
        "comments": []
      },
      {
        "update_number": "UPDATE #1",
        "title": "Domain Secured + MVP in Development!",
        "creator": "Albert and Simeon\nFebruary 4, 2025",
        "date": "February 4, 2025",
        "content": "Gretings!\nWe're thrilled to share a couple of exciting updates on our Kickstarter project! Your support has been absolutely incredible, and we're making significant progress towards bringing our vision to life.\nFirst, we're incredibly excited to announce that we've officially secured our domain name: https://footprint-economy.com/! This is a huge step forward, giving us a permanent home for the platform we're building. \nSecond, we're heads-down working on the Minimum Viable Product (MVP)! We're focusing on the core features you've helped us prioritize, and we're making great strides. We're laying the foundation for a truly innovative platform, and we can't wait to share a sneak peek with you soon. We'll keep you posted on our MVP development milestones and timelines.\nThank you again for your continued belief in this project. Your support means the world to us, and we're so excited to continue this journey with you.\nStay tuned for more updates!\nBest,\nSimeon",
        "url": "https://www.kickstarter.com/projects/albertandsimeon/feco-the-footprint-economy/posts/4306271",
        "likes_count": 0,
        "comments_count": 0,
        "comments": []
      }
    ]
  }
}