{
  "url": "https://www.kickstarter.com/projects/feiyutech/feiyu-scorp-m2-mobile-ultimate-3-axis-videography-gimbal",
  "campaign_details": {
    "funding_period_text": "Funding period\nFeb 27 2025 - Apr 13 2025 (45 days)",
    "funding_start_date": "2025-02-27T00:00:00.000000Z",
    "funding_end_date": "2025-04-13T21:22:20.870094Z",
    "funding_duration_days": 45,
    "pledged_amount": "S$ 112,111",
    "funding_goal": "S$ 6,708",
    "backers_count": "351",
    "days_left": 20,
    "project_launch_text": "Project launches FEBRUARY 27, 2025"
  },
  "updates": {
    "count": 1,
    "content": [
      {
        "update_number": "UPDATE #1",
        "title": "Exclusive Giveaway 丨Earned 10% Cashback with Kickbooster Program",
        "creator": "FeiyuTech\nFebruary 28, 2025",
        "date": "February 28, 2025",
        "content": "Dear Feiyu Backers,\nFor All deposit backers: please check the email you used when placing your deposit order. The Secret Perk link has been sent to you. By clicking the link in the email, you can access Kickstarter and secure the lowest discount for the Feiyu SCORP M2-Mobile.\nExciting Giveaway Event!\nAlso, to show our appreciation for your early support, the Team is hosting a special giveaway! We’re giving away a Bagsmart valued at $19.99 to a total of 50 lucky backers who participate in our event.\nHere’s how to enter:\nStep 1: Back our campaign.\nStep 2: Click the Facebook Logo and share Feiyu on social media.\nStep 3: Leave a comment in the Comments Section and let us know, \"Why are you excited about Feiyu?\"\nDon’t forget to include your backer number and #Feiyu. \nPlease note that you need to complete all steps to receive a full entry into the giveaway. This event is open to Feiyu backers only.\nThe giveaway winners will be announced in our updates. Our team will ship the giveaway along with your Feiyu reward(s) at the time of delivery.\nThank you again for joining us on this exciting journey! We’re thrilled to have you with us.\nJoin Kickbooster to get 10% Cashback\nWe are thrilled to unveil our referral program on Kickbooster, enabling you to reap rewards by spreading the word about our project! Simply by sharing our campaign with your friends, family, and followers, you can earn a 10% cashback from every pledge.\nHere is how it works:\n1. Visit our Referral Program Page at https://feiyu-scorp-m2-flagship-ai-tracking.kickbooster.me/boost/feiyu-scorp-m2-flagship-ai and sign up.\n2. Confirm your email address through the confirmation email sent to you. Sign in to the Kickbooster account.\n3. Copy the unique referral link and share it on social media.\n4. Track your referrals and commissions from your dashboard.\nIf you have any questions, feel free to reach out to us. We appreciate your support and look forward to helping you earn cash back.\nCheers,\nFeiyu Team",
        "url": "https://www.kickstarter.com/projects/feiyutech/feiyu-scorp-m2-mobile-ultimate-3-axis-videography-gimbal/posts/4325092",
        "likes_count": 2,
        "comments_count": 7,
        "comments": [
          {
            "text": "I am excited about Feiyu because this is not only one of the most popular gimbal's brands but also the great of technology on their products such as AI-powered auto-tracking, automatic panoramas make it creates a lot of wonderful videos easily and amazing images as well. Additionally, those products from Feiyu have ergonomic design and its lightweight helps me comfort for long shoots with professional quality contents. Honestly, this is a fantastic brand for the best choice in my opinion. My backer #39 My Facebook Clover Trang Nguyen #Feiyu #feiyutech",
            "commenter": "Randy",
            "timestamp": "March 13, 2025 4:34 PM AWST",
            "datetime": "1741854875",
            "relative_time": "11 days ago"
          },
          {
            "text": "Hi Randly, Thank you so much for your kind words and support! It means a lot to us to hear how much you appreciate Feiyu and its technology. We’re excited to bring you the SCORP M2 and can’t wait to see the amazing content you create with it.",
            "commenter": "FeiyuTech Support",
            "timestamp": "March 13, 2025 6:56 PM AWST",
            "datetime": "1741863384",
            "relative_time": "11 days ago"
          },
          {
            "text": "How can I choose to order a BLACK finish M2-Mobile?",
            "commenter": "Attila Fovenyessy",
            "timestamp": "March 2, 2025 11:09 PM AWST",
            "datetime": "1740928197",
            "relative_time": "22 days ago"
          },
          {
            "text": "Hi Attila, We hear you on the color selection, and we’ll check with the team to see how we can get you the black finish. We’ll follow up as soon as we have an update! Appreciate your support!",
            "commenter": "FeiyuTech Support",
            "timestamp": "March 3, 2025 9:20 AM AWST",
            "datetime": "1740964814",
            "relative_time": "22 days ago"
          },
          {
            "text": "Hi Attila, As for color selection, the team will be sending out a backer survey within 7-14 days after the campaign ends, where you can choose your preferred color, including the black finish. Keep an eye out for it—we appreciate your support!",
            "commenter": "FeiyuTech Support",
            "timestamp": "March 3, 2025 10:08 AM AWST",
            "datetime": "1740967698",
            "relative_time": "21 days ago"
          },
          {
            "text": "Where can I find my Backer Number?",
            "commenter": "Eric Choi",
            "timestamp": "March 1, 2025 5:50 AM AWST",
            "datetime": "1740779419",
            "relative_time": "24 days ago"
          },
          {
            "text": "Hi Eric, You can find your backer number by logging into Kickstarter, going to the project page, and clicking ‘View Pledge’ at the top. Your backer number will be listed in the pledge details. As per our records, your backer number is 14. If you need further assistance, feel free to reach out. Thank you for your support!",
            "commenter": "FeiyuTech Support",
            "timestamp": "March 3, 2025 9:24 AM AWST",
            "datetime": "1740965092",
            "relative_time": "21 days ago"
          }
        ]
      }
    ]
  }
}