{
  "url": "https://www.kickstarter.com/projects/1191148678/feniska-the-smart-litter-box-tracker",
  "campaign_details": {
    "funding_period_text": "Funding period\nFeb 20 2025 - Mar 22 2025 (30 days)",
    "funding_start_date": "2025-02-20T05:10:54-05:00",
    "funding_end_date": "2025-03-22T05:10:54-04:00",
    "funding_duration_days": 30,
    "pledged_amount": "S$ 40,478",
    "funding_goal": "S$ 14,469",
    "backers_count": "128",
    "days_left": 9
  },
  "updates": {
    "count": 1,
    "content": [
      {
        "update_number": "UPDATE #1",
        "title": "We Are Cancelling Our Kickstarter Campaign",
        "creator": "Sonita Soth\nMarch 13, 2025",
        "date": "March 13, 2025",
        "content": "Dear Backers,\nFirst and foremost, we want to express our deepest gratitude for your support and belief in our vision. Your enthusiasm and trust in our project mean the world to us. \nHowever, after careful consideration and with a heavy heart we had to make the difficult decision to cancel our Kickstarter campaign and will not be taking any funds from our backers.💔\nWhy We Made This Decision\nBringing this product to life has been an incredible journey, but we have encountered several unexpected challenges that significantly impact our ability to deliver as planned.\nIncreased Production Costs: Due to unforeseen fluctuations in raw material prices and manufacturing expenses, our production costs have risen dramatically. This has made it difficult to maintain our planned budget without compromising quality.\nCustoms & Logistics Issues: Recent changes in international shipping regulations and customs procedures have caused unexpected delays and additional expenses, further complicating our timeline.\nQuality Concerns with the Latest Sample: While testing our latest production sample, we identified critical quality issues that do not meet our standards. Addressing these concerns requires additional development time and coordination with our suppliers.\nGiven these challenges, we can no longer confidently commit to delivering in July as originally planned. Rather than moving forward with uncertainty, we believe the most responsible decision is to pause and resolve these issues before continuing. Given the current market conditions, we do not want to put any strain on our backers by making you wait indefinitely or compromising on the quality of the product you supported.\nThank You for Your Support 🙏\nWe know this may be disappointing news, and we sincerely apologize for any inconvenience. Your support has meant everything to us, and we hope to keep you updated on our progress as we work through these challenges.\nIf you have any questions, feel free to reach out—we’re always happy to hear from you.\nThank you again for being part of this journey with us. We hope to have exciting updates for you in the future! 💖\nWith appreciation,\nThe Feniska Team",
        "url": "https://www.kickstarter.com/projects/1191148678/feniska-the-smart-litter-box-tracker/posts/4336105",
        "likes_count": 6,
        "comments_count": 0,
        "comments": []
      }
    ]
  }
}