{
  "url": "https://www.kickstarter.com/projects/fosiaudio/fosi-audio-k7-gaming-headphone-amp-dac",
  "campaign_details": {
    "funding_period_text": "Funding period\nJan 15 2025 - Feb 24 2025 (40 days)",
    "funding_start_date": "2025-01-15T09:00:19-05:00",
    "funding_end_date": "2025-02-24T09:00:19-05:00",
    "funding_duration_days": 40,
    "pledged_amount": "",
    "funding_goal": "HK$ 80,000",
    "backers_count": "621"
  },
  "updates": {
    "count": 3,
    "content": [
      {
        "update_number": "UPDATE #3",
        "title": "Important News on K7 Crowdfunding Campaign!",
        "creator": "Fosi Audio\nFebruary 25, 2025",
        "date": "February 25, 2025",
        "content": "Hello Backers,\n\nWe are excited to announce that our K7 crowdfunding project has ended on Kickstarter with great success! We couldn't have done it without your generous support and enthusiasm. Thank you so much for believing in us. \nImportant Step for Backers\nTo ensure a smooth shipping process, We will ask all backers to complete the survey :\n→How to find the survey?\nConfirm Your Shipping Information: confirm your Name, shipping address, phone number, and email address. This information is essential for us to communicate with you about the status of your reward, shipping details, and any other updates.\nShipping Begins around 15th March: we will ship out K7 around 15th March. Backers will receive an email with tracking information once their order has been shipped.\nKickstarter Late Pledge Option\nFor those who have missed the K7 Kickstarter campaign, we have good news!\nOur Kickstarter Late Pledge is still in progress. Welcome everyone to continue to join now. Don't miss this opportunity. \nIf your pledge is declined, please check the link below for help:\nhttps://help.kickstarter.com/hc/en-us/articles/115005133293-A-project-I-m-backing-just-succeeded-but-my-pledge-was-declined-What-do-I-need-to-do-next\n\nIf you have any questions, feel free to leave your comments and contact us!\n\nSupport email: marketing@fosiaudio.com\n\nDon’t forget to join our Facebook& Discord Community for future updates:\n\nFacebook community: https://www.facebook.com/groups/1601599234085206\nDiscord community: https://discord.com/channels/1316655652260548658/1319214127704571986\n\n\nBest regards,\nFosi Audio Team",
        "url": "https://www.kickstarter.com/projects/fosiaudio/fosi-audio-k7-gaming-headphone-amp-dac/posts/4322379",
        "likes_count": 14,
        "comments_count": 4,
        "comments": [
          {
            "text": "I had to redo my survey as I put my address in incorrectly. Hopefully that doesn't mess up my order",
            "commenter": "John Hines",
            "timestamp": "February 26, 2025 8:11 AM AWST",
            "datetime": "1740528672",
            "relative_time": "16 days ago"
          },
          {
            "text": "I feel like a kid on Christmas. Thank you guys for your hard work and congrats on the crowdfunding.",
            "commenter": "Brennan Cortez",
            "timestamp": "February 25, 2025 8:27 PM AWST",
            "datetime": "1740486459",
            "relative_time": "16 days ago"
          },
          {
            "text": "Jep also good comment...same feeling here but Brennan I will combine with my birthday im March 🌞",
            "commenter": "Mike Schmitkamp",
            "timestamp": "February 25, 2025 11:29 PM AWST",
            "datetime": "1740497391",
            "relative_time": "16 days ago"
          },
          {
            "text": "Done.....uhhhhh we are coming closer...guys one of my bangers for this year is coming ...the Fosi K7...funnily my G6 from Creative is almost dead...perfect fit! ❤",
            "commenter": "Mike Schmitkamp",
            "timestamp": "February 25, 2025 5:39 PM AWST",
            "datetime": "1740476374",
            "relative_time": "16 days ago"
          }
        ]
      },
      {
        "update_number": "UPDATE #2",
        "title": "Gaming Headset or HiFi Headphones + DAC/Amp? Fosi Audio K7, the Ultimate Audio Dilemma Solution!",
        "creator": "Fosi Audio\nFebruary 5, 2025",
        "date": "February 5, 2025",
        "content": "If you're a gamer who also loves high-quality audio, you've probably faced this question:\n👉 Should I buy a gaming headset for convenience or invest in audiophile headphones with a DAC/Amp for better sound quality?\nEach choice comes with trade-offs:\n× Gaming Headsets – Feature built-in mics, wireless connectivity, and low-latency gaming sound, but often compromise on audio fidelity.\n× Audiophile Headphones + DAC/Amp – Deliver superior sound quality and immersive HiFi audio, but lack gaming-focused features like precise positional sound tuning and built-in communication tools.\nSo, why choose one when you can have both?\n\nFosi Audio K7 is designed to bridge the gap between gaming and HiFi audio, combining the best of both worlds in a single device.\n✅ Low-latency, precise positional audio for FPS and competitive gaming\n✅ HiFi-grade sound quality with high-resolution audio decoding\n✅ Powerful output to drive both gaming headsets and audiophile headphones\n✅ Versatile connectivity – Supports USB, optical, and Bluetooth input options\nWhether you’re competing in intense battles or immersing yourself in music and movies, the Fosi Audio K7 adapts to your needs, making it the ultimate all-in-one audio solution.\n🔗 Get your K7 now before the campaign ends!\nWould you choose gaming headsets or audiophile headphones? Now, you don’t have to decide! \nLet us know your thoughts in the comments!!!",
        "url": "https://www.kickstarter.com/projects/fosiaudio/fosi-audio-k7-gaming-headphone-amp-dac/posts/4307273",
        "likes_count": 6,
        "comments_count": 1,
        "comments": [
          {
            "text": "Looking soooooooooooo forward to it! And it`s not far away anymore 🥰...hopefully 🤞",
            "commenter": "Mike Schmitkamp",
            "timestamp": "February 18, 2025 8:49 PM AWST",
            "datetime": "1739882943",
            "relative_time": "23 days ago"
          }
        ]
      },
      {
        "update_number": "UPDATE #1",
        "title": "A Big Thank You + Exciting Industry News!",
        "creator": "Fosi Audio\nJanuary 17, 2025",
        "date": "January 17, 2025",
        "content": "Dear K7 Backers,  \nThank you all for your incredible support! We’re thrilled to announce that our project reached its funding goal in just 1 hour! This achievement wouldn’t have been possible without your enthusiasm and trust. With 38 days remaining, we hope you’ll continue to follow our journey, share your thoughts, and help us spread the word about K7.  \nIf you have any other questions after receiving the package, please leave your comments and contact us!\nSupport email: support@fosiaudio.com\nFacebook page: https://www.facebook.com/FosiAudioHeadFi\nFacebook community: https://www.facebook.com/groups/1601599234085206\nMeet the HIDIZS ST2 PRO – The USB-C HiFi IEMs-DAC Combo Perfect for On-the-Go Premium Sound\nOn another note, as a brand committed to advancing the audio industry, we'd like to take a moment to recommendHidiZS ST2 Pro. We believe in collaboration and mutual growth, and HlDlZS shares our vision for delivering exceptional audio products.\nSuppose you want to upgrade your Hi-Res instant music journey without bulky or complicated devices. This all-in-one lEMs-DAC combo is perfect for on-the-go HiFi sound, no charging, no disconnects, just seamless plug-and-play convenience. Compatible with USB-C devices, including the iPhone 15/16 series, for instant HiFi audio.\nEnjoy rich bass, detailed mids, and clear highs across 20Hz to 40kHz—all in a premium Hi-res audio, comfortable fit",
        "url": "https://www.kickstarter.com/projects/fosiaudio/fosi-audio-k7-gaming-headphone-amp-dac/posts/4294518",
        "likes_count": 3,
        "comments_count": 0,
        "comments": []
      }
    ]
  }
}