{
  "url": "https://www.kickstarter.com/projects/emikamusic/how-to-make-music-immersive",
  "campaign_details": {
    "funding_period_text": "Funding period\nJan 31 2025 - Apr 01 2025 (60 days)",
    "funding_start_date": "2025-01-31T00:00:00.000000Z",
    "funding_end_date": "2025-04-01T21:08:49.584876Z",
    "funding_duration_days": 60,
    "pledged_amount": "S$ 20,544",
    "funding_goal": "S$ 32,266",
    "backers_count": "182",
    "days_left": 8,
    "project_launch_text": "Project launches JANUARY 31, 2025"
  },
  "updates": {
    "count": 2,
    "content": [
      {
        "update_number": "UPDATE #2",
        "title": "I'm super excited!",
        "creator": "Emika\nMarch 21, 2025",
        "date": "March 21, 2025",
        "content": "Hi Everyone here, \nIt's already totally heartwarming to see that 155 people have backed so far!  Thank you everyone here, I really appreciate all your support. \nI added a couple of things based on some of your feedback:\nYou can now 'Add-on' the online concert to your reward, if you'd like to. \nI added 1 more Klavirni piano piece (They seem to be a favourite!)\nI am still thinking of some cool things I could add or update in the final days.. there are just 11 days left, if you have any requests feel free to message me on the platform here.\nFingers crossed we make it!\nThanks\nEmika",
        "url": "https://www.kickstarter.com/projects/emikamusic/how-to-make-music-immersive/posts/4327062",
        "likes_count": 11,
        "comments_count": 1,
        "comments": [
          {
            "text": "\"Hi, Emika! I hope you're doing well. I'm a huge fan of your work and have a full collection of your albums in high resolution, purchased directly from Bandcamp. I'm fascinated by the depth and emotion of your music. I'd love for you to consider creating a song that explores an intense emotional journey, a piece that begins with a touch of pure innocence, then dives into the depths of bitterness, sadness, and resentment, and finally emerges into empathy and understanding. I envision an electronic composition with a theatrical, almost operatic atmosphere, capturing the essence of the New Age of Aquarius and the growing influence of artificial intelligence. I envision a melody that evokes the feeling of a mystical ritual, with synthesizers interweaving to create a sonic narrative that reflects the complexity of our emotions in this modern world. It would be fascinating to hear your interpretation of these themes, merging the human and the technological into a unique listening experience. Your music has the ability to transport us to other worlds and make us feel profound emotions. I'm sure a song with these qualities would be a masterpiece. Thank you for your incredible talent and for sharing it with us!",
            "commenter": "Isumdemie",
            "timestamp": "March 21, 2025 5:18 AM AWST",
            "datetime": "1742505506",
            "relative_time": "4 days ago"
          }
        ]
      },
      {
        "update_number": "UPDATE #1",
        "title": "Many Lovely Miracles",
        "creator": "Emika\nFebruary 24, 2025",
        "date": "February 24, 2025",
        "content": "Dear backers, friends, family, patrons, new listeners + long-time listeners.. \nEach time one of you has backed my project here, it feels like a miracle in my day-to-day. \nI am writing a lot of new material, researching and learning new things about the ways I want to record and perform my songs live.  I really hope this project is successful and I can't wait to put new music together.  The album will be called 'Fountain'.  \nThanks for your collective support, I appreciate it so very much.\nEmika",
        "url": "https://www.kickstarter.com/projects/emikamusic/how-to-make-music-immersive/posts/4321597",
        "likes_count": 13,
        "comments_count": 0,
        "comments": []
      }
    ]
  }
}