{
  "url": "https://www.kickstarter.com/projects/bloomfab/hydropote-20-another-diy-self-watering-pot-to-3d-print",
  "campaign_details": {
    "funding_period_text": "Funding period\nJan 8 2025 - Feb 7 2025 (30 days)",
    "funding_start_date": "2025-01-07T11:26:26-05:00",
    "funding_end_date": "2025-02-06T11:26:26-05:00",
    "funding_duration_days": 30,
    "pledged_amount": "€1,708",
    "funding_goal": "€100",
    "backers_count": "168"
  },
  "updates": {
    "count": 5,
    "content": [
      {
        "update_number": "UPDATE #5",
        "title": "Hydrogen 1.0 The new project from BloomFab is coming soon! (With a free STL to claim on the launch)",
        "creator": "BloomFab\nFebruary 28, 2025",
        "date": "February 28, 2025",
        "content": "Everyone has received their files, and the commercial licenses have been delivered!\nAll late pledgers and backers who had payment issues have now received their files.\nAdditionally, as requested, the commercial licenses (including Master Licenses) have been updated and sent directly to the backers. If you're concerned that you missed it, feel free to check your private messages on Kickstarter, the link is waiting for you there!\nThe new project of BloomFab, HydroGen 1.0 is coming!\nMore details about the HydroGen 1.0 HERE!\nBehind this intriguing name hides a complete starter kit for hydroponic enthusiasts!\nGrow your own salads (or any other plants suited to the Kratky method) without the need for electricity!\nThere are plenty of YouTube tutorials on starting a hydroponic farm, but most require tools and a fair amount of skill. While they certainly work, the results often lack aesthetic appeal.\nHydroGen 1.0 bridges the gap by combining the precision of 3D printing (for both function and aesthetics) with the simplest hydroponic method, perfect for beginners!\nWe're launching on Tuesday, so feel free to follow the launch! Even if hydroponics isn't your thing, we're giving away a free STL for your garden for the first time! 🌱\nHere is the link: https://www.kickstarter.com/projects/bloomfab/hydrogen-3d-your-3d-printed-mini-hydroponic-farm \nBloomFab",
        "url": "https://www.kickstarter.com/projects/bloomfab/hydropote-20-another-diy-self-watering-pot-to-3d-print/posts/4325142",
        "likes_count": 0,
        "comments_count": 1,
        "comments": [
          {
            "text": "What everybody get their files/ I didn’t get anything or another people…. What are you talking about..the old one didn’t deliver and try to have us back another project?",
            "commenter": "sunprapa",
            "timestamp": "March 9, 2025 2:44 AM AWST",
            "datetime": "1741459449",
            "relative_time": "5 days ago"
          }
        ]
      },
      {
        "update_number": "UPDATE #4",
        "title": "Project funded and extra stretch goal unlocked!!",
        "creator": "BloomFab\nFebruary 7, 2025",
        "date": "February 7, 2025",
        "content": "What an incredible journey!\nWe succeeded to unlock every single stretch goal of this project and even some for the previous one!! \nTaking inspiration from the Hydropote 2.0 to the 1.0, we also made some adjustements on the inside part to make it fully support free. We also added another style for the first hydropot!\nHere is a preview of the extra stretch goal from the first project we just unlocked together:\nAbout delivery\nIf you came from the first project, you know how fast we deliver. You'll will receive all of the STLs, directly in your Kickstarter inbox in a day or two.\n\nNote: Some people have some trouble with their payment. If it's your case try to fix it as soon as possible, you'll not receive your pledges before the problem is solved on your side ;)\nThank you so much for your support on that new project!!\nBloomFab",
        "url": "https://www.kickstarter.com/projects/bloomfab/hydropote-20-another-diy-self-watering-pot-to-3d-print/posts/4308852",
        "likes_count": 5,
        "comments_count": 2,
        "comments": [
          {
            "text": "Hi, apologies if this is a stupid question - who will receive this stretch goal? I looked for it in the DropBox link you sent and could not find it... and it looks nice :)",
            "commenter": "mako",
            "timestamp": "February 17, 2025 1:29 AM AWST",
            "datetime": "1739726945",
            "relative_time": "25 days ago"
          },
          {
            "text": "It's in the dropbox of the Hydropote 1.0. If you pledge for it as an addon or if you got it from our previous project, you can check for it.",
            "commenter": "BloomFab",
            "timestamp": "February 27, 2025 11:15 AM AWST",
            "datetime": "1740626157",
            "relative_time": "14 days ago"
          }
        ]
      },
      {
        "update_number": "UPDATE #3",
        "title": "Second stretch goal unlocked! New goal set!",
        "creator": "BloomFab\nJanuary 27, 2025",
        "date": "January 27, 2025",
        "content": "The second option of the design is there!\nWe unlocked both stretch goal for this campaign!\nHere is a preview of the extra design for the Hydropote 2.0:\nNew Stretch goal!!\nWith the suggestion of Domingo Dias, one of our backer, we decided to open a new stretch goal!\nIf we reach 1500 € with that project, we'll also unlock the extra design for the Hydropote 1.0!!\nThank you so much for your support on that new project!!\nBloomFab",
        "url": "https://www.kickstarter.com/projects/bloomfab/hydropote-20-another-diy-self-watering-pot-to-3d-print/posts/4300469",
        "likes_count": 3,
        "comments_count": 0,
        "comments": []
      },
      {
        "update_number": "UPDATE #2",
        "title": "First Stretch Goal Unlocked!",
        "creator": "BloomFab\nJanuary 17, 2025",
        "date": "January 17, 2025",
        "content": "We did it!\nThe first stretch goal with the mini version of the hydropote 2.0 is now available and we're already on our way to the second one!!!\nThank you so much for your support on that new project!!\nBloomFab",
        "url": "https://www.kickstarter.com/projects/bloomfab/hydropote-20-another-diy-self-watering-pot-to-3d-print/posts/4294266",
        "likes_count": 1,
        "comments_count": 0,
        "comments": []
      },
      {
        "update_number": "UPDATE #1",
        "title": "Which print bed do you need to print the Hydropote 2.0 ?",
        "creator": "BloomFab\nJanuary 12, 2025",
        "date": "January 12, 2025",
        "content": "Almost reach the first stretch goal in less than a week!\nThis new version of the Hydropote seems to be very popular! In less than a week we almost reach the first stretch goal!!\nAbout the size of your printer\nAfter receiving some questions about it, I realize that I forgot to mention the size of the pot and the bed need to print it.\nDon't worry a single time, all of the Bloomfab designs are made to be printed on any kind of printers (except the minis) so if you at least have a 23x23cm bed on your printer (most of the printers usually use at least 25x25cm one), you're good to go! \n\nAnd even if you have a smaller bed than usual, you can easily reduce the size from 20% without any risk!",
        "url": "https://www.kickstarter.com/projects/bloomfab/hydropote-20-another-diy-self-watering-pot-to-3d-print/posts/4290795",
        "likes_count": 1,
        "comments_count": 0,
        "comments": []
      }
    ]
  }
}