{
  "url": "https://www.kickstarter.com/projects/liujitao/imises-s1-mini-direct-insert-mobile-phone-microphone",
  "campaign_details": {
    "funding_period_text": "Funding period\nDec 10 2024 - Jan 9 2025 (30 days)",
    "funding_start_date": "2024-12-10T09:46:15-05:00",
    "funding_end_date": "2025-01-09T09:46:15-05:00",
    "funding_duration_days": 30,
    "pledged_amount": "HK$ 73,697",
    "funding_goal": "HK$ 20,000",
    "backers_count": "156"
  },
  "updates": {
    "count": 2,
    "content": [
      {
        "update_number": "UPDATE #2",
        "title": "Thank You for Making S1mini a Reality!",
        "creator": "Jitao Liu\nJanuary 9, 2025",
        "date": "January 9, 2025",
        "content": "Dear Supporters,\nOur crowdfunding journey is about to come to a triumphant close! Over the past few weeks, your trust and support have turned the idea of the S1mini AI Noise-Canceling Microphone into a reality.\nNone of this would have been possible without you. From your early backing and thoughtful feedback to your enthusiasm for our product, you have inspired us to give our very best every step of the way.\nWhat’s Next?\nWith the campaign coming to an end, we are now fully focused on preparing for production and shipping. Our team is committed to ensuring that every S1mini meets the highest quality standards and arrives at your doorstep in perfect condition.\nIf you need to update your shipping information or have any questions, please don’t hesitate to contact us via Kickstarter messages. We’ll continue to provide regular updates so you can stay informed about the progress of your product.\nOnce again, thank you for joining us on this incredible journey. We can’t wait for you to experience the S1mini and see how it enhances your creativity and daily life.\nThe future is bright, and it’s all thanks to you!\n— The S1mini Team",
        "url": "https://www.kickstarter.com/projects/liujitao/imises-s1-mini-direct-insert-mobile-phone-microphone/posts/4289062",
        "likes_count": 1,
        "comments_count": 0,
        "comments": []
      },
      {
        "update_number": "UPDATE #1",
        "title": "Thank You to All Our Backers! Important Updates & Next Steps",
        "creator": "Jitao Liu\nDecember 16, 2024",
        "date": "December 16, 2024",
        "content": "First and foremost, a huge thank you to every one of you!\nWith over $4,000 raised and the incredible support from all our backers, this journey has been nothing short of amazing. It has been an absolute pleasure to share the anticipation and excitement with you.\nWe deeply appreciate your belief in the Imises S1 Mini Direct-Insert Mobile Phone Microphone. Your support drives us to deliver the best product possible, and we can't wait to hear your thoughts once it’s in your hands.\nStay tuned for more updates as we move forward. Thank you for being an essential part of our success!",
        "url": "https://www.kickstarter.com/projects/liujitao/imises-s1-mini-direct-insert-mobile-phone-microphone/posts/4272242",
        "likes_count": 1,
        "comments_count": 0,
        "comments": []
      }
    ]
  }
}