{
  "url": "https://www.kickstarter.com/projects/insglo/insglo-facial-rejuvenation-right-out-of-your-pocket",
  "campaign_details": {
    "funding_period_text": "Funding period\nDec 7 2024 - Jan 6 2025 (30 days)",
    "funding_start_date": "2024-12-06T21:31:13-05:00",
    "funding_end_date": "2025-01-05T21:31:13-05:00",
    "funding_duration_days": 30,
    "pledged_amount": "$15,185",
    "funding_goal": "$15,000",
    "backers_count": "130"
  },
  "updates": {
    "count": 7,
    "content": [
      {
        "update_number": "UPDATE #7",
        "title": "International Shipping Update – Overcoming Lithium Battery Restrictions",
        "creator": "InsGlo Team\nFebruary 25, 2025",
        "date": "February 25, 2025",
        "content": "Dear Backers,\nWe have officially begun international shipping! However, we encountered an unexpected challenge—USPS has returned all our shipments due to restrictions on lithium batteries, causing delays and postage losses. We are actively exploring alternative shipping solutions and will make another attempt soon.\nPlease note that shipping regulations vary by country, and while we are doing our best to resolve these issues, in some strict cases, we may need to issue refunds. Alternatively, if there’s an opportunity for bulk shipments or distribution partnerships in your region, we’d love to explore that as a solution.\nThank you for your patience and support as we work through these logistics. We’ll keep you updated!\nBest,\nThe InsGlo Team",
        "url": "https://www.kickstarter.com/projects/insglo/insglo-facial-rejuvenation-right-out-of-your-pocket/posts/4322267",
        "likes_count": 2,
        "comments_count": 0,
        "comments": []
      },
      {
        "update_number": "UPDATE #6",
        "title": "Kickstarter Update: US Orders Fulfilled!",
        "creator": "InsGlo Team\nFebruary 18, 2025",
        "date": "February 18, 2025",
        "content": "Great news! 🎉 We have successfully fulfilled all orders within the US!\nFor our international backers, you're next! Since customs processes vary by region, we may encounter different obstacles and potential delays. However, our goal is to complete all shipping this week. 🤞 Fingers crossed for smooth logistics!\nIf you have any questions, feel free to reach out here or through our email Hello@Insglonow.com.\nThank you for your patience and support! 💙",
        "url": "https://www.kickstarter.com/projects/insglo/insglo-facial-rejuvenation-right-out-of-your-pocket/posts/4316698",
        "likes_count": 5,
        "comments_count": 0,
        "comments": []
      },
      {
        "update_number": "UPDATE #5",
        "title": "Update on InsGlo Fulfillment – Logistics, Customs & Powerstick Replacement",
        "creator": "InsGlo Team\nFebruary 6, 2025",
        "date": "February 6, 2025",
        "content": "Dear Backers,\nWe have now locked all backer addresses and are actively preparing for fulfillment. But we have encountered new challenges along the way. Recent changes in U.S. tariff policies under the Trump administration have caused turbulence in global logistics, leading to unexpected shipping delays and backlogs. We are working diligently to resolve these issues as quickly as possible.\nAdditionally, due to the complexity and restrictions around shipping battery related products, we regret to inform you that we are unable to ship the Powerstick as originally planned. To ensure a smoother and faster delivery process, we will be upgrading it with an additional InsGlo device in a different color. This alternative is of significantly higher value and provides you with an extra style option to complement your routine. We appreciate your understanding and hope you enjoy this upgrade.\nPlease note that customs clearance at different countries may require cooperation from the receiver, and we will reach out with specific instructions if needed.\nThank you for your patience and support. We’re doing everything we can to get InsGlo to you as soon as possible! Please feel free to reach out if you have any questions.\nBest regards,\nJoey",
        "url": "https://www.kickstarter.com/projects/insglo/insglo-facial-rejuvenation-right-out-of-your-pocket/posts/4308239",
        "likes_count": 5,
        "comments_count": 1,
        "comments": [
          {
            "text": "Thanks so much for the update and, of course, even more appreciation for the upgrade !!! That is very thoughtful of you and it proves to me and your other customers that you truly believe in your products 😊. You rock !!! ( P.S. - Sorry about the unexpected glitches you've experienced in the new mailing-rules process 😟 , but you have chosen to overcome these obstacles and be victorious in the end 👍 . I definitely respect that attitude !! )",
            "commenter": "Patricia A",
            "timestamp": "February 8, 2025 11:52 AM AWST",
            "datetime": "1738986767",
            "relative_time": "about 1 month ago"
          }
        ]
      },
      {
        "update_number": "UPDATE #4",
        "title": "🎉 Product Shipping Update – Action Needed!",
        "creator": "InsGlo Team\nJanuary 27, 2025",
        "date": "January 27, 2025",
        "content": "Hi everyone,\nWe’re thrilled to announce that the InsGlo devices are ready to ship! 🚀\nHowever, if you haven’t completed the backer survey yet, please do so as soon as possible. We cannot ship your device until we have your survey response, including your mailing address and preferences.\n📢 Important Shipping Note:\nThe Chinese New Year holiday is ongoing until February 4th, during which all logistics and work are paused. Once the holiday concludes, we will begin shipping your orders promptly, most likely starting the week of February 4th.\nTo avoid delays, please ensure your survey is completed before shipping resumes!\nThank you for your patience and support as we work to deliver InsGlo to you. We can’t wait for you to experience it!\nWarm regards,\nThe InsGlo Team",
        "url": "https://www.kickstarter.com/projects/insglo/insglo-facial-rejuvenation-right-out-of-your-pocket/posts/4300405",
        "likes_count": 2,
        "comments_count": 0,
        "comments": []
      },
      {
        "update_number": "UPDATE #3",
        "title": "🚀 Manufacturing Update + Exciting News!",
        "creator": "InsGlo Team\nJanuary 17, 2025",
        "date": "January 17, 2025",
        "content": "Hi everyone,\nWe’re thrilled to share some exciting updates about InsGlo!\n1️⃣ Production Progress\nOur manufacturer is right on schedule and is set to finish the first batch in about a week. 🎉 This means we’re getting closer to delivering InsGlo to your doorstep!\n2️⃣ Backer Survey Coming Soon\nTo prepare for shipping, we’ll be sending out a backer survey shortly to collect your mailing address and preferences. Please keep an eye on your inbox—it’s important to complete the survey promptly to ensure smooth delivery.\n3️⃣ Introducing Claudia!\nWe’re excited to introduce the beautiful Claudia, who has joined us to demonstrate how InsGlo works and its amazing benefits. She’s created a step-by-step introduction for you, showcasing how to get the most out of your device.\n📹 Watch Claudia’s videos here:\n \n  Thank you so much for your continued support and patience as we bring InsGlo to life. We can’t wait for you to experience it firsthand!\nStay tuned for more updates, and don’t hesitate to reach out if you have any questions.\nWith gratitude,\nThe InsGlo Team",
        "url": "https://www.kickstarter.com/projects/insglo/insglo-facial-rejuvenation-right-out-of-your-pocket/posts/4293998",
        "likes_count": 5,
        "comments_count": 0,
        "comments": []
      },
      {
        "update_number": "UPDATE #2",
        "title": "InsGlo is officially funded! Thank you!",
        "creator": "InsGlo Team\nJanuary 6, 2025",
        "date": "January 6, 2025",
        "content": "InsGlo has reached its funding goal in the last hour! From everyone at InsGlo, thank you so much for the support. You’ve helped us bring this project to life. WE DID IT!!! THANK YOU!!!\nNow that things are official, all of you will be able to get involved and help us shape the skincare device in the months to come. We feel so lucky to be developing InsGlo alongside you all. It's been heartwarming to see the community grow. From actively participating in Discord, helping us answer questions in and out of Kickstarter, and providing awesome feedback/suggestions, we're thrilled you'll be joining us on this journey!\n\nWhat's next?\nOur priority remains working on the F1 Alpha that is scheduled to release on 1/20.  Over the next 14 days, Kickstarter will confirm pledges with backers. Later this month, we will post an update about the rewards, mini post-campaign QnA, and share a timeline of the project with you all. \nFor those who missed our campaign, we are working on a pre-order store and Amazon links. We will post an update to inform you when ready!\nCheers\nJoey",
        "url": "https://www.kickstarter.com/projects/insglo/insglo-facial-rejuvenation-right-out-of-your-pocket/posts/4286912",
        "likes_count": 3,
        "comments_count": 0,
        "comments": []
      },
      {
        "update_number": "UPDATE #1",
        "title": "We’re Almost There – Help Us Cross the Finish Line! 🚀",
        "creator": "InsGlo Team\nJanuary 4, 2025",
        "date": "January 4, 2025",
        "content": "Dear Backers,\nWe’re so close to hitting our funding goal! Thanks to your incredible support, InsGlo has already reached 94% of our target with just 48 hours left. You’ve been an amazing part of this journey, and we couldn’t have done it without you.\nBut we’re not there yet. We need one last push to make InsGlo a reality! Here’s how you can help:\n1️⃣ Share the Campaign: Spread the word with friends, family, or anyone you know who values innovative, effective skincare. Your voice makes a huge difference.\n2️⃣ Pledge or Upgrade Your Rewards: If you’ve been eyeing a higher-tier reward or thinking about adding another InsGlo for a loved one, now’s the perfect time to lock it in.\n3️⃣ Tag Us and Share Your Excitement: Post about InsGlo on social media and tag us. Let your network know why you backed us.\nEvery single backer, share, and pledge gets us closer to bringing InsGlo to life. Let's hit the finish line together and start a new chapter in skincare innovation!\nThank you for being the heart of this project. Together, we’ll make it happen!\nWith gratitude,\nJoey",
        "url": "https://www.kickstarter.com/projects/insglo/insglo-facial-rejuvenation-right-out-of-your-pocket/posts/4272190",
        "likes_count": 1,
        "comments_count": 0,
        "comments": []
      }
    ]
  }
}