{
  "url": "https://www.kickstarter.com/projects/azurbit/ivycable-p6-fast-charging-magnetic-cable-and-power-bank",
  "updates": {
    "count": 2,
    "content": [
      {
        "update_number": "UPDATE #2",
        "title": "Join Our Affiliate Program & Earn 10% CASHBACK!",
        "creator": "Matt Chang\nFebruary 12, 2025",
        "date": "February 12, 2025",
        "content": "Dear IVYCable P6 Backers,\nFirst of all, a huge THANK YOU for supporting IVYCable P6! Your enthusiasm and trust mean the world to us. As we gear up for production and delivery, we have an exciting opportunity for you to be a part of our journey in an even bigger way.\nWe’re launching the IVYCable P6 Affiliate Program, where you can earn a 10% commission on every successful referral! If you love IVYCable P6 and want to share it with friends, family, or your online community, this is the perfect way to spread the word and get rewarded.\n🔹 How It Works:\n1️⃣ Sign Up – Join our affiliate program in just a few clicks. \n2️⃣ Get Your Unique Link – Share your personalized referral link.\n3️⃣ Earn 10% Commission – Every time someone makes a purchase through your link, you’ll receive a 10% commission!\nJoining is completely free, and there’s no limit to how much you can earn. Whether you’re a social media creator, a tech enthusiast, or simply want to recommend IVYCable P6 to friends, we’d love to have you on board!\n👉 Sign up here and start earning today!\nThank you again for being a part of the IVYCable family. We can’t wait to see how you share IVYCable P6 with the world!\nBest,\nThe IVYCable Team",
        "url": "https://www.kickstarter.com/projects/azurbit/ivycable-p6-fast-charging-magnetic-cable-and-power-bank/posts/4312340",
        "likes_count": 7,
        "comments_count": 2,
        "comments": [
          {
            "text": "I have not received my order yet! M. Jordan",
            "commenter": "Margaret Jordan",
            "timestamp": "February 12, 2025 12:07 PM AWST",
            "datetime": "1739333228",
            "relative_time": "26 days ago"
          },
          {
            "text": "Dear Margaret, Thank you very much for backing IVYCable P6. I understand your concerns, and just like with the first and second generations of IVYCable, we will deliver the rewards on schedule. Once again, thank you for your support of Ivycable! Sincerely Ivycable team",
            "commenter": "Matt Chang",
            "timestamp": "February 12, 2025 5:44 PM AWST",
            "datetime": "1739353484",
            "relative_time": "26 days ago"
          }
        ]
      },
      {
        "update_number": "UPDATE #1",
        "title": "Fully Funded! Thank You ALL!",
        "creator": "Matt Chang\nJanuary 21, 2025",
        "date": "January 21, 2025",
        "content": "Hi IVYCable P6 Backers,\nThanks for your support! IVYCable P6 is fully funded within 30 minutes! \nWe launched IVYCable Gen1 in 2021, and we are actively making improvements to IVYCable during last 3 years. Let's embrace the new gen of charging now! \nBest,\nIVYCable Team",
        "url": "https://www.kickstarter.com/projects/azurbit/ivycable-p6-fast-charging-magnetic-cable-and-power-bank/posts/4296728",
        "likes_count": 3,
        "comments_count": 0,
        "comments": []
      }
    ]
  }
}