{
  "url": "https://www.kickstarter.com/projects/jingshan/jingshan-the-ultimate-foldable-magnetic-ipad-cases",
  "campaign_details": {
    "funding_period_text": "Funding period\nJan 23 2025 - Mar 9 2025 (45 days)",
    "funding_start_date": "2025-01-23T08:00:18-05:00",
    "funding_end_date": "2025-03-09T08:00:18-04:00",
    "funding_duration_days": 45,
    "pledged_amount": "$8,949",
    "funding_goal": "$5,000",
    "backers_count": "83"
  },
  "updates": {
    "count": 2,
    "content": [
      {
        "update_number": "UPDATE #2",
        "title": "Successfully Ended! Thank You for Your Incredible Support! 🎉",
        "creator": "JINGSHAN\nMarch 9, 2025",
        "date": "March 9, 2025",
        "content": "Dear Backers,\nWe are thrilled to announce that our campaign has officially come to a successful close! 🎉 This journey has been nothing short of amazing, and we owe it all to your incredible support, trust, and enthusiasm.\nWhat’s Next?\nWe are now shifting our focus to the next steps to ensure that everything goes smoothly. Here’s a quick look at our timeline:\nProduction Preparation: We’ve already finalized plans with our manufacturing partners and will ensure strict quality control throughout the process.\nMailing Address & Shipping Fee Collection: To streamline the process, we’ll be using PledgeBox to collect your shipping addresses and handle shipping fees. In the coming weeks, you’ll receive an email invitation to complete your survey on PledgeBox.\nShipping Timeline: We expect to start shipping as planned. A more detailed timeline will be shared in future updates.\nIf you have any questions about the survey or encounter issues, feel free to contact us at jingshan@jingshan.ltd.\nWarm regards,\nJINGSHAN Team",
        "url": "https://www.kickstarter.com/projects/jingshan/jingshan-the-ultimate-foldable-magnetic-ipad-cases/posts/4332901",
        "likes_count": 1,
        "comments_count": 0,
        "comments": []
      },
      {
        "update_number": "UPDATE #1",
        "title": "🚀 100% FUNDED – THANK YOU! 🎉",
        "creator": "JINGSHAN\nJanuary 31, 2025",
        "date": "January 31, 2025",
        "content": "We did it! 🎯 Thanks to your incredible support, JINGSHAN T Foldmag & X Fleximag Cases have officially reached 100% funding on Kickstarter! 🚀 Your belief in our vision means the world to us, and we couldn’t have done this without you. This is just the beginning—now that we’re fully funded, we’re pushing forward to bring these innovative, ultra-functional iPad cases to life!\nWhat’s Next?\n✅ We’re working hard to deliver the highest quality cases to you.\n✅ Stay tuned for exciting new features and color options.\n💡 Want to help? Share the campaign with friends who love iPads and smart accessories! Let’s make JINGSHAN even bigger together!\nOnce again, THANK YOU for making this possible! 💙\nJINGSHAN Team",
        "url": "https://www.kickstarter.com/projects/jingshan/jingshan-the-ultimate-foldable-magnetic-ipad-cases/posts/4303404",
        "likes_count": 1,
        "comments_count": 0,
        "comments": []
      }
    ]
  }
}