{
  "url": "https://www.kickstarter.com/projects/jirestsmartpillow/jirest-anti-snoring-deep-sleep-pillow-with-pvdf-sensor-tech",
  "campaign_details": {
    "funding_period_text": "Funding period\nMar 14 2025 - Apr 15 2025 (32 days)",
    "funding_start_date": "2025-03-14T00:00:00.000000Z",
    "funding_end_date": "2025-04-15T19:46:44.611962Z",
    "funding_duration_days": 32,
    "pledged_amount": "S$ 23,028",
    "funding_goal": "S$ 1,337",
    "backers_count": "83",
    "days_left": 20,
    "project_launch_text": "Project launches MARCH 14, 2025"
  },
  "updates": {
    "count": 1,
    "content": [
      {
        "update_number": "UPDATE #1",
        "title": "🎉 100% FUNDED! Join Our Referral Program for Cash Back! 🎉",
        "creator": "JIREST\nMarch 18, 2025",
        "date": "March 18, 2025",
        "content": "Dear Backers,\nWe have exciting news to share — our JIREST anti-snoring pillow is now 100% funded! Thanks to your incredible support, we've successfully raised $9,000+, and we couldn't have done it without you.\nWe’re so grateful to have you as part of our journey. But the excitement doesn’t stop here—we want to make our community even stronger, and you can help!\nJoin Our Referral Program & Earn Cash Back!\nWould you like to earn cash back while helping more people discover JIREST? Our Kickbooster Referral Program makes it easy for you to get 20% cash back for every successful referral. Here’s how:\n✅ Step 1: Click the button and register as a Booster.\n✅ Step 2: Share your unique Booster link on Facebook, Twitter, your blog, website, or anywhere you like!\nFor more details, visit our Kickbooster page.\nIt’s a win-win—you help spread the word about JIREST, and you get rewarded in return!\nOnce again, we can’t thank you enough for your incredible support. Stay tuned for more updates as we move forward!\nBest regards,\nJIREST Team\n-------------------------------------Project We Love-------------------------------------------\nBlack Warrior: Cinematic 4K RGB 3D GTV & KTV Laser Projector\nExperience stunning visuals and enjoy a cinematic experience at home with the Black Warrior 4K RGB 3D Laser Projector. It offers:\n✨ Ultra-clear 4K Resolution: Sharp, detailed image quality for a true-to-life viewing experience.\n🌈 RGB 3D Laser Technology: Vivid colors and immersive 3D effects.\n🎬 Cinematic HDR: High contrast and wide color gamut for enhanced detail.\n🎤 GTV & KTV Entertainment Modes: Optimized audio and video for home theater and karaoke use.\n💡 Long-lasting Brightness & Durability: High brightness and long lifespan with RGB laser technology.\n🔊 Premium Audio Support: Built-in or compatible high-quality sound for cinema-level audio, with every detail vividly presented.\nBlack Warrior brings you the future of home entertainment with top-tier visuals and sound! 🌟",
        "url": "https://www.kickstarter.com/projects/jirestsmartpillow/jirest-anti-snoring-deep-sleep-pillow-with-pvdf-sensor-tech/posts/4339572",
        "likes_count": 0,
        "comments_count": 0,
        "comments": []
      }
    ]
  }
}