{
  "url": "https://www.kickstarter.com/projects/kalos-k1-pro/kalos-k1-pro-maximize-your-tesla-screens-capabilities",
  "campaign_details": {
    "funding_period_text": "Funding period\nNov 28 2024 - Jan 8 2025 (41 days)",
    "funding_start_date": "2024-11-28T07:31:03-05:00",
    "funding_end_date": "2025-01-08T07:31:03-05:00",
    "funding_duration_days": 41,
    "pledged_amount": "",
    "funding_goal": "$3,000",
    "backers_count": "41"
  },
  "updates": {
    "count": 3,
    "content": [
      {
        "update_number": "UPDATE #3",
        "title": "Survey send!",
        "creator": "Zjinnova\nJanuary 23, 2025",
        "date": "January 23, 2025",
        "content": "Dear Backers,\nFirst and foremost, a massive THANK YOU for participating in this journey with us. We're thrilled to bring you important updates.\nCheck Your Inbox\nYou should have received by email a survey from the PledgeBox tool that recaps the details of your rewards and a form to confirm your delivery address. If you haven't seen it yet, please take a moment to check your spam or promotions folder. We need this information to ensure a smooth delivery of your KALOS K1 Pro.\nAdd-Ons Opportunity\nIf you want to add more KALOS K1 Pro, you can do so within the survey. This is a unique chance, and the prices won't be available after this opportunity.\nThere's something wrong with my pledge!\nThat's not impossible. If you notice something is awry, you can send us a message directly to kalosk1pro@outlook.com and we'll look at it for you.\nWhat if I need to change my address?\nAs long as your items have not been locked, you can always change your address. Just simply log back into https://backer.pledgebox.com/user/login and make the appropriate change. However, if you change your country, additional shipping costs may apply.\nApple ID Backers:\nBackers pledged with Apple ID but haven't fully set up their Apple Pay account (set up an email address to Apple Wallet) may not receive survey emails directly.\nIn this situation, you have two options:\nAdd a primary email to your Apple Pay account.\nUse your Apple ID email to register a backer account on PledgeBox and complete surveys: https://backer.pledgebox.com.\nYour prompt response is greatly appreciated. If you have any concerns or encounter difficulties, feel free to reach out to us.\nThank you for being a part of the ZJINNOVA journey!\nBest regards,\nZJINNOVA Team\n-------------------------------------Project We Love------------------------------------------\nZoomYao Max:Compact Yet Powerful 2-in-1 Air Blaster & Vacuum\n🌟 Compact Design: Lightweight and compact, easy to carry and store, making it perfect for various environments such as home, office desks, or cars.\n💪 Powerful Performance: Combines air blasting and vacuum functions, providing an efficient cleaning experience.\n🔄 2-in-1 Functionality: One product that meets both air blasting and vacuuming needs, saving time and effort.\n🌍 Versatile Use: Easily handles dust on desktops, between keyboard keys, or debris inside your car.\n🖱️  Easy to Use: Simple operation, allowing users to start quickly without complex settings.\n⚡ Energy Efficient: The powerful vacuuming and air blasting functions work together to improve cleaning efficiency while saving energy.\nDAREU A70: A Sleek One-Piece Aluminum QMK Magnetic Keyboard\n🏅One-Piece Aluminum Design: Durable and sleek, enhancing the overall feel.\n⚙️QMK Firmware: Highly customizable to suit personal preferences.\n🔧Magnetic Assembly: Simplifies assembly and disassembly for easy maintenance.\n⌨️Convenient Key Mapping: Custom layouts and shortcuts for programmers, gamers, and creators.\n💪Unique Design: Comfortable to use, combining style and performance.\n✨Ultra-Slim Design: Comfortable for long use, reducing wrist fatigue.",
        "url": "https://www.kickstarter.com/projects/kalos-k1-pro/kalos-k1-pro-maximize-your-tesla-screens-capabilities/posts/4298103",
        "likes_count": 0,
        "comments_count": 1,
        "comments": [
          {
            "text": "hi, amy update on the shipment date? survey was already a while ago.",
            "commenter": "Mesut Guengoer",
            "timestamp": "March 11, 2025 6:02 AM AWST",
            "datetime": "1741644162",
            "relative_time": "3 days ago"
          }
        ]
      },
      {
        "update_number": "UPDATE #2",
        "title": "Thank you!",
        "creator": "Zjinnova\nJanuary 8, 2025",
        "date": "January 8, 2025",
        "content": "Dear Backers,\nWe extend our heartfelt gratitude for your unwavering support throughout the KALOS K1 Pro campaign!\nAs we conclude this incredible journey, we are deeply thankful for your role in making it all possible. \nOver the next 14 days, we'll be reaching out with surveys to gather your addresses and confirm shipping details. Your active involvement has been pivotal, and we're eagerly anticipating the moment when we can deliver KALOS K1 Pro to each of you. \nPlease stay tuned for further updates, and once again, thank you for being an integral part of this thrilling adventure!\nWarm regards,\nZJINNOVA Team",
        "url": "https://www.kickstarter.com/projects/kalos-k1-pro/kalos-k1-pro-maximize-your-tesla-screens-capabilities/posts/4288242",
        "likes_count": 0,
        "comments_count": 0,
        "comments": []
      },
      {
        "update_number": "UPDATE #1",
        "title": "🎉100% Funded & 🥰Join Our Event Now!",
        "creator": "Zjinnova\nDecember 4, 2024",
        "date": "December 4, 2024",
        "content": "Dear Backers,\nFirst and foremost, thank you for backing our KALOS K1 Pro. We're thrilled to share an exciting update with you!\n\nWe are thrilled to share that our campaign has reached a major moment—USD 3600+ and 100% funded! This achievement is all thanks to your amazing support!\n🥰Join our referral program!\nSpread for KALOS K1 Pro, invite your friends or family, and earn 20% cash back for each successful referral.\n1. Sign up as a Booster.\n2. Share your referral link.\n3. For every person who pledges through your link, you will earn a 20% cash back commission.\n👉 Clickand earn your cash back now!\nBest regards,\nZjinnova Team\n----------------------------------Projects We Love--------------------------------------------\nHULA All-in-1 Drone: EDU Toy, AI Learning, Creativity Game\nIntroduce HULA—an entertaining and educational toy drone designed for everyone! Whether you're a drone enthusiast, a coding beginner, or a family looking to learn through play, HULA offers endless fun.\n🎯 Why Choose HULA?\n✅ Education Meets Entertainment: HULA combines flying fun with programming and AR features, enhancing creativity and hands-on skills.\n✅ Ultimate Coding Experience: Control the drone effortlessly with user-friendly graphical programming, perfect for kids and beginners.\n✅ Immersive AR Interaction: Engage in lively flying experiences with HULA’s augmented reality mode.\n✅ Diverse Flight Modes: Enjoy various options, from racing to performance modes, for endless playtime variety.\n✅ Portable and Lightweight: Ideal for indoor and outdoor fun, HULA is easy to take anywhere.\n✅ Real-Time Multiplayer Battles: Challenge friends in exciting battles via the dedicated app for added social fun.\n👉 Discover the magic of HULA today!",
        "url": "https://www.kickstarter.com/projects/kalos-k1-pro/kalos-k1-pro-maximize-your-tesla-screens-capabilities/posts/4267393",
        "likes_count": 0,
        "comments_count": 0,
        "comments": []
      }
    ]
  }
}