{
  "url": "https://www.kickstarter.com/projects/keeprsafe/keepr-safer-voicechat-toxicity-free-gaming",
  "campaign_details": {
    "funding_period_text": "Funding period\nMar 01 2025 - Mar 31 2025 (30 days)",
    "funding_start_date": "2025-03-01T00:00:00.000000Z",
    "funding_end_date": "2025-03-31T22:54:57.616788Z",
    "funding_duration_days": 30,
    "pledged_amount": "S$ 92",
    "funding_goal": "S$ 16,875",
    "backers_count": "4",
    "days_left": 5,
    "project_launch_text": "Project launches MARCH 1, 2025"
  },
  "updates": {
    "count": 2,
    "content": [
      {
        "update_number": "UPDATE #3",
        "title": "Found a Co-Founder & First Board Meeting scheduled on Tuesday 11th March",
        "creator": "Ava\nMarch 9, 2025",
        "date": "March 9, 2025",
        "content": "Last Saturday (7th March 2025), I went to try a target rifle shooting for the first time, and there I met someone who is doing a research on extremism on social media platforms. (The paper in draft is called \"A Multi-Dimensional Approach to Extremist Classification: Sentiment, Social, and Temporal Information\")\nI thought it was pretty relevant to my startup idea, so I explained to him a bit about KEEPR and he was very excited to learn more about it. \nI shared how the prototype was built (https://github.com/in-c0/RealtimeSTT) and told him that I was thinking to switch from a transcription method to a direct audio modification approach due to the delay I was having...  He then went on to optimize the program, and in just an hour, he quickly optimized the code:\nwhich was quite eye opening for me that I could collect data and make a graph to weigh on a technical decision. \n(This was the original code's performance - tested on GTX1060)\nHe also found a strange bug when processing a batch of 10-seconds length :\nThis was replicable on my setup as well (RTX2080) ... : \nAnyways.\n I was impressed by his curiousity and grit, because it takes quite an effort to set up and to just run the script (working with CUDA, setting up VB Cable, etc) So I asked him if he wants to be a co-founder and he accepted it. Yay!\n We will meet up on Tuesday and have a more thorough discussion. It will be the first board meeting for KEEPR!",
        "url": "https://www.kickstarter.com/projects/keeprsafe/keepr-safer-voicechat-toxicity-free-gaming/posts/4332866",
        "likes_count": 0,
        "comments_count": 0,
        "comments": []
      },
      {
        "update_number": "UPDATE #2",
        "title": "We Just Got Our First Pledge— Thank You!",
        "creator": "Ava\nMarch 9, 2025",
        "date": "March 9, 2025",
        "content": "9/March/2025\n\nHonestly, this is my first-ever Kickstarter campaign, and I wasn't expecting anyone to pledge. Receiving our first pledge of $40 today means a lot - it's amazing knowing someone out there shares the same values as KEEPR!\nThe campaign goal within the next 22 days feels ambitious, but no matter the outcome of this campaign, I'll continue pushing forward, building KEEPR step by step. I know it will probably take many failed attempts and months of effort, it is all part of the journey.\nThank you for believing in the vision and joining this adventure so early on!",
        "url": "https://www.kickstarter.com/projects/keeprsafe/keepr-safer-voicechat-toxicity-free-gaming/posts/4332864",
        "likes_count": 0,
        "comments_count": 0,
        "comments": []
      }
    ]
  }
}