{
  "url": "https://www.kickstarter.com/projects/kerylove/kerylove-sports-water-bottle-and-hydrogen-water-bottle",
  "campaign_details": {
    "funding_period_text": "Funding period\nJan 16 2025 - Mar 2 2025 (45 days)",
    "funding_start_date": "2025-01-16T06:59:52-05:00",
    "funding_end_date": "2025-03-02T06:59:52-05:00",
    "funding_duration_days": 45,
    "pledged_amount": "HK$ 328,203",
    "funding_goal": "HK$ 21,900",
    "backers_count": "383"
  },
  "updates": {
    "count": 1,
    "content": [
      {
        "update_number": "UPDATE #1",
        "title": "Update",
        "creator": "Kerylove\nJanuary 23, 2025",
        "date": "January 23, 2025",
        "content": "Dear all backers,\nThank you so much for your support and patience.  What a pleasant journey!\nSo far, we have received $17,000 and support from 170 backers.\nWe have browsed the comment section and everyone has some doubts about the product material being Tritan.\nTX2001 is an amorphous copolyester raw material produced by Eastman Chemical Company. It has excellent appearance and transparency, and contains a plant-based release agent. TX2001 performs well in food contact applications, meets food grade standards, and has chemical resistance and high heat resistance, capable of withstanding temperatures up to 109 ℃.\n\nApplication area \nTX2001 is widely used in the fields of large and small household appliances, electrical appliances, and household goods. Its excellent physical and chemical properties make it perform outstandingly in these applications\nHydrogen is difficult to dissolve in water?\nUnder standard conditions, the solubility of hydrogen is very low, with a maximum solubility of 1.83 milliliters of hydrogen per 100 milliliters of water, which is 1.83%. Although hydrogen has a slightly higher biological solubility of about 0.8 mM, which means it dissolves 1.6 milligrams per liter of water. ‌1\nHydrogen is a colorless, odorless, and tasteless gas with a very low density, making it the smallest known gas in terms of density. It is difficult to dissolve in water at room temperature and pressure, and usually exists in a gaseous state. Only under high pressure conditions will hydrogen partially dissolve in water.\nAlthough hydrogen is difficult to dissolve in water, it can dissolve in water under certain specific conditions, such as high pressure or specific temperatures. Our product has been pressurized. ‌\nThe following is how we detect the hydrogen content in water through equipment. Everyone can compare by looking at the pictures.\nIf you have any questions you can feel free to contact us. If you love this product, please share it with your famliy and friends.\nLet Kerylove spread further! Thanks again.\nBest regards,\nKerylove Team",
        "url": "https://www.kickstarter.com/projects/kerylove/kerylove-sports-water-bottle-and-hydrogen-water-bottle/posts/4298179",
        "likes_count": 9,
        "comments_count": 1,
        "comments": [
          {
            "text": "I love how it’s made by Eastman. BPA free and I grew up in Longview, Texas where Eastman has one of their facilities.",
            "commenter": "ashlon",
            "timestamp": "January 23, 2025 11:04 PM AWST",
            "datetime": "1737644658",
            "relative_time": "about 2 months ago"
          }
        ]
      }
    ]
  }
}