{
  "url": "https://www.kickstarter.com/projects/mythosdesign/litecable-wearable-6-in-1-240w-lanyard-charging-cable",
  "updates": {
    "count": 1,
    "content": [
      {
        "update_number": "UPDATE #1",
        "title": "Congrats on Goal Reached! 🎉 New Color Unlocked, Sample Confirmed and More...",
        "creator": "Mythos Design\nFebruary 25, 2025",
        "date": "February 25, 2025",
        "content": "Hello backers!\nWe're thrilled to share that we've reached our funding goal and received support from over 100 of you! Thank you for supporting us. 🫶🫶🫶\nAt the end of last week, we visited our manufacturing partner to discuss the production plan. We brought some samples from there. The following pic is a sneak peek of what we got to our office. \nThe trial product samples above show that the army green and bright orange colors are perfect without any picture editing. We are committed to ensuring that you will get what you see from this campaign once you decide to back us.\n--------------------------------------------------------------------------------------\nThe Color Black Unlocked\nBefore we go to the final run of production after the campaign ends, we are now open to adding one more black color to fit your urban lifestyle! We believe some of you will love it and it will complement any outfit, making it both functional and fashionable. \nThe new black color will use the same high-density braided cable material to make it durable for daily and long-term use.\nWe're already in discussions with our manufacturing partners to ensure a smooth transition into production. Our goal is to deliver the LiteCable on time and with the exceptional quality you've come to expect.\n-------------------------------------------------------------------------------------\nShare Campaign to Earn Cash Back\nShare is caring. We’d appreciate it if you could tell your friends, family, and the rest of the world about the LiteCable! To show our gratitude, we’ve teamed up with Kickbooster. For every backer you refer to this Kickstarter project, you will earn 20% back of their pledge amount. Sign up now on Kickbooster. Once you're signed up, you’ll get a personal link to share through social media, email, or any other platform you like.\nYour continued support means the world to us as we move forward. If you're excited about this campaign, we encourage you to spread the word within your networks. \nThank you again for your phenomenal support.\nKind regards,\nMythos Design",
        "url": "https://www.kickstarter.com/projects/mythosdesign/litecable-wearable-6-in-1-240w-lanyard-charging-cable/posts/4321089",
        "likes_count": 2,
        "comments_count": 0,
        "comments": []
      }
    ]
  }
}