{
  "url": "https://www.kickstarter.com/projects/jamespineiro/loop-2",
  "campaign_details": {
    "funding_period_text": "Funding period\nNov 12 2024 - Jan 11 2025 (60 days)",
    "funding_start_date": "2024-11-12T09:50:32-05:00",
    "funding_end_date": "2025-01-11T09:50:32-05:00",
    "funding_duration_days": 60,
    "pledged_amount": "$1,021",
    "funding_goal": "$500",
    "backers_count": "39"
  },
  "updates": {
    "count": 6,
    "content": [
      {
        "update_number": "UPDATE #6",
        "title": "ALPHA TESTERS GETTING ACCESS TODAY! READ TO FIND OUT HOW TO GET LOOP!",
        "creator": "James Piñeiro\nFebruary 1, 2025",
        "date": "February 1, 2025",
        "content": "HELLO EVERYONE! Today is the day that Loop will be sent out to Alpha Testers! This is the absolute earliest version of the app, and just about everything is open to change. If you are an alpha tester, I will send you a message sometime today with more information about how to get Loop on your device immediately. Apple users please check your inboxes, and if you don't have Loop on your device by 10 AM EST tomorrow please contact me immediately. I'll start sending out the links around 5-6PM EST.\nAndroid users will receive it either today or tomorrow, depending on how seamless the process is for the play store. Please check your emails and contact me if you don't receive it by Sunday at 10 AM EST.\nWhile in testing mode: I will be updating the app every 1-2 days, so make sure to keep up to date with the latest version as I am actively changing things pretty much around the clock. I will be dedicating my whole weekend to improving the Loop experience, and responding to Alpha tester advice/recommendations.\nThank you all for everything, talk to you soon.",
        "url": "https://www.kickstarter.com/projects/jamespineiro/loop-2/posts/4303856",
        "likes_count": 4,
        "comments_count": 2,
        "comments": [
          {
            "text": "I have not received my email",
            "commenter": "BôƁ Backer",
            "timestamp": "February 3, 2025 12:36 AM AWST",
            "datetime": "1738514167",
            "relative_time": "about 1 month ago"
          },
          {
            "text": "Hi Bob! Sorry I'm working on uploading the newest Android build right now, you should be able to download it within the next hour or so. Google Play Requires 2 weeks of closed testing before I can get it on the Play Store as well, so you are definitely going to get it 2 weeks early regardless. It just might launch publicly a few days later for Android. Sincerely, James",
            "commenter": "James Piñeiro",
            "timestamp": "February 3, 2025 12:47 AM AWST",
            "datetime": "1738514861",
            "relative_time": "about 1 month ago"
          }
        ]
      },
      {
        "update_number": "UPDATE #5",
        "title": "PUSHING RELEASE AND ALPHA BACK ONE WEEK, AND HOW TO INSTALL IF YOU ARE AN ALPHA OR BETA TESTER!",
        "creator": "James Piñeiro\nJanuary 24, 2025",
        "date": "January 24, 2025",
        "content": "Hey guys, I have about 5 different features that I want to finalize before launching the alpha release, so I have ultimately decided to push it back a week. This is a super quick update cause I'm just working on the app a bunch, crunch time! There will be NO MORE DELAYS!\nNew Release: February 14th, January 31st for Alpha Tesers, February 12th for Beta Testers\nIf you are an alpha or beta tester, on the day of your release date, I will be either messaging you over Kickstarter, or some other means of communication depending on if I know you IRL.\nHave a wonderful safe weekend,\nJames",
        "url": "https://www.kickstarter.com/projects/jamespineiro/loop-2/posts/4295230",
        "likes_count": 3,
        "comments_count": 0,
        "comments": []
      },
      {
        "update_number": "UPDATE #4",
        "title": "LOOP ON THE APP STORE FOR PRE-ORDER!! WE CROSSED $1,000!!! NEW VIDEO AND EXPLORE PAGE REVEALED!!!",
        "creator": "James Piñeiro\nJanuary 10, 2025",
        "date": "January 10, 2025",
        "content": "Introduction\nWOW!! What a great week for Loop! We crossed $1,000 donated, we made it onto the Apple App Store: https://apps.apple.com/us/app/loop-stay-informed/id6738632604 (Google Play Store is coming soon), and I created a new video advertising the app (You will be able to see it on @joinloop on Instagram in the next day or so). I want to preface by saying that although the live campaign deadline is coming to close, I am still going to update you all regularly on here until the app launches! Speaking of...\nLoop Release Date\nAlpha Testers ($15): January 24th, 2025\nBeta Testers ($5): February 5th, 2025\nPublic release (Everyone gets it): February 7th, 2025\nIf you are an Apple user who paid for early release, you will need to contact me on Kickstarter with your Apple ID. I could have gotten your emails right after you pledged, but this is my first ever Kickstarter campaign and I did not do that whoops 😂 If you are an Android user, do the same except with your Google Play Store email.\nWhat has changed since the last update\nBrand new explore page which allows you to see global and local trending news, which is updated twice a day (Images will be down below, should be the first four)\nYou can now save stories and view your saved stories forever in the new \"Saved Stories\" page (Image should be right after the explore page)\nYou can now share stories with friends, family, etc. (Will be included in the saved stories image)\nLOOP IS ON THE APP STORE!!! PRE-ORDER IT NOW IF YOU HAVE AN IPHONE!!! https://apps.apple.com/us/app/loop-stay-informed/id6738632604 (Image should be right at the bottom)\nFixed email authentication (You guys would never know but it was a total pain so I'm putting it here)\nWhat I'm doing now\nGETTING LOOP ON THE GOOGLE PLAY STORE ASAP!!!\nMARKETING ALL OVER!!! @joinloop on instagram, @getloopapp on TikTok, @joinloopapp on YouTube\nWorking on the local news section of the explore page more\nOptimizing everything so it loads even faster\nAdding pretty animations so your app feels even better.\nPhotos\nExplore Page (Next four):\nSaved Stories Page:\nLOOP ON THE APP STORE: https://apps.apple.com/us/app/loop-stay-informed/id6738632604 \nConclusion\nLOOP IS ON THE APP STORE!!! STOP READING THIS AND GO GO GO!! https://apps.apple.com/us/app/loop-stay-informed/id6738632604",
        "url": "https://www.kickstarter.com/projects/jamespineiro/loop-2/posts/4289560",
        "likes_count": 3,
        "comments_count": 4,
        "comments": [
          {
            "text": "If you hate anything here, PLEASE TELL ME NOW!!!!",
            "commenter": "James Piñeiro",
            "timestamp": "January 10, 2025 8:24 AM AWST",
            "datetime": "1736468669",
            "relative_time": "2 months ago"
          },
          {
            "text": "Any update on the Android App?",
            "commenter": "BôƁ Backer",
            "timestamp": "January 19, 2025 2:57 AM AWST",
            "datetime": "1737226665",
            "relative_time": "about 2 months ago"
          },
          {
            "text": "I am an Alpha tester if that makes any difference. Will I have access as of January 24 - next week?",
            "commenter": "BôƁ Backer",
            "timestamp": "January 19, 2025 2:59 AM AWST",
            "datetime": "1737226741",
            "relative_time": "about 2 months ago"
          },
          {
            "text": "Hey Bob, thanks for the follow-up! Yes, I do have an update on the Android App! So, for an app to go on the Google Play Store, it needs to have 12 internal testers for 2 weeks, which I didn't know about beforehand. But, this is actually a great thing, as my plan is to reach out to all alpha Android supporters and have them be said internal testers. In short, yes the plan is you will get the app on the exact same day as the Apple alpha testers, which is set to be January 24th. But, it might take a little longer to be on the App Store for android, possibly February 9th-12th ish? But you'll already have the app of course.",
            "commenter": "James Piñeiro",
            "timestamp": "January 19, 2025 3:01 AM AWST",
            "datetime": "1737226884",
            "relative_time": "about 2 months ago"
          }
        ]
      },
      {
        "update_number": "UPDATE #3",
        "title": "ON THE APP STORE IN THE NEXT WEEK! LIKELY RELEASE DATE REVEALED! HUGE UI REVAMP! COLORFUL!!!!!!",
        "creator": "James Piñeiro\nJanuary 3, 2025",
        "date": "January 3, 2025",
        "content": "Introduction\nHello everyone! My sincerest of apologies for the gap since my last update. I had two weeks of finals, and then the last two weeks I've honestly just been adding a lot of features to try and push Loop onto the app store for preorder. Unfortunately getting it on the app store has been a tedious process, but I believe Loop should be available for preorder on the app store within the next week or so, with Google Play Store following soon after. My initial plan was to wait until it was available on the app store to update you all, but it has been a while and I want to keep you guys - wait for it - IN THE LOOP!!!\nAdditions in the last two weeks\nRevamped the whole entire UI, with the exception of the core parts of the homepage (New settings page will be the first five pictures down below)\nAdded a nice bottom tab page for navigating all three primary sections of the app\nWithin the settings page, added the 12 primary and 12 secondary themes, allowing for 144 different themes with more to come\nAdded a timer so you can see when your loop is going to refresh\nAdded an \"informed days\" system, where the more days you log on the more themes you get and more.\nRevamped the signup/login page (will be the sixth picture down below, seventh will be the old one)\nBegan working on the Explore page, which will likely be where most people spend most of their time on the app. This is very WIP but I absolutely LOVE it so far! I won't have a photo of it until next update though.\nGot rid of the big buttons on the home page, now I have a beautiful little tab thingy on the bottom (Will be the eighth and 9th pictures down below)\nAdded basically all the data collection so now every account has different saves, interests, themes, etc. Basically, your loop is now YOUR LOOP!\nMuch more is on the way, I just can't wait to get it on the dang app store so I can start PUSHING marketing!\nWhat is coming next\nIn the next two weeks, you can expect:\nLOOP ON THE APP STORE FOR PRE-ORDER!! (Likely in the next week)\nExplore page will be done (You still don't really know what it is yet, but it's awesome)\nALPHA testers, you will be able to DOWNLOAD LOOP ON YOUR DEVICE!!\nAt least one more update from me with more information!\nApp release date\nRight now, it's looking like Loop will either release late January, or February 1st. I will not let it take any longer than that. Make sure to join the waitlist at www.getloop.tech ASAP to know when you can download the app, and alpha and beta testers especially as you will get the app sooner than anyone else!\nPhotos (There's also some more text near the bottom, but you should check out the photos first)\n^^ Current settings page (ALL PRONE TO CHANGE. ALSO I HAVE A FEW OTHER SETTINGS I STILL WANT TO ADD (I wanna add a button that takes you into a deeper settings where you can set blocked news sources, push notifications, etc.))\n^^^ New sign up / log in page (I'll have apple and google sign in too)\n^^^ This was the old sign up/log in page (Much worse, way too wordy.)\n^^^ At the bottom you can see the new delete, add notifications, and add interest UI. It's much simpler and doesn't take up nearly as much of the screen.\n^^^ This was the old UI way back when the app was literally just the home page. See how much space the buttons are taking up? Boom!! \nWrap-up\nIf you actually read all of this or even skimmed through half of this, I am thoroughly impressed. If you read all of this or even skimmed through half of this and you aren't my mom or related to me, I am even more impressed. Have a wonderful day, the next update will come much sooner, apologies for the gap.\nP.S. There's a black and white theme as well if you'd rather not have a super colorful interface. MUCH MORE COMING SOON!!!",
        "url": "https://www.kickstarter.com/projects/jamespineiro/loop-2/posts/4285073",
        "likes_count": 5,
        "comments_count": 2,
        "comments": [
          {
            "text": "Hi, I am the founder of Digital Publishing platform called Inezine. I love this idea. While our ideas are definitively different. Your approach to \"clean up social media\" is amazing! My idea is also a decentralized media experience. I would love to possibly bring you in on the project if you are interested after you launch this. If interested I can send you my contact information off of Kickstarter. Thanks for the update, this app looks fun!",
            "commenter": "Rachel Sands - A Cleric of Witches",
            "timestamp": "January 3, 2025 7:29 AM AWST",
            "datetime": "1735860559",
            "relative_time": "2 months ago"
          },
          {
            "text": "If there's anything here you absolutely HATE, TELL ME!! We are a team, let's make Loop the best it can be!",
            "commenter": "James Piñeiro",
            "timestamp": "January 3, 2025 4:41 AM AWST",
            "datetime": "1735850495",
            "relative_time": "2 months ago"
          }
        ]
      },
      {
        "update_number": "UPDATE #2",
        "title": "GOAL REACHED! LOOP AVAILABLE FOR PRE-ORDER SOON! JOIN WAITLIST NOW!",
        "creator": "James Piñeiro\nNovember 28, 2024",
        "date": "November 28, 2024",
        "content": "GOAL REACHED!!\nHello everyone,\nThank you so much for your support! WE REACHED OUR GOAL OF $500, GREAT JOB!!! I am so incredibly touched by your generosity and determination to support my goal of making news more accessible for everyone globally.\nI have been quite busy within the past week, and have made quite a few updates to Loop. I'll keep this update brief and to the point, so I can outline what I've worked on.\nWhat I've been working on\nWaitlist is now available to join: If you'd like to get emails regarding the project, you can join the wishlist through this link: http://eepurl.com/i4kyhM \nApp now looks much better on iPad: It looked awful on iPad before, and now it's more comparable to the experience on your handheld.\nMost prominent thing I've been working on: LOOP IS COMING TO THE APP STORE FOR PRE-ORDER SOON!! STAY TUNED!! I've spent a lot of time working on the promotional art for the app store page as well, which I'll put below (iPad promotional images also below).\nWhat I'm currently working on\nWhat's next for Loop: I'm going to be working on better notifications, and implementing the customizable themes that you unlock for staying up to date with the news (Logging on the app for certain amounts of total days). Before I do any of that, I want to have the app available for pre-order on the Apple App Store and Google Play Store.\nConclusion\nStay tuned, and THANK YOU SO MUCH FOR EVERYTHING!! I have huge interviews next week and finals the week after so development might slow down during those weeks, but once winter break starts I will be GRINDING DEVELOPMENT LIKE CRAZY!!!!!!",
        "url": "https://www.kickstarter.com/projects/jamespineiro/loop-2/posts/4262540",
        "likes_count": 4,
        "comments_count": 0,
        "comments": []
      },
      {
        "update_number": "UPDATE #1",
        "title": "EXTRA REWARD TO ALL TIERS! APP CUSTOMIZATION! WEBSITE! SOCIAL MEDIAS CREATED! FIRST UPDATE!!",
        "creator": "James Piñeiro\nNovember 17, 2024",
        "date": "November 17, 2024",
        "content": "First Update!\nHey everybody! I have a few updates about Loop, and will be updating you guys about once every 1-2 weeks regarding the development process.\nThe Loop Website, getloop.tech has been released!\nIt features a nice overview of the app, provides socials, answers some of the most common questions I get regarding the app, and allows you to test themes that you'll be able to use in the app. Speaking of which..\nBeautiful App Themes!\nI've decided a great idea to add customization to Loop is to have custom colors and themes! I have just a few previewed on the website, so you can check some out there:\n(I just noticed the top right corner of the loop cuts off, whoops I'll fix that ASAP!)\nHow Can You Get These Themes?\nThese themes will be unlocked on Loop by staying informed and checking the news often (Not multiple days in a row or streaks or any gross, stress-inducing practices like that. It will be total number of days you check the news on Loop). But, if you support on Kickstarter, you'll notice that each backer tier has a different color (Example: $5 has a green background). You will automatically get the theme of whatever supporter tier you are (And all of the tiers below yours) when the app is released, so you will get a head start on customizing your Loop!\nWhat I've Been Working On, What I will Be Working On:\nSince I launched this Kickstarter a few days ago, I have created the whole getloop.tech website, and created an Instagram and YouTube for Loop.\nMy next goal is to create a solid short marketing video to post on @joinloop on Instagram, and TikTok once I make a TikTok for Loop, and YouTube shorts and LinkedIn as well. After that, my first course of action is to add the Loop animations to the app, and make the overall app more responsive and customizable.\nConclusion\nFirstly, thank you so much for reading this all! There are 25 of you and I appreciate all of you so much. I'm sure there's only like 1 or 2 who read this whole thing and you're definitely related to me if you did, so thank you so much for your continuous support. Stay tuned for my next update in one to two weeks, I look forward to keeping you all in the Loop.",
        "url": "https://www.kickstarter.com/projects/jamespineiro/loop-2/posts/4253889",
        "likes_count": 6,
        "comments_count": 3,
        "comments": [
          {
            "text": "That last bit about everyone who read this being related to you was really funny",
            "commenter": "Steven Cruise",
            "timestamp": "January 14, 2025 2:05 AM AWST",
            "datetime": "1736791500",
            "relative_time": "about 2 months ago"
          },
          {
            "text": "Amazing updates! Can’t wait to see what you do next! Be sure to keep me in the loop!!!",
            "commenter": "Lori Hurd",
            "timestamp": "November 17, 2024 8:25 PM AWST",
            "datetime": "1731846323",
            "relative_time": "4 months ago"
          },
          {
            "text": "Thank you so much!",
            "commenter": "James Piñeiro",
            "timestamp": "November 18, 2024 12:41 AM AWST",
            "datetime": "1731861679",
            "relative_time": "4 months ago"
          }
        ]
      }
    ]
  }
}