{
  "url": "https://www.kickstarter.com/projects/ludocene/ludocene-game-discovery-from-people-you-trust",
  "campaign_details": {
    "funding_period_text": "Funding period\nFeb 18 2025 - Mar 14 2025 (23 days)",
    "funding_start_date": "2025-02-18T08:47:27-05:00",
    "funding_end_date": "2025-03-13T17:00:00-04:00",
    "funding_duration_days": 23,
    "pledged_amount": "£33,007",
    "funding_goal": "£26,280",
    "backers_count": "1,408",
    "days_left": 6
  },
  "updates": {
    "count": 5,
    "content": [
      {
        "update_number": "UPDATE #5",
        "title": "Roadmap and Early Access Plans",
        "creator": "Andy Robertson\nMarch 18, 2025",
        "date": "March 18, 2025",
        "content": "We are working hard this week to get the Prototype spick and span for Monday (24th March). Some useful notes ahead of this:\nDo keep sharing the Kickstarter with any friends/family/community who want to join in the Early Access. We have now enabled Late Pledges.\nWe will message you when the Prototype is available on the 24th.\nYou will use the email you registered your pledge with to access the Prototype via Ludocene.com on a mobile device.\nIt's a Prototype. Be gentle, but we very much want your feedback via the button on the homepage.\nThe final version will support Desktop, Tablet and Phone.\nRoadmap\nHere are the main milestones in our roadmap between now and releasing Version 1.0 to the general public at the end of August:\n24th March - Prototype available to backers.\n8th-11th May - PAX East Boston: Public access to the app, with the team on hand in the Family Gaming Zone.\n23rd-25th May - ComicCon London: Public access to the app, with the team on hand in the Family Gaming Zone.\nJune - Open Online Meeting for Backers with updates on progress.\nJuly - Beta Access to Ludocene for backers.\nAugust - Release Version 1.0.\nThanks again for all the support. We can't wait to get this in your hands to have fun with. Your feedback, ideas and suggestions will play a crucial part in Ludocene being all it can be.\nAndy",
        "url": "https://www.kickstarter.com/projects/ludocene/ludocene-game-discovery-from-people-you-trust/posts/4339655",
        "likes_count": 18,
        "comments_count": 3,
        "comments": [
          {
            "text": "Hi Andy! I see some on Bluesky say they've received their access already. Are the emails being sent in stages? I'm really looking forward to geting mine, and I don't want to miss it!",
            "commenter": "Ed Ferrara",
            "timestamp": "March 24, 2025 10:15 PM AWST",
            "datetime": "1742825707",
            "relative_time": "2 minutes ago"
          },
          {
            "text": "Hi, my email doesn’t seem to work on the website despite backing you. How would this be rectified sorry?",
            "commenter": "Ben Dawson",
            "timestamp": "March 19, 2025 9:09 AM AWST",
            "datetime": "1742346547",
            "relative_time": "6 days ago"
          },
          {
            "text": "We will be in touch on Monday (24th) with details on how to access. You will use your email, but we need to go through and set them all up. Hope that helps!",
            "commenter": "Andy Robertson",
            "timestamp": "March 19, 2025 3:30 PM AWST",
            "datetime": "1742369421",
            "relative_time": "5 days ago"
          }
        ]
      },
      {
        "update_number": "UPDATE #4",
        "title": "We Did It: The End of the Beginning",
        "creator": "Andy Robertson\nMarch 14, 2025",
        "date": "March 14, 2025",
        "content": "Thank you again for your faith in this idea and our team to make it a reality. The Kickstarter has now been completed. We do have late pledges if any friends or family want to get in on it, and this will continue to extend the features and number of experts we can include.\nWe are now starting to process all the pledges to organise the fulfilment of the rewards. With so many amazing backers, there's quite a bit to do. We also have a bit of housekeeping on the prototype to get it into your hands in a form that will show it off and enable you to offer feedback.\nI'll be writing with a full roadmap of our journey from here to the finished product next week. But wanted to let you know right away that we will have the prototype in your hands on the 24th March - a week on Monday.\nIn the meantime, we also have news that we'll be showing off Ludocene in public at two big events in May. Do come and say hello; we'll be on the Family Gaming Zone area. \nComicCon London - May 23-25, 2025\nPAX East Boston - May 8-11, 2025\nThanks again for all the continuing support and enthusiasm for the project.",
        "url": "https://www.kickstarter.com/projects/ludocene/ludocene-game-discovery-from-people-you-trust/posts/4336936",
        "likes_count": 23,
        "comments_count": 1,
        "comments": [
          {
            "text": "Congratulations! I'm really happy for you all, and I'm excited about the product. Best of luck with the rest of the journey!",
            "commenter": "Darryl Young",
            "timestamp": "March 14, 2025 4:00 PM AWST",
            "datetime": "1741939243",
            "relative_time": "10 days ago"
          }
        ]
      },
      {
        "update_number": "UPDATE #3",
        "title": "100% Funded and Featured on BBC Newsbeat",
        "creator": "Andy Robertson\nMarch 11, 2025",
        "date": "March 11, 2025",
        "content": "I'm very happy to share that WE HAVE FUNDED! Our new Ludocene game-finder app is going to be a reality because of the support, pledges and encouragement of our lovely backers.\nThe campaign ends this week, at 9pm GMT on Thursday 13th. Now is the perfect time to share the project (perhaps on Bluesky or X?) with people who might want to get in on our rewards - not least getting access to our prototype.\nI'll be in touch once the Kickstarter has finished with an update on plans and a roadmap so you know the timeline and milestones we have in place as we work towards our launch.\nPowerup Your Rewards?\nThere's still time to check out our reward tiers, in case you fancy an upgrade now we know our app will be a reality:\nSubscriber (£20) gets you one year's access to all the bells and whistles we'll be adding (worth £36), as well as a digital copy of my book (worth £9.99).\nTaste Maker (£75) gets you all the above, plus you join our inner circle of people who can suggest and vote for experts to be added.\nAdd Your Game (£75) is a great way to add your game to the launch platform, as well as get an invite to our public hands-on with the app at ComicCon and PAX East.\nOn The BBC\nIn other news (literally), we were also featured on the BBC today. \"A dating app for video games tackles one of the industry's big issues.\" We've seen a nice influx of pledges since that went out on Newsbeat.\nThank you again for all the support, messages and enthusiasm. We can't wait to get the prototype in your hands and then get building the final product.",
        "url": "https://www.kickstarter.com/projects/ludocene/ludocene-game-discovery-from-people-you-trust/posts/4334325",
        "likes_count": 23,
        "comments_count": 3,
        "comments": [
          {
            "text": "Congrats! Can't wait to try it out!",
            "commenter": "Hitpointed",
            "timestamp": "March 11, 2025 11:13 PM AWST",
            "datetime": "1741706008",
            "relative_time": "13 days ago"
          },
          {
            "text": "as an early bird supporter, is there an upgrade path for any discounted subscribers tier reward?",
            "commenter": "A Murder of Crows",
            "timestamp": "March 11, 2025 9:01 PM AWST",
            "datetime": "1741698085",
            "relative_time": "13 days ago"
          },
          {
            "text": "Congrats, so excited!",
            "commenter": "Julia B",
            "timestamp": "March 11, 2025 8:23 PM AWST",
            "datetime": "1741695826",
            "relative_time": "13 days ago"
          }
        ]
      },
      {
        "update_number": "UPDATE #2",
        "title": "90% Funded and Featured in the Financial Times",
        "creator": "Andy Robertson\nMarch 7, 2025",
        "date": "March 7, 2025",
        "content": "How else can I start this update but with a huge thank you to everyone who has backed, shared and cheered on our game-finder project!\nIt's been a busy week as we have been excited by the enthusiastic response from the press and public. Of note, we had some rave reviews of our plans; from the prestige of the Financial Times to the rock and roll of NME, the Ludocene app is making waves. \nWe've also just been featured on one of our favourite shows, the Back Page Podcast. Then, there was coverage on Kotaku and Overkill. It's kind of hard to keep up, but wherever people are talking about the project, they are hugely enthusiastic and excited to get their hands on it.\nTiers Of The Kingdom\nHaving sold out of the Early Bird reward tier, the Subscriber tier is now our most popular. This grants you access to all the extra cards and additional experts we add in the 12 months after launch. Or there's the Subscriber + tier that also includes my signed hardback book.\nStretching Towards Board Game Discovery\nWithout wanting to count our chickens, we have added more details to the Stretch Goals. We are particularly excited about the possibility of bringing our game-finding dating app to the world of board games. If we hit £50k that will be included for all backers. \nIf you know anyone who'd like a playful approach to finding their next board game, card game or table top favourite, do help us get the word out.\nFinal Thank You\nI'll end this update as I started with a huge thank you to all our amazing supporters. You are making this thing possible, and it's slightly blowing our minds.\nPS Just wanted to mention this friend project, Forensic: Hands-on Investigations Kickstarter, launching soon. Worth checking out.",
        "url": "https://www.kickstarter.com/projects/ludocene/ludocene-game-discovery-from-people-you-trust/posts/4331606",
        "likes_count": 19,
        "comments_count": 2,
        "comments": [
          {
            "text": "Snuck in right near the end thanks to The Back Page. :) I'm *really* keen to see you succeed with this project and use it a bit myself, and pleased as punch to see the Kickstartery has just crossed the magic line this evening!",
            "commenter": "particlese",
            "timestamp": "March 10, 2025 5:01 AM AWST",
            "datetime": "1741554115",
            "relative_time": "15 days ago"
          },
          {
            "text": "Wooo hooo! So close 🙌🙌",
            "commenter": "Josh (Indieformer)",
            "timestamp": "March 8, 2025 4:16 AM AWST",
            "datetime": "1741378565",
            "relative_time": "17 days ago"
          }
        ]
      },
      {
        "update_number": "UPDATE #1",
        "title": "32% Funded and Featured in The Guardian!",
        "creator": "Andy Robertson\nFebruary 26, 2025",
        "date": "February 26, 2025",
        "content": "The first week of the Kickstarter has been amazing. We just hit 32% funded with 572 backers! \nThe flood of appreciation, pledges and press coverage is a powerful confirmation that the timing is right for our way to discover games.\nWe were featured in The Guardian's Pushing Button's newsletter as its main story. They said \"the Tinder of games is here… Ludocene caters to people who want a recommendation from an expert rather than a robot.”\nPolygon wrote a piece about us. They described us as the “video game that helps you find more video games.\"\nWe were featured in the Japanese site GameSpark.jp and the Manettini tech newsletter in Italy. \nI was on the Y-Button podcast for an in-depth conversation about the project.\nOver half of the early bird pledges have now been snapped up. And 152 people have pledged at the Subscriber level, where they get all the extra Experts we add in the first year after launch.\nThank you again for all your support, appreciation and questions. We've created quite a buzz together that's extending into national media! Now we can't wait to deliver this for you.",
        "url": "https://www.kickstarter.com/projects/ludocene/ludocene-game-discovery-from-people-you-trust/posts/4319893",
        "likes_count": 7,
        "comments_count": 1,
        "comments": [
          {
            "text": "You guys were featured on overkill.wtf's latest weekly newsletter too! That's how I found out about the project 😊",
            "commenter": "Firalia",
            "timestamp": "February 26, 2025 4:47 AM AWST",
            "datetime": "1740516466",
            "relative_time": "27 days ago"
          }
        ]
      }
    ]
  }
}