{
  "url": "https://www.kickstarter.com/projects/mattbechberger/lumo",
  "campaign_details": {
    "funding_period_text": "Funding period\nJan 26 2025 - Feb 25 2025 (30 days)",
    "funding_start_date": "2025-01-25T12:00:16-05:00",
    "funding_end_date": "2025-02-24T12:00:16-05:00",
    "funding_duration_days": 30,
    "pledged_amount": "CA$ 124,420",
    "funding_goal": "CA$ 32,500",
    "backers_count": "587"
  },
  "updates": {
    "count": 6,
    "content": [
      {
        "update_number": "UPDATE #6",
        "title": "Update #5: More Colour Features",
        "creator": "Matt Bechberger\nFebruary 28, 2025",
        "date": "February 28, 2025",
        "content": "Hi Everyone,\nI've been working on some more colour filter features.  I've added that the meter can calculate tint and temperature filters needed to bring the light back to neutral.\nIn the picture below, you can see the meter indicating the opposite filter needs to be applied to get the colour back to neutral.  It reads out the filters in 1/8 filter increments.\nIt also does this with the colour temperature:\nIt's not perfect but for practical use I think it works well enough.\nThere are new options when you scroll down to the bottom of the main menu, the menu continues and shows the various colour options you can set.\nYou can get the temperature shift to read out in filters, or mireds, or as a simple difference.  You can set your film temperature in this menu as well, which is what the temperature filters are calculated to correct to.\nHere the tint is shown as a shift in Photoshop tint units (DUV x 3000) and the temperature shown as a relative change in temperature from the 5500K daylight temp I set it to in the menu.\nI'm going to work on adding lens warming and cooling filters (80A, 85B, etc) next.\nLUMO isn't going to perform the same as a $2000+ handheld spectrometer but it will definitely work for practical colour corrections.\nLet me know if you have questions.\n-Matt",
        "url": "https://www.kickstarter.com/projects/mattbechberger/lumo/posts/4324604",
        "likes_count": 24,
        "comments_count": 13,
        "comments": [
          {
            "text": "Outstanding work on the color updates. I can hardly wait to dive into the possibilities.",
            "commenter": "Randall Stewart",
            "timestamp": "March 1, 2025 8:31 AM AWST",
            "datetime": "1740789089",
            "relative_time": "12 days ago"
          },
          {
            "text": "Thanks Matt, this looks awesome. Apologies if this is already in the feature set, but I was wondering if there was a way to perform practically the reverse- take a measurement and have the meter respond with which gels to add to a light in order to match the ambient? My ideal workflow would be to meter the ambient colour + intensity, set WB and exposure, then appropriately gel my flash to match this WB, meter flash, and then adjust flash power for appropriate duration. This is easy enough with some math, ie if I read 4000k I can use a 1/2 CTO (ish?), but outside of my basic understanding when factoring in G/M tilt.",
            "commenter": "Josh Wells",
            "timestamp": "February 28, 2025 11:36 AM AWST",
            "datetime": "1740713779",
            "relative_time": "13 days ago"
          },
          {
            "text": "Hi Josh, I think this would be done by metering the target light and getting the tint/temp, then meter the light to be altered and apply the sum of the gels. So if your target light is 1/4 magenta and the light to adjust is 1/4 green, you know you need to apply a 1/2 magneta to the green one to get it to match the magneta one. I think this would work. I'm not experienced in lighting and all the filter/gel stuff I know about is from is from researching this project. LUMO cannot meter flash temp or tint, so you will need to know your flash's temp/tint per the manufacturer and measure your ambient and filter the flash accordingly. I think the workflow you described will work.",
            "commenter": "Matt Bechberger",
            "timestamp": "February 28, 2025 12:05 PM AWST",
            "datetime": "1740715507",
            "relative_time": "13 days ago"
          },
          {
            "text": "Hi Matt, Thanks for your reply. My hope would be that a feature like above would circumvent the inability to meter colour for flash ie. if I knew my flash was 5500k with negligible g/m shift, I could meter for ambient colour and then gel my flash to match. This is a different language than on-lens filters, so I can appreciate that it's likely more effort than you're willing to do for such a niche feature. I also don't personally know with what intensity a +/-X G/M cast should be gelled in order to offset back to 0. Warm regards, Josh",
            "commenter": "Josh Wells",
            "timestamp": "March 4, 2025 10:11 AM AWST",
            "datetime": "1741054284",
            "relative_time": "9 days ago"
          },
          {
            "text": "I think the easiest way would be to attach a little printed chart telling you how much each gel changes colour temp. If you set the film temperature on the meter to 5500K, it will tell you which gel would be needed to colour correct the current ambient to the flash, and so you would apply the opposite filter in the same amount (eg 1/2 blue on the meter would be 1/2 amber gel on the flash).",
            "commenter": "Matt Bechberger",
            "timestamp": "March 7, 2025 4:10 AM AWST",
            "datetime": "1741291827",
            "relative_time": "7 days ago"
          },
          {
            "text": "Typical Matt, just adding crazy features left and right",
            "commenter": "Evan Katz",
            "timestamp": "February 28, 2025 9:01 AM AWST",
            "datetime": "1740704499",
            "relative_time": "13 days ago"
          },
          {
            "text": "It's what I do. I got lens colour correction filters working today.",
            "commenter": "Matt Bechberger",
            "timestamp": "February 28, 2025 9:41 AM AWST",
            "datetime": "1740706893",
            "relative_time": "13 days ago"
          },
          {
            "text": "This is awesome, The LUMO does so much more than I anticipated . I hope you are as good in creating documentation as you are in creating. I will need it. Thanks for the updates.",
            "commenter": "Ken Tannenbaum",
            "timestamp": "February 28, 2025 12:58 AM AWST",
            "datetime": "1740675528",
            "relative_time": "14 days ago"
          },
          {
            "text": "Thanks Ken. I will have some time to work on the user manual while waiting for all the parts to deliver.",
            "commenter": "Matt Bechberger",
            "timestamp": "February 28, 2025 1:12 AM AWST",
            "datetime": "1740676377",
            "relative_time": "14 days ago"
          },
          {
            "text": "Great feature.",
            "commenter": "Felix",
            "timestamp": "February 28, 2025 12:57 AM AWST",
            "datetime": "1740675431",
            "relative_time": "14 days ago"
          },
          {
            "text": "Thanks Felix",
            "commenter": "Matt Bechberger",
            "timestamp": "February 28, 2025 1:12 AM AWST",
            "datetime": "1740676346",
            "relative_time": "14 days ago"
          },
          {
            "text": "I'd love to know if you plan on displaying both exposure and color temp on one screen. I currently have to take 2 measurements and view 2 different devices. It would be nice to click a measure button once and get both values!",
            "commenter": "William Morton",
            "timestamp": "February 28, 2025 12:57 AM AWST",
            "datetime": "1740675422",
            "relative_time": "14 days ago"
          },
          {
            "text": "Currently, colour temp is shown on the main incident metering screen. If you want more details, you have to press and hold the left or right button to view the colour screen, which as these extra details. You can take fresh readings in either screen as well, and switching back and forth takes half a second.",
            "commenter": "Matt Bechberger",
            "timestamp": "February 28, 2025 1:12 AM AWST",
            "datetime": "1740676341",
            "relative_time": "14 days ago"
          }
        ]
      },
      {
        "update_number": "UPDATE #5",
        "title": "Campaign Finished!",
        "creator": "Matt Bechberger\nFebruary 25, 2025",
        "date": "February 25, 2025",
        "content": "Hi Everyone,\nThank you for making this campaign a great success!\nWhat's up for March:\nReceive final sample of CNC enclosure\nOrdering PCBs, parts, enclosure pieces, screws, packaging\nPolishing up some colour filter calculating and some other software stuff\nI'll post monthly updates as things come along.  The next one will be near the end of March.\nThanks,\n-Matt",
        "url": "https://www.kickstarter.com/projects/mattbechberger/lumo/posts/4322028",
        "likes_count": 18,
        "comments_count": 2,
        "comments": [
          {
            "text": "Will the design enable users to update firmware if you develop changes/updates?",
            "commenter": "Richard Pelletier",
            "timestamp": "February 25, 2025 7:29 AM AWST",
            "datetime": "1740439769",
            "relative_time": "17 days ago"
          },
          {
            "text": "Hi Richard, yes the software is easily updated by USB.",
            "commenter": "Matt Bechberger",
            "timestamp": "February 25, 2025 9:47 AM AWST",
            "datetime": "1740448040",
            "relative_time": "16 days ago"
          }
        ]
      },
      {
        "update_number": "UPDATE #4",
        "title": "Update #4 - More New Features",
        "creator": "Matt Bechberger\nFebruary 16, 2025",
        "date": "February 16, 2025",
        "content": "Hi Everyone,\nI just finished a new feature: flicker detection.\nNow you can check your light sources for flicker, it will show you the primary flicker frequency, a 50ms waveform segment, and the % of flicker (brightest vs dimmest).  The example below shows the severe flickering of my kitchen's LED light.  This feature will be a big help to videographers.\n-Matt",
        "url": "https://www.kickstarter.com/projects/mattbechberger/lumo/posts/4315251",
        "likes_count": 39,
        "comments_count": 6,
        "comments": [
          {
            "text": "A feature I didn't even know I wanted. That is very useful!",
            "commenter": "Nathan Stansell",
            "timestamp": "February 20, 2025 3:35 AM AWST",
            "datetime": "1739993751",
            "relative_time": "22 days ago"
          },
          {
            "text": "Hey Matt, looking forward to this one :) Any chance of fc / lux toggle? Cheers!",
            "commenter": "Zoran",
            "timestamp": "February 17, 2025 11:43 PM AWST",
            "datetime": "1739807036",
            "relative_time": "24 days ago"
          },
          {
            "text": "Hi Zoran, it's on my list. Main issue is finding where to put the option in the menu.",
            "commenter": "Matt Bechberger",
            "timestamp": "February 18, 2025 12:57 AM AWST",
            "datetime": "1739811459",
            "relative_time": "24 days ago"
          },
          {
            "text": "This tool gets more and more useful… Good looking out, nice doings !!!",
            "commenter": "DeeCee",
            "timestamp": "February 17, 2025 4:26 PM AWST",
            "datetime": "1739780768",
            "relative_time": "24 days ago"
          },
          {
            "text": "This is brilliant, mate, good work!!",
            "commenter": "Hamish Gill",
            "timestamp": "February 16, 2025 5:03 AM AWST",
            "datetime": "1739653381",
            "relative_time": "26 days ago"
          },
          {
            "text": "Thanks Hamish",
            "commenter": "Matt Bechberger",
            "timestamp": "February 16, 2025 6:14 AM AWST",
            "datetime": "1739657662",
            "relative_time": "26 days ago"
          }
        ]
      },
      {
        "update_number": "UPDATE #3",
        "title": "Update #3 - Working On New Features",
        "creator": "Matt Bechberger\nFebruary 13, 2025",
        "date": "February 13, 2025",
        "content": "Hi Everyone,\nI've got some new features I'm working on.\nXY Coordinates and Colour Tint\nI've managed to get the meter to now measure not only colour temperature, but also the XY colour space coordinates, and the tint amount.  When taking a photo and entering these numbers into Photoshop manually, they closely match the results given by Photoshop's white balance eyedropper off a grey card.  I need to keep researching and experimenting to make sure it's accurate with various filter types, so I'm waiting for a full colour correction filter set to arrive so I can test further.\nFlash High Speed Sync\nI've added high speed sync support, as shown in the GIF below.  If you raise the shutter speed above 1/125, the meter automatically flips to HSS mode (shutter speed turns yellow) and starts recalculating the aperture according to what is needed for a HSS-enabled flash.  It works great.  The flash/ambient ratio still needs work though as it's not correctly calculating at the HSS shutter speeds.\nMore to come.\nLet me know if you have any questions in the comments.\n-Matt",
        "url": "https://www.kickstarter.com/projects/mattbechberger/lumo/posts/4313282",
        "likes_count": 23,
        "comments_count": 8,
        "comments": [
          {
            "text": "Hi Matt. Would it be possible, and would you consider dividing meter's options into sort of 'basic' and 'pro modes'? I imagine a lot of people would just be interested in the basic meter functionality, and wouldn't fancy juggling through all these highly advanced options on a daily basis. If that's how the meter already works then great! Thanks.",
            "commenter": "Mariusz Ciesielski",
            "timestamp": "February 14, 2025 7:59 PM AWST",
            "datetime": "1739534345",
            "relative_time": "27 days ago"
          },
          {
            "text": "Hi Mariusz, the more advanced features are hidden fairly well, I don't think it will be an issue in daily use for someone not needing the fancier features.",
            "commenter": "Matt Bechberger",
            "timestamp": "February 15, 2025 1:02 AM AWST",
            "datetime": "1739552549",
            "relative_time": "27 days ago"
          },
          {
            "text": "this update is fantastic! I really appreciate you incorporating our feedback.",
            "commenter": "Dejan",
            "timestamp": "February 14, 2025 4:57 AM AWST",
            "datetime": "1739480244",
            "relative_time": "28 days ago"
          },
          {
            "text": "Thanks Dejan.",
            "commenter": "Matt Bechberger",
            "timestamp": "February 14, 2025 5:37 AM AWST",
            "datetime": "1739482670",
            "relative_time": "28 days ago"
          },
          {
            "text": "Hi Matt, Thank you very much for the update. Hope you do not mind a question regarding the HSS option. Is it possible to make the HSS shutter speed changeable? I tend to use medium format leaf shutter lenses which can sync at all speeds. In case of the Hasselblad lenses that would be 1/500. It would be great if the HSS option can be switched off or change the HSS speed. Does that make any sense?",
            "commenter": "Marcel Schepers",
            "timestamp": "February 14, 2025 12:01 AM AWST",
            "datetime": "1739462472",
            "relative_time": "28 days ago"
          },
          {
            "text": "",
            "commenter": "jackgeng",
            "timestamp": "February 14, 2025 5:39 AM AWST",
            "datetime": "1739482790",
            "relative_time": "28 days ago"
          },
          {
            "text": "yes, enabling HSS metering via menu (rather than default) would be great!",
            "commenter": "Joel Richards",
            "timestamp": "February 26, 2025 1:35 AM AWST",
            "datetime": "1740504926",
            "relative_time": "16 days ago"
          },
          {
            "text": "I just want to second Marcel’s comment. The HSS metering a cool feature but I have three cameras each with very different max sync speeds. Even disabling the feature when not needed would be great.",
            "commenter": "Matt Bechberger",
            "timestamp": "February 26, 2025 1:56 AM AWST",
            "datetime": "1740506160",
            "relative_time": "16 days ago"
          }
        ]
      },
      {
        "update_number": "UPDATE #2",
        "title": "Update #2: Video by the120ist",
        "creator": "Matt Bechberger\nFebruary 7, 2025",
        "date": "February 7, 2025",
        "content": "Hi Everyone,\nNick from the120ist came to visit the Lab last week and shot a video of us talking about the LUMO.  Then we shot some 4x5 Velvia slide film in the forest.  Take a look at it below:\n-Matt",
        "url": "https://www.kickstarter.com/projects/mattbechberger/lumo/posts/4308833",
        "likes_count": 11,
        "comments_count": 0,
        "comments": []
      },
      {
        "update_number": "UPDATE #1",
        "title": "THANK YOU!",
        "creator": "Matt Bechberger\nJanuary 29, 2025",
        "date": "January 29, 2025",
        "content": "Hi Everyone,\nThank you to all for making this campaign a success!  It's already approaching 200% of the funding goal.  To everyone who has shared this with their friends, I appreciate the support. Getting the word out there grassroots-style is a huge help in boosting the campaign.\nI've spent the past week making some tweaks and perfections to the meter software.  Once the campaign closes and I have the final numbers, I'll immediately begin ordering.  I also have a couple of ideas for more features to add by software, like flicker detection mode.\nPlease let me know if you have any questions.\n-Matt",
        "url": "https://www.kickstarter.com/projects/mattbechberger/lumo/posts/4302181",
        "likes_count": 18,
        "comments_count": 6,
        "comments": [
          {
            "text": "Good morning from California! I hope your day is going well. 2 questions did spring to my mind. 1) will different sensor profiles be supported - i.e. m4/3, aps-c 1.5 aps-c 1.6, medium format, point and shoot 1 inch, 1/1.6, 2/3, etc. I have multiple formats I shoot it I get the conversions mixed up. 2) any chance I'll see I Kickstart for built-in flash to hotshoe attachment, or built-in flash to flash cable attachment? I do a lot of highspeed flash sync with cameras that don't have a hotshoe and triggering a slave flash from a distance with the built in flash unreliable. Cheers!",
            "commenter": "David Enero",
            "timestamp": "January 30, 2025 11:04 PM AWST",
            "datetime": "1738249499",
            "relative_time": "about 1 month ago"
          },
          {
            "text": "Hi David, Thanks for the message. 1) There is no impact on exposure with sensor size. example EV15 = 1/125 f16 ISO100 on all cameras, even phones. 2) So something like an optical sensor that will detect the built-in flash firing, then trigger a hotshoe?",
            "commenter": "Matt Bechberger",
            "timestamp": "January 30, 2025 11:13 PM AWST",
            "datetime": "1738249994",
            "relative_time": "about 1 month ago"
          },
          {
            "text": "Hi, Matt! I have your 3D printed spot meter already and love it. I backed the Lumo today. I also posted about it in the Frames Magazine online community, where I'm a member. That may drive some of those photographers your way. Good luck finishing the campaign. I'm excited to get my hands on another of your innovative (and affordable!) products.",
            "commenter": "John Tobison",
            "timestamp": "January 30, 2025 1:21 AM AWST",
            "datetime": "1738171286",
            "relative_time": "about 1 month ago"
          },
          {
            "text": "Thanks John, I appreciate your support.",
            "commenter": "Matt Bechberger",
            "timestamp": "January 30, 2025 1:37 AM AWST",
            "datetime": "1738172277",
            "relative_time": "about 1 month ago"
          },
          {
            "text": "I no longer have any use for another light meter, but I am hoping that you can make a sustainable business from these projects, that will continue to benefit film photographers for a long time to come.",
            "commenter": "Nikhil Ramkarran",
            "timestamp": "January 30, 2025 12:22 AM AWST",
            "datetime": "1738167742",
            "relative_time": "about 1 month ago"
          },
          {
            "text": "Thank you Nikhil",
            "commenter": "Matt Bechberger",
            "timestamp": "January 30, 2025 12:23 AM AWST",
            "datetime": "1738167833",
            "relative_time": "about 1 month ago"
          }
        ]
      }
    ]
  }
}