{
  "url": "https://www.kickstarter.com/projects/mecarmygear/mecarmy-rl4-edc-prybar-screwdriver-set-and-opener-carabiner",
  "campaign_details": {
    "funding_period_text": "Funding period\nJan 30 2025 - Mar 1 2025 (30 days)",
    "funding_start_date": "2025-01-30T07:00:33-05:00",
    "funding_end_date": "2025-03-01T07:00:33-05:00",
    "funding_duration_days": 30,
    "pledged_amount": "HK$ 57,985",
    "funding_goal": "HK$ 8,000",
    "backers_count": "64"
  },
  "updates": {
    "count": 1,
    "content": [
      {
        "update_number": "UPDATE #1",
        "title": "CH17 Bottle Opener Adds New Functionality to Your RL4 Prybar!",
        "creator": "mecarmy\nFebruary 11, 2025",
        "date": "February 11, 2025",
        "content": "Hello backers,\nWe’re excited to share some great news with you! In addition to our RL4 Prybar, we’ve now introduced a perfect companion to enhance your EDC toolkit: the CH17 Quick-Release Bottle Opener Keychain.\nHere’s what makes the CH17 a must-have addition to your everyday carry:\n1. High-Strength Titanium Alloy\nThe CH17 is crafted from TC4 titanium alloy, which is both lightweight and incredibly strong. This ensures that you can easily and quickly open bottle caps or use it for other tasks without worrying about wear and tear. Its corrosion-resistant properties also make it the ideal companion for outdoor adventures, providing you with durability you can rely on.\n2. Bottle Opener Function\nThe CH17 is more than just a bottle opener. It’s designed to tackle everyday tasks like opening tightly sealed bottles, boxes, or other containers. When paired with the RL4 Prybar, it forms an indispensable toolset that’s ready for any urgent or daily need you may face.\n3. Quick-Release Design for Easy Carrying\nWith its quick-release design, you can easily attach the CH17 to your keychain, backpack, or belt, ensuring it’s always at hand whenever you need it. Whether you're heading out on an outdoor adventure or going about your daily activities, this keychain adds ultimate convenience to your carry.\nWe believe the CH17 perfectly complements the RL4 Prybar, making them the ideal pair for your EDC gear. Together, these two tools will ensure you're always prepared, whether you're tackling big projects or just enjoying a day out.\nThank you for your continued support! We can’t wait to bring these awesome tools into your hands!\nBest regards,\nThe MecArmy Team",
        "url": "https://www.kickstarter.com/projects/mecarmygear/mecarmy-rl4-edc-prybar-screwdriver-set-and-opener-carabiner/posts/4311534",
        "likes_count": 3,
        "comments_count": 0,
        "comments": []
      }
    ]
  }
}