{
  "url": "https://www.kickstarter.com/projects/758873559/memdock-gen2-7-in-1-mutible-diy-keyboard-hub",
  "campaign_details": {
    "funding_period_text": "Funding period\nJan 28 2025 - Feb 27 2025 (30 days)",
    "funding_start_date": "2025-01-28T02:00:58-05:00",
    "funding_end_date": "2025-02-27T02:00:58-05:00",
    "funding_duration_days": 30,
    "pledged_amount": "",
    "funding_goal": "HK$ 30,000",
    "backers_count": "452"
  },
  "updates": {
    "count": 2,
    "content": [
      {
        "update_number": "UPDATE #2",
        "title": "🎉 Thank You for Your Support! Memdock Kickstarter Campaign has reached a successful conclusion!! 🎉",
        "creator": "MEMDock\nFebruary 27, 2025",
        "date": "February 27, 2025",
        "content": "Hi Guys!\nWe are very excited to announce that our Memdock Gen2 Kickstarter campaign has reached a successful conclusion! We sincerely thank all of our backers for their trust and enthusiasm. Your support has made this project possible. Without your help, we would not be able to get to this point today.\nIn the past few weeks, we have worked closely with the manufacturing team to develop a detailed production plan and ensure that every step is progressing as planned. To keep everyone better informed of the latest progress, we will post regular updates on the project.\nNext steps:\nIn order to ship smoothly, we will send a questionnaire containing an email to collect the mailing address of each backer and calculate the corresponding shipping costs. Please note that the survey email will be sent after about a week. Please fill it out in time to avoid delays in shipping.\nAbout payment issues:\nWe have also noticed that some backers may have failed to charge their credit cards. If your payment is not successful, please update your payment information as soon as possible. You can click on this link to see how to change your payment method:\n\nhttps://help.kickstarter.com/hc/en-us/articles/115005132933-How-can-I-change-my-payment-method-before-funding-ends\nUpdate the payment method. Please make sure your payment is completed before the deadline to avoid missing your reward.\nWe are making final preparations for shipping and look forward to getting the product to you as soon as possible! In the meantime, if you have any questions or feedback, please feel free to contact us via Kickstarter messaging or by sending an email to our customer support email at support@memdock.com.\nThank you again for your support and interest in our project! We will continue to work hard to ensure smooth delivery and provide you with the best product and experience.\nSincerely,\nMemdock Team",
        "url": "https://www.kickstarter.com/projects/758873559/memdock-gen2-7-in-1-mutible-diy-keyboard-hub/posts/4324370",
        "likes_count": 3,
        "comments_count": 1,
        "comments": [
          {
            "text": "YES I WILL",
            "commenter": "MEMDock",
            "timestamp": "March 3, 2025 2:04 PM AWST",
            "datetime": "1740981872",
            "relative_time": "10 days ago"
          }
        ]
      },
      {
        "update_number": "UPDATE #1",
        "title": "Memdock's Latest Kickstarter Campaign is now LIVE!🎉",
        "creator": "MEMDock\nJanuary 28, 2025",
        "date": "January 28, 2025",
        "content": "Hi Guys!\nWe are super excited to hear your feedback! Whether you're facing any issues, have suggestions, or even if you're dissatisfied with something, we want to know. Your input is incredibly valuable to us, and we promise to carefully consider all feedback and provide a prompt, satisfactory response. Together, let's make this project a success!\nAs a professional Hub production team, we're here to bring your ideas to life. If you have any concepts or features you'd like to see in a Hub, feel free to leave us a message or contact us directly:\nWebsite: www.memdock.com\nFacebook Group: https://www.facebook.com/groups/935947285292783.\nLet’s innovate together! Use your imagination, and we’ll help make your ideas a reality!\nThanks again for your support!\nMemdock Team",
        "url": "https://www.kickstarter.com/projects/758873559/memdock-gen2-7-in-1-mutible-diy-keyboard-hub/posts/4301102",
        "likes_count": 2,
        "comments_count": 0,
        "comments": []
      }
    ]
  }
}