{
  "url": "https://www.kickstarter.com/projects/midilli/midilli-design-your-dream-midi-controller",
  "campaign_details": {
    "funding_period_text": "Funding period\nNov 29 2024 - Jan 28 2025 (60 days)",
    "funding_start_date": "2024-11-28T15:52:24-05:00",
    "funding_end_date": "2025-01-27T15:52:24-05:00",
    "funding_duration_days": 60,
    "pledged_amount": "",
    "funding_goal": "€900",
    "backers_count": "8"
  },
  "updates": {
    "count": 4,
    "content": [
      {
        "update_number": "UPDATE #4",
        "title": "We have launched! 🚀",
        "creator": "MIDILLI\nMarch 10, 2025",
        "date": "March 10, 2025",
        "content": "Thank you all for making this project a reality!\nYesterday at 19:00 CET, we held our launch event. Unfortunately, not everyone could attend. But don't worry, all backers will receive the presentation along with the workshop video to help them create their designs.\nStill have questions? Feel free to ask!",
        "url": "https://www.kickstarter.com/projects/midilli/midilli-design-your-dream-midi-controller/posts/4333005",
        "likes_count": 0,
        "comments_count": 0,
        "comments": []
      },
      {
        "update_number": "UPDATE #3",
        "title": "Journey of a Design",
        "creator": "MIDILLI\nJanuary 1, 2025",
        "date": "January 1, 2025",
        "content": "Hello everyone,\nAs the new year approaches, I wanted to share another update, this time about the behind-the-scenes process I mentioned earlier.\nWhat happens after design?\nLet’s imagine a design: 4 knobs with unique caps, a black-and-white screen, and 4 black push buttons featuring white ring LEDs. Here's how it looks:\nThe image above is what you see. Below is, how their positioning looks like with placeholder drill holes and their center positions:\nThis allows me to quickly check alignment and later compare it with the final result.\nJourney begins\nTo streamline the process, I've developed two custom programs that automate converting your design into formats suitable for the laser engraving machine (SVG) and the CNC machine (G-code). These programs will be made available for free after the campaign ends. \nIf you’ve chosen a wood design, production will be completed using the laser engraving machine. For those who’ve (also) opted for aluminum Dibond printing, CNC will join the production. Below, you can see the conversion of your design into SVG format:\nThen, each side of the board is sent to the machine. A time-lapse can be seen below:\nOnce the cutting and engraving are complete, the wood is varnished, and the components are put in place:\nFinally, the components are soldered, making the controller ready for testing and shipment!\nLet me know if you have questions or feedback!",
        "url": "https://www.kickstarter.com/projects/midilli/midilli-design-your-dream-midi-controller/posts/4283832",
        "likes_count": 1,
        "comments_count": 0,
        "comments": []
      },
      {
        "update_number": "UPDATE #2",
        "title": "Designer Beta and the Website is Live!",
        "creator": "MIDILLI\nDecember 14, 2024",
        "date": "December 14, 2024",
        "content": "Hello everyone,\nIt’s been two weeks, and I have amazing news to share: we reached our goal! 🥳 I sincerely thank you all for your incredible support.\nThe beta version of Designer (= Factory) is now ready for you to try! It includes all the tools you need to fully customize your MIDI controller. Since the user system is not active yet, everything you create will stay on your computer. So feel free to experiment as much as you like!\nGo on and give it a try: https://midilli.info/factory.\nFactory is designed to work on computers only. Unfortunately, phones and tablets are not supported for design purposes.\nIf you encounter any issues or have suggestions, please let me know! Your feedback is invaluable in making the Designer even better.\nThank you once again for being part of this journey! Don’t forget to share your thoughts and creations with me after trying out the beta version.\nDetailed information on the usage will be posted later. Feel free to find out the features. \nSome tips:\nThe first startup might take a while, so please be patient:\nAlmost each action has a shortcut:\nHovering over a button shows the keyboard combination to invoke the action.\nCheck status bar if you are stuck (located at the bottom):\nStatus bar may give you important hints if you are stuck.\nFor easier and offline access, you can also use the Install button next to the address bar to add it to your computer:\nWebsite is also live\nI also published the website. I'd appreciate to get your feedbacks on it as well: https://midilli.info. After Kickstarter campaign is finished, we will also be using https://midilli.tech.\n- Volkan",
        "url": "https://www.kickstarter.com/projects/midilli/midilli-design-your-dream-midi-controller/posts/4272814",
        "likes_count": 0,
        "comments_count": 0,
        "comments": []
      },
      {
        "update_number": "UPDATE #1",
        "title": "Day 2: Project Update: Progress and New Features",
        "creator": "MIDILLI\nDecember 1, 2024",
        "date": "December 1, 2024",
        "content": "The initial idea for this project began in April 2024, and since then, it has grown into something far larger than I ever anticipated. The MIDILLI Designer now contains over 6,000 lines of code, the Configurator has over 2,000, the firmware over 1,000, and the web API is nearing 1,000 lines. Beyond the sheer coding effort, this has involved countless hours of research and non-coding tasks, making it the biggest project I’ve ever taken on. I'll share more details about the technologies behind it in the future. But today, I want to focus on the updates made to the Designer since the trailer.\nText Color Customization for Buttons\nPreviously, I introduced the ability to assign unique names to each button. However, before launching the campaign, The feature for customizing text colors was not ready before the trailer was made. With this update, you can now change the text colors for buttons on controllers that use a custom design image (e.g., alu-dibond options).\nColor picker allows you to find your text color, offering all possible color choices for ultimate customization.\nBatch Customization Enhancements\nA small yet impactful update: you can now make bulk changes to all selected elements within the same category in the Batch Customization section. This includes the ability to apply a single text color across all selected elements.\nIntroducing the Info Window\nA new addition to the Designer is the Info Window. It will display helpful suggestions, warnings about potential issues in your design, or relevant details you might need later while using the Configurator.\nDesigned to be informative without being annoying.\nConfigurator Updates\nOne exciting new feature in the Configurator is the MIDI Listener.\nA teaser is also in the image.\nThis allows you to test your connected controller's settings without leaving the app. The Info Window has also been added to the Configurator, providing suggestions and highlighting important details during configuration.\nGeneric Updates\nIn many programs, error messages or notification dialogs don't allow copying text for troubleshooting. To address this common issue, I’ve made it possible to copy any message from dialogs, notifications, or the Info Window directly to your clipboard! In case you need support or just to keep it somewhere — no more screenshots or typing the whole message to search for an answer! Your time is valuable!\nHardware and Web Updates\nThe CNC machine for cutting, component placement, and engraving is on its way.\nWork on the website's backend is ongoing, and once ready, you’ll be able to try out the MIDILLI Designer directly on the site. While the Terms and Conditions are not finalized yet, rest assured that everything will remain on your browser and your computer until you press the Submit Project button.\nThank you for your continued support and enthusiasm. Stay tuned for more updates!",
        "url": "https://www.kickstarter.com/projects/midilli/midilli-design-your-dream-midi-controller/posts/4264660",
        "likes_count": 1,
        "comments_count": 0,
        "comments": []
      }
    ]
  }
}