{
  "url": "https://www.kickstarter.com/projects/lawrencebrd/nsone",
  "campaign_details": {
    "funding_period_text": "Funding period\nJan 21 2025 - Mar 22 2025 (60 days)",
    "funding_start_date": "2025-01-20T20:45:14-05:00",
    "funding_end_date": "2025-03-21T21:45:14-04:00",
    "funding_duration_days": 60,
    "pledged_amount": "€5,774",
    "funding_goal": "€5,000",
    "backers_count": "65",
    "days_left": 22
  },
  "updates": {
    "count": 8,
    "content": [
      {
        "update_number": "UPDATE #8",
        "title": "Humans, Machines, Mistakes",
        "creator": "Lorentio Brodesco\nMarch 21, 2025",
        "date": "March 21, 2025",
        "content": "You’re about to read a short story that touches on mistakes, love, the butterfly effect, and determination—a combination that blends ingenuity and precision with the most human part of us, in a field where there’s often little room for emotions.\nSome of you may already know about my project, nsOne. I’ve previously stated that it was born out of an accident, a failure, but I never really explained what happened in detail.\nThis happened about a year ago. I wanted to start programming software for my PlayStation 1, but I needed a serial cable, which I didn’t have. So, I decided to design one as a PCB. While taking measurements and checking the pins with a multimeter, I made a complete beginner’s mistake—just a tiny short circuit.\nNow, after all the research and studying I’ve done on the console, it would take me no more than five minutes to figure out which fuse burned out and replace it. But a year ago, that wasn’t the case. Instead, I took it as an opportunity to learn, and little by little, I began studying every single trace on the console, every single connection. By now, I even know the functions of all 800+ pins by heart. Sometimes, I challenge my friend to point at a random pin, and I have to name it and say what it does. Even he was shocked.\nBut a year ago, I wasn’t like this. I don’t have any special skills—I just had dedication.\nI kept this project to myself until December 2024, when I decided to share it with the world, thanks in part to Hackaday Magazine, which published the very first article about it.\nLet’s take a quick step back to March 2024, when I was designing that PCB connector—the exact red one you see in the image. At the time, I was in a relationship with a beautiful girl, kind-hearted and full of love. My first love.\nThat serial connector wasn’t my first PCB design; I had already worked on a few projects before. And in every one of them, I always loved blending “academic precision” with my creative and human side. Whenever I finished designing a PCB, I would take the time to add little Easter eggs, things that represented who I was, leaving space for a small artistic touch. It was my canvas.\nAnd for this connector, I dedicated it to the thing I loved the most—her.\nThe white lip prints you see on it? They’re hers. I scanned them from a love letter she once wrote me. The phrase “TI AMO” (“I love you”) is taken directly from that same letter, in her own handwriting, with all the love she put into it. The only thing I added was “(io di più)”—“I love you more”—a phrase she used to say with pure innocence, and one I would always repeat back to her.\nThis connector was a tribute to her.\nAnd it was while making this very connector that I short-circuited my console—at a time when I didn’t have the skills to diagnose and fix the problem.\nnsOne was born entirely by accident.\nThis project was born from a mistake while designing a serial cable filled with details of love. And now, the fruits of that mistake are helping me forget that love.\nFast forward to January 2025—she’s gone from my life. Everything is falling apart, and I’m going through the worst time of my life, completely alone. I decide to go all in, and on January 21, 2025, I launch the Kickstarter campaign.\nI would have never guessed that a microscopic mistake from a year ago—a simple 3.3V short circuit—would create such a massive butterfly effect. I never imagined that such a beginner’s error would become my lifeline in one of the hardest moments of my life, a year later.\nRunning this campaign for the past two months and working on this project has been my salvation—a hope that, at the very least, helped me distract myself from all the pain and the breakup. If I hadn’t taken the leap to bring this project to life, I honestly don’t know how much lower I would have fallen. This project became a life raft for my heart, a positive distraction while it was still trying to heal.\nAnd it’s still trying to heal.\nSometimes, I wonder—if she had stayed, would I have even tried to create something this big? Or would I have stayed in my comfort zone, never pushing forward? Maybe, at first, I did all of this to prove to her what I was capable of—as wrong as that motivation may have been.\nBut now, I continue for me. Solely for me.\nI wonder if she would be proud of what I’ve accomplished.\nBut I guess that will remain one of the many mysteries of the universe.\n\nOra sono costretto a ricordarti per più tempo di quanto ti abbia conosciuta. Lo so, lo so. Il tuo pupo ha sempre avuto questa vena sentimentale, anche se sembrava scomparsa. Magari in un altra vita Brunilda.\nIl tuo pupo, Lorentio Brodesco - 21 marzo 2025",
        "url": "https://www.kickstarter.com/projects/lawrencebrd/nsone/posts/4342295",
        "likes_count": 6,
        "comments_count": 4,
        "comments": [
          {
            "text": "So relatable! Makes me feel like I've done \"the right thing\" by the universe to support it, not just my obsessive need for stuff nobody _really_ needs. Such a wonderful personal journey you've been on. Thanks for sharing. Life's challenges like this are a way for us, emergent islands of the universe becoming self-aware enough to collect experiences, unique in all the cosmos, just for us. Even when the journey is hard, how we accept that life experience is where the meaning is; where we, the universe get to find our own reasons to continue. So many things needed to align just right to see things from the right perspective. Instead of stopping at the passive acceptance, by which most others would be satisfied, you made the choice to make something positive for the world. Nicely done, Sir!",
            "commenter": "Todd Rossi",
            "timestamp": "March 23, 2025 9:59 PM AWST",
            "datetime": "1742738358",
            "relative_time": "1 day ago"
          },
          {
            "text": "Thank you Lorentio for your hard work in preserving the PSX hardware platform. Gamers in the future will know of the effort you put into making sure we have the circuit boards right and can make new ones for repairs, or even for FPGA emulation. My next challenge to you after this is to do high resolution delidded scans of all the chips in all laters to completely clone them, but on a far newer and more efficient node. This way the platform can be entirely preserved and new chips can be made as well.",
            "commenter": "alp1",
            "timestamp": "March 22, 2025 10:38 AM AWST",
            "datetime": "1742611105",
            "relative_time": "2 days ago"
          },
          {
            "text": "Hi going by your message I'm guessing you are on the younger side of things. I'm sure you will meet someone again and I have felt your pain many times. honestly I wasn't sure I would ever meet someone to share my life with. Then 5 years ago I met my best friend partner in crime and I couldn't be happier. I'm now 44 we have two kids one is 11 weeks and we are building a new house 😎. what I'm trying to say is it will take a few relationships to actually meet the right lady and this helps to work out exactly what your looking for 😉 PS I'm so looking forward to this project of your coming to fruition thanks Andrew Noble",
            "commenter": "Andrew Noble",
            "timestamp": "March 22, 2025 1:11 AM AWST",
            "datetime": "1742577115",
            "relative_time": "3 days ago"
          },
          {
            "text": "Ngl in the first half of the update thought your SO passed away, im glad that she only left you and didnt pass but am sorry to hear that you both seperated but i hope that this message finds you in good faith and that you'll move on from her but still be happy with the memorys that were made with her in a healthy manner.",
            "commenter": "Fatboi",
            "timestamp": "March 21, 2025 6:07 PM AWST",
            "datetime": "1742551666",
            "relative_time": "3 days ago"
          }
        ]
      },
      {
        "update_number": "UPDATE #7",
        "title": "Internal view - The modchip socket",
        "creator": "Lorentio Brodesco\nMarch 13, 2025",
        "date": "March 13, 2025",
        "content": "Example of a socket for an 8-pin modchip, already routed and removable without the need for soldering. Furthermore, the board format is officially named PU-23E (PU-23 is the form factor of the SCPH-9000 series, but this is the 'E' version, meaning 'extended', because although it retains the form factor of the 9000 series, it is still equipped with a parallel port).",
        "url": "https://www.kickstarter.com/projects/lawrencebrd/nsone/posts/4335902",
        "likes_count": 6,
        "comments_count": 1,
        "comments": [
          {
            "text": "Awesome!",
            "commenter": "Station Ventures, LLC",
            "timestamp": "March 13, 2025 7:54 AM AWST",
            "datetime": "1741823644",
            "relative_time": "12 days ago"
          }
        ]
      },
      {
        "update_number": "UPDATE #6",
        "title": "The first prototype board is close to becoming a reality",
        "creator": "Lorentio Brodesco\nMarch 13, 2025",
        "date": "March 13, 2025",
        "content": "",
        "url": "https://www.kickstarter.com/projects/lawrencebrd/nsone/posts/4335609",
        "likes_count": 5,
        "comments_count": 0,
        "comments": []
      },
      {
        "update_number": "UPDATE #5",
        "title": "nsOne with all I/O connectors (even Expansion Port) in PU-23 form-factor",
        "creator": "Lorentio Brodesco\nMarch 11, 2025",
        "date": "March 11, 2025",
        "content": "",
        "url": "https://www.kickstarter.com/projects/lawrencebrd/nsone/posts/4334017",
        "likes_count": 4,
        "comments_count": 0,
        "comments": []
      },
      {
        "update_number": "UPDATE #4",
        "title": "First look at the final form factor PU-23 of nsOne",
        "creator": "Lorentio Brodesco\nMarch 5, 2025",
        "date": "March 5, 2025",
        "content": "NOTE: The board is in the development phase; some chips, as well as passive components and routing, are not present in this render. However, the form factor is final. The chip layout may change, especially due to the addition of the footprint in the top right corner for a possible expansion port installation.\nSpecial thanks to Christian for providing me with the font for the \"nsOne\" lettering on the board.",
        "url": "https://www.kickstarter.com/projects/lawrencebrd/nsone/posts/4329217",
        "likes_count": 3,
        "comments_count": 1,
        "comments": [
          {
            "text": "Looking good",
            "commenter": "Station Ventures, LLC",
            "timestamp": "March 5, 2025 6:33 AM AWST",
            "datetime": "1741127605",
            "relative_time": "20 days ago"
          }
        ]
      },
      {
        "update_number": "UPDATE #3",
        "title": "nsOne x PCBWay",
        "creator": "Lorentio Brodesco\nMarch 3, 2025",
        "date": "March 3, 2025",
        "content": "",
        "url": "https://www.kickstarter.com/projects/lawrencebrd/nsone/posts/4327056",
        "likes_count": 3,
        "comments_count": 0,
        "comments": []
      },
      {
        "update_number": "UPDATE #2",
        "title": "First Draft of the PCB Mockup",
        "creator": "Lorentio Brodesco\nFebruary 26, 2025",
        "date": "February 26, 2025",
        "content": "A small update for everyone on the work:\nThese days, I am redoing the entire schematic of the console circuit (excluding power circuits for now).\nI am recreating the schematic as accurately as possible, adding all passive components such as decoupling capacitors and resistors. Unlike the first schematic, I am not using resistor arrays for convenience (at least for now) but rather individual SMD resistors with a 0201 footprint.\nFor this board, I have not yet included chips like the Mechacon or other \"non-essential\" components, as this is just a debug unit to ensure proper functionality. It does not include audio either, but those are truly irrelevant modifications for boot testing.\nAdditionally, I am working on a design with fewer connection crossovers and optimizing routing lengths to make them as equal as possible, avoiding potential issues.\nI will release further updates in the coming days with a more complete board.\nI am also considering adding an onboard RP2040 to test the Pico-based ODE that was recommended to me for loading games directly from a microSD.\nAdditionally, I am carefully selecting all components to ensure that, besides manufacturing, all boards are also compatible with the pre-assembly of all components.",
        "url": "https://www.kickstarter.com/projects/lawrencebrd/nsone/posts/4297876",
        "likes_count": 5,
        "comments_count": 1,
        "comments": [
          {
            "text": "Awesome update! Great to see the Pico-based ODE being considered.",
            "commenter": "Station Ventures, LLC",
            "timestamp": "February 26, 2025 8:57 PM AWST",
            "datetime": "1740574648",
            "relative_time": "26 days ago"
          }
        ]
      },
      {
        "update_number": "UPDATE #1",
        "title": "Free Upgrade to the Pre-Soldered Version for Everyone",
        "creator": "Lorentio Brodesco\nJanuary 23, 2025",
        "date": "January 23, 2025",
        "content": "Hello, thank you for considering the project. Based on feedback and opinions from other users, I have decided to replace the basic version (the PCB without any components) with the version that includes all passive components pre-soldered, but without the original PlayStation ICs, while maintaining the same price of €35. Additionally, everyone who previously purchased the version without components will receive the pre-soldered version, thanks to factory pre-assembly.",
        "url": "https://www.kickstarter.com/projects/lawrencebrd/nsone/posts/4297874",
        "likes_count": 3,
        "comments_count": 0,
        "comments": []
      }
    ]
  }
}