{
  "url": "https://www.kickstarter.com/projects/rajat-sharma/pico-io-expansion-hat-for-raspberry-pi",
  "campaign_details": {
    "funding_period_text": "Funding period\nDec 27 2024 - Jan 26 2025 (30 days)",
    "funding_start_date": "2024-12-27T10:00:14-05:00",
    "funding_end_date": "2025-01-26T10:00:14-05:00",
    "funding_duration_days": 30,
    "pledged_amount": "",
    "funding_goal": "AU$ 1,000",
    "backers_count": "75"
  },
  "updates": {
    "count": 3,
    "content": [
      {
        "update_number": "UPDATE #3",
        "title": "Backer Surveys – Late Pledge Now Open for PicoBridge IO HAT!",
        "creator": "Rajat Sharma\nJanuary 31, 2025",
        "date": "January 31, 2025",
        "content": "Hello Backers,\nWe have some great news! Our Kickstarter campaign for PicoBridge IO HAT for Raspberry Pi has successfully ended, and we are incredibly grateful for your support. If you missed the campaign or want to grab an additional unit, you can now late pledge and secure your PicoBridge IO HAT!\nLate Pledge Now\nBacker Surveys – Submit Your Address Now!\nTo ensure a smooth and timely delivery of your rewards, we have sent out the backer survey. Please take a moment to fill it out and submit your shipping address as soon as possible. This will help us finalize logistics and get your PicoBridge IO HAT delivered without delays.\nWhat’s Next?\n📦 Survey Submission: Kindly complete your survey at the earliest.\n🛠 Production & Fulfillment: We are already working on the production process and will keep you updated on shipping timelines.\n🔥 Late Pledge Access: Spread the word to anyone who missed the campaign and still wants to get their hands on the PicoBridge IO HAT!\nWe appreciate your support and enthusiasm. Stay tuned for further updates!\nBest Regards,\nRajat Sharma",
        "url": "https://www.kickstarter.com/projects/rajat-sharma/pico-io-expansion-hat-for-raspberry-pi/posts/4303453",
        "likes_count": 1,
        "comments_count": 2,
        "comments": [
          {
            "text": "Not sure if I received the survey",
            "commenter": "John Jeffries",
            "timestamp": "February 12, 2025 8:26 AM AWST",
            "datetime": "1739319970",
            "relative_time": "30 days ago"
          },
          {
            "text": "Hello John, We have already received your response via backer survey. Thanks",
            "commenter": "Rajat Sharma",
            "timestamp": "March 7, 2025 6:36 PM AWST",
            "datetime": "1741343764",
            "relative_time": "6 days ago"
          }
        ]
      },
      {
        "update_number": "UPDATE #2",
        "title": "Thank You for Your Support! The PicoBridge IO HAT is Fully Funded and Available for Late Pledge!",
        "creator": "Rajat Sharma\nJanuary 26, 2025",
        "date": "January 26, 2025",
        "content": "Dear Backers,\nWe are thrilled to announce that thanks to your incredible support, our Kickstarter campaign for the PicoBridge IO HAT for Raspberry Pi has been successfully funded! 🎉 Your belief in our project has helped bring this idea to life, and we couldn't be more excited to deliver this innovative expansion board to you!\nFor those who missed out during the campaign, don't worry – the PicoBridge IO HAT is still available through Late Pledge! If you'd like to secure your own board, you can still back the project via the link below:\n🔗 PicoBridge IO HAT for Raspberry Pi - Late Pledge\nThe PicoBridge IO HAT is designed to expand your GPIO capabilities and enhance the versatility of your Raspberry Pi. With onboard support for the Raspberry Pi Pico, you can stack additional HATs, use your Pico for standalone projects, and enjoy seamless hardware integration, all while keeping your Raspberry Pi’s performance intact. Plus, with extra breakout pins and a dedicated interface for Pico HATs, you’ll have all the flexibility you need for your next project.\nWe can’t wait for you to experience everything the PicoBridge IO HAT has to offer. Your support has made this journey possible, and we’re excited to continue working hard to bring this product to life for you.\nThank you again for your trust, feedback, and support! You’re the reason we’ve been able to make this dream a reality.\nStay tuned for more updates, and don’t hesitate to reach out if you have any questions.\nWarm regards,\nThe PicoBridge Team",
        "url": "https://www.kickstarter.com/projects/rajat-sharma/pico-io-expansion-hat-for-raspberry-pi/posts/4300028",
        "likes_count": 0,
        "comments_count": 2,
        "comments": [
          {
            "text": "I find the shipping costs to be very expensive in comparison to the price of the board.",
            "commenter": "Henry Umiker",
            "timestamp": "January 31, 2025 11:25 PM AWST",
            "datetime": "1738337158",
            "relative_time": "about 1 month ago"
          },
          {
            "text": "Hi Henry, We understand your concern about the shipping cost. The fee includes tracking, secure packaging, and reliable international delivery to ensure your rewards reach you safely. We are constantly exploring ways to optimize shipping costs and will update if we can offer a more affordable option in the future. Thank you for your support!",
            "commenter": "Rajat Sharma",
            "timestamp": "February 6, 2025 6:15 PM AWST",
            "datetime": "1738836904",
            "relative_time": "about 1 month ago"
          }
        ]
      },
      {
        "update_number": "UPDATE #1",
        "title": "🎉 Thank You for an Incredible Start + Happy New Year Wishes!",
        "creator": "Rajat Sharma\nDecember 31, 2024",
        "date": "December 31, 2024",
        "content": "Dear Backers,\nWe’re thrilled to share that within just a few hours of launching PicoBridge IO HAT for Raspberry Pi, our project achieved its funding goal! This incredible milestone wouldn’t have been possible without your support and belief in our vision.\nNow, with 26 days remaining, we have the opportunity to make this campaign even bigger and reach more Raspberry Pi enthusiasts worldwide. We kindly request you to help us spread the word by sharing the campaign link with your friends, communities, and social networks. Every share makes a huge difference!\n👉 Campaign Link: PicoBridge IO HAT for Raspberry Pi\nAs today is New Year’s Eve, we would also like to take this opportunity to wish you and your loved ones a very Happy New Year! May this year bring joy, success, and exciting new projects for everyone.\nThank you again for being a part of this journey. We can’t wait to share more updates and stretch goals with you as the campaign progresses.\nWarm regards,\nRajat Sharma",
        "url": "https://www.kickstarter.com/projects/rajat-sharma/pico-io-expansion-hat-for-raspberry-pi/posts/4283700",
        "likes_count": 1,
        "comments_count": 0,
        "comments": []
      }
    ]
  }
}