{
  "url": "https://www.kickstarter.com/projects/721145178/pikkles",
  "campaign_details": {
    "funding_period_text": "Funding period\nFeb 12 2025 - Apr 12 2025 (59 days)",
    "funding_start_date": "2025-02-12T00:00:00.000000Z",
    "funding_end_date": "2025-04-12T20:04:35.797950Z",
    "funding_duration_days": 59,
    "pledged_amount": "S$ 7",
    "funding_goal": "S$ 147,584",
    "backers_count": "1",
    "days_left": 19,
    "project_launch_text": "Project launches FEBRUARY 12, 2025"
  },
  "updates": {
    "count": 1,
    "content": [
      {
        "update_number": "UPDATE #1",
        "title": "Let'go",
        "creator": "manca\nFebruary 16, 2025",
        "date": "February 16, 2025",
        "content": "Français :\nChers contributeurs,\nJe tiens à vous remercier chaleureusement pour votre soutien et votre engagement dans le projet PIKKLES. Votre contribution est essentielle à son développement et à son succès !\nPour information, j’ai un rendez-vous prévu avec la BPI (Banque Publique d’Investissement) ainsi qu’une agence de publicité afin d’explorer les opportunités de financement et de structuration de la stratégie marketing. La BPI France est un organisme qui soutient les entreprises innovantes en leur fournissant des financements et des conseils stratégiques.\nJe vous tiendrai informés des avancées et des prochaines étapes. Encore merci pour votre confiance !\nEnglish:\nDear contributors,\nI would like to sincerely thank you for your support and commitment to the PIKKLES project. Your contributions are essential to its development and success!\nFor your information, I have a scheduled meeting with BPI (Banque Publique d’Investissement) and an advertising agency to explore funding opportunities and refine our marketing strategy. BPI France is an organization that supports innovative businesses by providing financing and strategic guidance.\nI will keep you updated on our progress and next steps. Thank you again for your trust and support!",
        "url": "https://www.kickstarter.com/projects/721145178/pikkles/posts/4315296",
        "likes_count": 0,
        "comments_count": 0,
        "comments": []
      }
    ]
  }
}