{
  "url": "https://www.kickstarter.com/projects/platyball/platypod-delta-tripod",
  "campaign_details": {
    "funding_period_text": "Funding period\nJan 9 2025 - Feb 16 2025 (38 days)",
    "funding_start_date": "2025-01-08T13:27:49-05:00",
    "funding_end_date": "2025-02-15T13:27:49-05:00",
    "funding_duration_days": 38,
    "pledged_amount": "$191,691",
    "funding_goal": "$10,000",
    "backers_count": "2,041"
  },
  "updates": {
    "count": 6,
    "content": [
      {
        "update_number": "UPDATE #6",
        "title": "Surveys have been sent!",
        "creator": "Larry Tiefenbrunn\nMarch 3, 2025",
        "date": "March 3, 2025",
        "content": "Hi again everyone. I know it's a lot of updates this week but it is certainly crunch time and there's lots to get done. Most of you already know that around 8 o'clock ET this morning, BackerKit sent out 1924 surveys to all the remaining backers who were not already contacted in the \"smoke test\" (see Friday's update). Resoundingly, in the last eight hours, over 1100 people have already responded to their surveys. That's amazing. What wonderful backers live in the Platypod community!\nIf, for any reason you did not get your survey, the first thing to do is check your email spam folder. If you signed in with Apple ID or Apple Pay then you must check your Apple mail because that is likely where the survey ended up. If you still can't find it, please write to us at service@platypod.com and we will get back to you over the next few days. Please bear with us. I also plan on doing another mailing tomorrow to anyone who has not responded and again later on this week. Larry Becker (head of customer support) is going to be busy as master of ceremonies for Scott Kelby's iPhone conference this week and I will be heading to England for The Photography Show (Booth/Stand D200 -please visit us). We will still attend to your requests but please be flexible with giving us a day or two to get to all messages.\nFor those of you who have returned your surveys and made your purchases in the \"add-on store\" please be aware that I will likely lock the orders and apply any additional charges for those with add-ons sometime tomorrow (Monday March 3). Once that is done we will prepare to ship to those of you who are in the \"early delivery\" categories. The remainder of backers will ship on or after April 1. I think we are pretty well prepared to handle all of the March deliveries with add-ons at this point but in case we run low on supplies we are expecting more shipments later in March. My intent is to keep our projection of on-time deliveries meaning all \"early delivery\" categories in March and the remainder in April.\nThank you again for all your support.\nBest wishes, Larry T.",
        "url": "https://www.kickstarter.com/projects/platyball/platypod-delta-tripod/posts/4327165",
        "likes_count": 25,
        "comments_count": 16,
        "comments": [
          {
            "text": "9405536208303274872341 Tracking number. Last entry March 5th. Is it being held?? Expected a reasonable shipment time line???",
            "commenter": "Kernwj@comcast.net",
            "timestamp": "March 11, 2025 12:49 PM AWST",
            "datetime": "1741668565",
            "relative_time": "2 days ago"
          },
          {
            "text": "For a quicker response to customer service issues it is best to email service@platypod.com The good news is that there is an update with an estimated delivery time, which the post office has entered a few hours after you posted your comment here.",
            "commenter": "Lawrence Becker",
            "timestamp": "March 11, 2025 6:37 PM AWST",
            "datetime": "1741689446",
            "relative_time": "2 days ago"
          },
          {
            "text": "I haven’t received my backerkit email. I have emailed support twice and checked my backer lever which is early bird. I am an Appleid user and have check both my junk and email inbox.",
            "commenter": "Ramon Marion",
            "timestamp": "March 8, 2025 6:40 AM AWST",
            "datetime": "1741387244",
            "relative_time": "6 days ago"
          },
          {
            "text": "Hi Ramon. I'm not sure what support email address you sent your queries to, but you need to send it to service@platypod.com. So far there's no email from you at that email address. Once you send it there, we can reply with a direct link to your personal survey. We have done this successfully for dozens and dozens of Apple ID customers already. I look forward to getting your email and sending your survey link as quickly as possible.",
            "commenter": "Lawrence Becker",
            "timestamp": "March 8, 2025 7:26 AM AWST",
            "datetime": "1741389982",
            "relative_time": "6 days ago"
          },
          {
            "text": "That’s the email address I used and it’s from RRMarion",
            "commenter": "Ramon Marion",
            "timestamp": "March 9, 2025 5:21 AM AWST",
            "datetime": "1741468878",
            "relative_time": "5 days ago"
          },
          {
            "text": "I don’t know how to fix this Appleid issue as it is using a hide my email feature. This hasn’t been an issue for other projects and I have received all of your updates. It is listed as: kcjmzq5hxn",
            "commenter": "Ramon Marion",
            "timestamp": "March 9, 2025 5:30 AM AWST",
            "datetime": "1741469432",
            "relative_time": "5 days ago"
          },
          {
            "text": "To Erik and anyone else who has not received their surveys, please contact us at service@platypod.com and we can manually forward your unique survey link. Best wishes, Larry T.",
            "commenter": "Larry Tiefenbrunn",
            "timestamp": "March 4, 2025 2:26 AM AWST",
            "datetime": "1741026406",
            "relative_time": "10 days ago"
          },
          {
            "text": "I have not received my survey either, could you please re-send it?",
            "commenter": "Eric Seale",
            "timestamp": "March 4, 2025 2:20 AM AWST",
            "datetime": "1741026006",
            "relative_time": "10 days ago"
          },
          {
            "text": "I have not received my survey.",
            "commenter": "Michael Goldner",
            "timestamp": "March 3, 2025 11:06 AM AWST",
            "datetime": "1740971193",
            "relative_time": "10 days ago"
          },
          {
            "text": "Still haven't received my backerkit survey Byron",
            "commenter": "Byron Huebschen",
            "timestamp": "March 3, 2025 9:23 AM AWST",
            "datetime": "1740965038",
            "relative_time": "10 days ago"
          },
          {
            "text": "Hi Byron, I just manually re-sent it to your Yahoo address. Check your spam folder. Obviously, I cannot post it here but if you would like to privately message us via KS or write to service@platypod.com we can resend it to that email address or any address you would like. Best wishes, Larry T.",
            "commenter": "Larry Tiefenbrunn",
            "timestamp": "March 3, 2025 10:09 AM AWST",
            "datetime": "1740967754",
            "relative_time": "10 days ago"
          },
          {
            "text": "Checked, but nothing. bchuebschen@ yahoo.com",
            "commenter": "Byron Huebschen",
            "timestamp": "March 3, 2025 10:35 AM AWST",
            "datetime": "1740969347",
            "relative_time": "10 days ago"
          },
          {
            "text": "Your customer service is fantastic! Thanks for all the updates.",
            "commenter": "Nell Cant",
            "timestamp": "March 3, 2025 6:16 AM AWST",
            "datetime": "1740953798",
            "relative_time": "11 days ago"
          },
          {
            "text": "Linda, I happen to check and you are in the regular delivery group so no worries here. However, for everyone else to avoid me getting flooded with emails here are your instructions: To check your pledge level click on your image or initials in the upper right corner of Kickstarter and then click on your backed project. In this case the Platypod Delta. The next page will \"you backed to this project and there you can view your pledge\". Best wishes, Larry T.",
            "commenter": "Larry Tiefenbrunn",
            "timestamp": "March 3, 2025 6:15 AM AWST",
            "datetime": "1740953751",
            "relative_time": "11 days ago"
          },
          {
            "text": "How do we know if we are in the \"early backer\" group? I hope I am, because I'll be out of the country Mar 3-19, and don’t want my package waiting on my porch. :>)",
            "commenter": "Linda Krugman",
            "timestamp": "March 3, 2025 6:11 AM AWST",
            "datetime": "1740953508",
            "relative_time": "11 days ago"
          },
          {
            "text": "I definitely did not receive my survey and it wasn't in my spam or junk folders either. Please help.",
            "commenter": "David Head",
            "timestamp": "March 3, 2025 5:38 AM AWST",
            "datetime": "1740951516",
            "relative_time": "11 days ago"
          }
        ]
      },
      {
        "update_number": "UPDATE #5",
        "title": "Smoke test sent.",
        "creator": "Larry Tiefenbrunn\nMarch 1, 2025",
        "date": "March 1, 2025",
        "content": "Just a brief update to let everyone know what's happening.\nI just got the clearance from BackerKit to send out what is known as the \"smoke test\". Larry Becker and I have set up the surveys and the add-on store but to make sure there are no errors or glitches, BackerKit insists that we run this test which is randomly sent out to 5% of the backers at each pledge level. I hope that we will have some responses over the next 48 hours and if we do see responses at each level we can go ahead and send out the remainder of the surveys.\nPLEASE do not write to us over this weekend as there is no one available to respond. If you do not receive your survey by Tuesday or Wednesday next week, please check back here first for another update or write to us at service@platypod.com at that point. Larry Becker will be hosting Scott Kelby's iPhone conference until end of day Wednesday but he will likely get back to you on Thursday. Please bear with us.\nIf all goes well I hope to have the remainder of the surveys go out either Sunday night or Monday morning. If there's a problem I will put up another update here to let everyone know. Since no shipments will go out until at least Tuesday or Wednesday next week it really doesn't matter whether you are in the smoke test group or the larger survey group. Those of you who know me, know that I will make my very best effort to get everything out as soon as humanly possible. Trying to please over 2000 people at once is rather stressful but I will do my best.\nIf we get a nice return from the \"early delivery\" backers on all the surveys and everything goes smoothly then we will try to release the first \"early delivery\" shipments after the first 24 hours so please return your surveys immediately. (All \"regular delivery\" pledges are still due to be filled during the month of April.) If you need to research and decide which add-on items you are interested in, now is the time to go to \"SHOP\" on our website www.platypod.com and read the descriptions or watch our videos. Again, the only major Platypod product which will not be in the add-on store is the Platyball Elite which is sold exclusively through B&H Photo in New York. Quantities may be limited on certain items so I encourage you to make your choices of add-ons as early as possible. Sorry, but our \"Instant Loyalty Rebates\" program will not apply to the BackerKit add-on store. As we mentioned in the last update, you will be able to add-on as many items as you like, without any increase in shipping fees...nice perk.\nBest wishes to all and thank you again for your support and encouragement.\nSincerely, Larry Tiefenbrunn",
        "url": "https://www.kickstarter.com/projects/platyball/platypod-delta-tripod/posts/4325812",
        "likes_count": 62,
        "comments_count": 14,
        "comments": [
          {
            "text": "Thank you all for your kind comments. The smoke test is going very well and over 80% have already answered their surveys. I do plan to send out the survey to everyone else sometime tomorrow. If we get a nice number of responses then we can start shipping on Monday or Tuesday. I have sent advance notice to my fulfillment center to be on the lookout. For those of you who have ordered sets of straps, there might be a delay of just a few days as these are due into the warehouse on or around March 10. You will be getting them before anyone else because we have not even posted these on our website yet. Best wishes, Larry T.",
            "commenter": "Larry Tiefenbrunn",
            "timestamp": "March 2, 2025 10:02 AM AWST",
            "datetime": "1740880947",
            "relative_time": "11 days ago"
          },
          {
            "text": "Thank you.",
            "commenter": "Scott Hinton",
            "timestamp": "March 2, 2025 4:09 AM AWST",
            "datetime": "1740859797",
            "relative_time": "12 days ago"
          },
          {
            "text": "Thank you for the update.",
            "commenter": "Gary Conway",
            "timestamp": "March 1, 2025 10:53 PM AWST",
            "datetime": "1740840807",
            "relative_time": "12 days ago"
          },
          {
            "text": "Can’t wait for my Delta!",
            "commenter": "Ken Walker",
            "timestamp": "March 1, 2025 12:01 PM AWST",
            "datetime": "1740801674",
            "relative_time": "12 days ago"
          },
          {
            "text": "Thanks for the update!",
            "commenter": "Crystal Pruett",
            "timestamp": "March 1, 2025 8:40 AM AWST",
            "datetime": "1740789607",
            "relative_time": "13 days ago"
          },
          {
            "text": "Thanks for the update. waiting for the next message.",
            "commenter": "Stanley Turk",
            "timestamp": "March 1, 2025 6:31 AM AWST",
            "datetime": "1740781874",
            "relative_time": "13 days ago"
          },
          {
            "text": "Got the email...",
            "commenter": "Kevin Klein",
            "timestamp": "March 1, 2025 6:15 AM AWST",
            "datetime": "1740780927",
            "relative_time": "13 days ago"
          },
          {
            "text": "Got it, am I supposed to respond to the smoke test ? I wasn't sure.",
            "commenter": "Betsy Memishian",
            "timestamp": "March 1, 2025 6:08 AM AWST",
            "datetime": "1740780510",
            "relative_time": "13 days ago"
          },
          {
            "text": "Given that they wrote “ I hope that we will have some responses over the next 48 hours and if we do see responses at each level we can go ahead and send out the remainder of the surveys.”, it appears that if you got the smoke test message, they need you to respond to it so they see things are working.",
            "commenter": "Mitch Keller",
            "timestamp": "March 2, 2025 5:48 AM AWST",
            "datetime": "1740865723",
            "relative_time": "12 days ago"
          },
          {
            "text": "Looking forward to playing this stuff.",
            "commenter": "Janell Barger",
            "timestamp": "March 1, 2025 6:04 AM AWST",
            "datetime": "1740780246",
            "relative_time": "13 days ago"
          },
          {
            "text": "Can't wait! This will be my first Platypod.",
            "commenter": "Mary Gavan",
            "timestamp": "March 1, 2025 5:50 AM AWST",
            "datetime": "1740779459",
            "relative_time": "13 days ago"
          },
          {
            "text": "Looking like another successful smoke test for another successful campaign!",
            "commenter": "Frenetic Fox Photography",
            "timestamp": "March 1, 2025 5:43 AM AWST",
            "datetime": "1740779021",
            "relative_time": "13 days ago"
          },
          {
            "text": "Cant wait. Thanks for continuing to create such useful well thought out products.",
            "commenter": "Bob Kinkle",
            "timestamp": "March 1, 2025 5:39 AM AWST",
            "datetime": "1740778758",
            "relative_time": "13 days ago"
          },
          {
            "text": "Looking forward to getting my Patypod Delta!",
            "commenter": "Jerry Phenney",
            "timestamp": "March 1, 2025 5:17 AM AWST",
            "datetime": "1740777476",
            "relative_time": "13 days ago"
          }
        ]
      },
      {
        "update_number": "UPDATE #4",
        "title": "A MUST READ: What’s next??? Apple ID backers beware!!! Thanks***",
        "creator": "Larry Tiefenbrunn\nFebruary 18, 2025",
        "date": "February 18, 2025",
        "content": "Well, it's been a few days since the Delta Kickstarter campaign has ended and I'm still trying to catch my breath from all the excitement.\nI went into this project hoping for 1500 or 1600 backers and I can't believe that over 2000 people had the faith and confidence in us to come out with another great new product, the Platypod Delta.\nThere's still a lot to do. First of all, I'd like to again confirm that we've received in the New Jersey fulfillment center, over 1200 Delta retail packages ready to fulfill “early delivery” backer pledges. We do have to send a few hundred over to Belgium for those backers outside of The Americas. Here's where we will need everyone's help.\nBefore I explain the survey process, I would like to address an issue that has been a challenge in the past and that is for all of you who have either signed into Kickstarter using your Apple ID or paid with Apple Pay. Over the next few weeks it is imperative that you check your Apple email at least once a week or you will miss the surveys that we are going to be sending out, which are necessary to fulfill your pledges. A lot of people don't know this and we had issues with this in our past campaigns, so please pay attention to this. For everyone else, all we ask is that you please monitor the same email inbox that you signed into Kickstarter with and you should not have any problem.\nNow let's talk about the surveys. For this campaign, as we have done in the past, we will be utilizing the services of BackerKit to help us send out, collate and process the information necessary for us to efficiently send your products out to you. The surveys help us gather simple yet critical information, such as confirmation of your proper names, addresses, phone numbers. It will not be one of those irritating kinds of surveys that ask you a ton of irrelevant questions only to waste your time.\nAlong with the surveys you will have a one time opportunity to shop for Platypod products in our “Add-on Store.” Here we will be offering many of our Platypod and Platyball products at our very lowest prices in appreciation of your support for this campaign. As a special bonus, there will be no additional shipping charges for extra items ordered. Whatever you paid for shipping in Kickstarter is your only shipping fee. All items will ship out together and if you ordered for early delivery we will do our very best to have your entire shipment go out during the month of March. Your only additional charges may be local tax and VAT which is up to the government where you live.\n\nTo enable you to choose what you want to buy efficiently, I would encourage everyone to head over to www.platypod.com and look out our “SHOP” page and write up a shopping list of the items you are interested in. Our apologies, but there is one item that we will not be able to offer and that is the Platyball Elite which is now sold exclusively at B&H Photo in New York and via their website. On the other hand, Platyball Ergo and just about all of our other products will be available at deep discounts.\n\nAgain, this is a one time only opportunity so please be prepared.\n\nWe will try our best to have the surveys ready to go out over the next two weeks but we do have to wait for the final signal from Kickstarter that all credit cards have been charged and reconciled. Invariably there are a few people whose credit cards have expired or have been denied by their banks and Kickstarter has to go back and follow up with those backers. That process ends around 14 days after the end of the campaign which is approximately March 1.\n\nIt is especially important that our “early delivery” backers return their surveys within two or three days after you receive them. We hope to start shipping about a week after the surveys go out and then again once weekly thereafter. Orders shipping out of Belgium may take a week or two longer if we have to send extra stock over to Belgium. Please bear with us and we are working to have everyone fulfilled on time.\nAbove and beyond everything, Larry Becker and I, as well as the entire Platypod team, wish to express our greatest thanks to God and to all our wonderful backers who have helped to support this project. A special shout out to Scott Kelby who truly inspired the idea of the Delta.\nBest wishes,\nLarry Tiefenbrunn “Dr. T”",
        "url": "https://www.kickstarter.com/projects/platyball/platypod-delta-tripod/posts/4317027",
        "likes_count": 25,
        "comments_count": 8,
        "comments": [
          {
            "text": "Still waiting on backerkit",
            "commenter": "Byron Huebschen",
            "timestamp": "February 26, 2025 3:32 AM AWST",
            "datetime": "1740511947",
            "relative_time": "16 days ago"
          },
          {
            "text": "",
            "commenter": "Byron Huebschen",
            "timestamp": "February 26, 2025 4:41 AM AWST",
            "datetime": "1740516092",
            "relative_time": "16 days ago"
          },
          {
            "text": "Which means deliveries will be later than predicted",
            "commenter": "Byron Huebschen",
            "timestamp": "February 26, 2025 4:43 AM AWST",
            "datetime": "1740516217",
            "relative_time": "16 days ago"
          },
          {
            "text": "I started on the first day and was charged rapidly",
            "commenter": "Andre Breiler",
            "timestamp": "February 26, 2025 5:26 AM AWST",
            "datetime": "1740518772",
            "relative_time": "16 days ago"
          },
          {
            "text": "@Byron the flow is usually: - when you make a pledge, it is marked but not charged by kickstarter yet. In most cases it isn't even showing as pending/reserved on my cards at best I see that there was a check if my card limit allows for such a transaction. - when the campaign ends kickstarter starts to make charges to cards. If a transaction fails it notifies the backer and does a couple of retries over the following days. It allows for up to two weeks before marking the transaction as failed which kicks you out as backer (the creator can choose to import such backers into a pledge management system like backerkit still to give the backer another chance to pay) - once kickstarter has collected *all* the funds possible it confirms what the creator will get in how many tranches. The creator may treat the money as available at this point but there is a risk still that he won't get (all of) it. - kickstarter then transfers the collected money to the creator which can take a few days again before the creator has got the money. At this point only it is pretty safe for the creator to assume what exact funds are available and start to operate. So in summary, this is all normal and has nothing to do with the creator. It is all in the hands of kickstarter so far.",
            "commenter": "jose vargas",
            "timestamp": "February 24, 2025 1:20 AM AWST",
            "datetime": "1740331259",
            "relative_time": "18 days ago"
          },
          {
            "text": "i am confused - i see this being sold on FACEBOOK but I have yet to received my survey or the product.",
            "commenter": "Lawrence Becker",
            "timestamp": "February 24, 2025 3:32 AM AWST",
            "datetime": "1740339167",
            "relative_time": "18 days ago"
          },
          {
            "text": "Jose, the Delta Kickstarter campaign is now officially over and all backers will soon receive their survey to complete the process to make the orders and shipping happen. (Please see update #4 for more specific timeframe details). The Delta is not being directly sold on Facebook. You may see ads for various Platypod products on Facebook, like the Delta, and those ads direct people to our site. Any Delta \"preorders\" placed on our site will not be fulfilled until all Kickstarter backers have received their items. That information is also spelled out in detail on our site. Thanks for the question.",
            "commenter": "Frenetic Fox Photography",
            "timestamp": "February 19, 2025 2:14 AM AWST",
            "datetime": "1739902498",
            "relative_time": "23 days ago"
          },
          {
            "text": "Another successful project, I’m glad this one has gone so smoothly for the Platypod team. Really stoked for the delta!",
            "commenter": "Linda Krugman",
            "timestamp": "February 19, 2025 1:58 AM AWST",
            "datetime": "1739901483",
            "relative_time": "23 days ago"
          }
        ]
      },
      {
        "update_number": "UPDATE #3",
        "title": "Early is the new on time!",
        "creator": "Larry Tiefenbrunn\nFebruary 12, 2025",
        "date": "February 12, 2025",
        "content": "Hey everybody, last week I wrote that I would let you know when Delta landed on the California Shores (which I thought would occur in 5 to 7 days). Much to my surprise it actually landed today right in our fulfillment center in New Jersey! Over 1200 units together with a large shipment of Traveler ball heads. I can now confidently say that we will be ready to ship out to all early backers on time and perhaps even a few days early. That will depend upon everyone receiving and sending in their surveys promptly.\n\nWow, we still have a few days left to the Kickstarter campaign and we already have over 1850 backers and climbing. This has blown away all of my predictions and I am just so thankful to our backers and excited to deliver the Delta to our friends.\n\nThat's it. I refer you back to the last update for more details and please, again let your friends know about the campaign and I hope to update you again on the other side.\nBTW check out Kersten Luts' new video on the Platypod channel and please subscribe!\nBest wishes,\nLarry Tiefenbrunn",
        "url": "https://www.kickstarter.com/projects/platyball/platypod-delta-tripod/posts/4312269",
        "likes_count": 30,
        "comments_count": 10,
        "comments": [
          {
            "text": "I still haven’t received survey",
            "commenter": "Paula Caron-Stone",
            "timestamp": "March 11, 2025 9:37 AM AWST",
            "datetime": "1741657073",
            "relative_time": "2 days ago"
          },
          {
            "text": "Hi Paula, You are in our system and I can send you a direct link to your survey, but I will not post it here publicly. Please send an email to service@platypod.com and we can reply with a link to your survey.",
            "commenter": "Lawrence Becker",
            "timestamp": "March 11, 2025 6:23 PM AWST",
            "datetime": "1741688628",
            "relative_time": "2 days ago"
          },
          {
            "text": "no survey here.",
            "commenter": "Alessandro Volto Voltolina",
            "timestamp": "February 17, 2025 3:50 AM AWST",
            "datetime": "1739735426",
            "relative_time": "25 days ago"
          },
          {
            "text": "Many steps must happen behind the scenes before surveys can be sent out. We're keeping things right on schedule! 😁 Surveys are scheduled to go out in 2 weeks or less as promised.",
            "commenter": "Lawrence Becker",
            "timestamp": "February 17, 2025 4:19 AM AWST",
            "datetime": "1739737147",
            "relative_time": "25 days ago"
          },
          {
            "text": "I have not yet received a survey. Have they been sent?",
            "commenter": "Jason",
            "timestamp": "February 17, 2025 3:19 AM AWST",
            "datetime": "1739733554",
            "relative_time": "25 days ago"
          },
          {
            "text": "Many steps must happen behind the scenes before surveys can be sent out. We're keeping things right on schedule! 😁",
            "commenter": "Lawrence Becker",
            "timestamp": "February 17, 2025 4:17 AM AWST",
            "datetime": "1739737072",
            "relative_time": "25 days ago"
          },
          {
            "text": "Surveys? What survey?",
            "commenter": "Kernwj@comcast.net",
            "timestamp": "February 13, 2025 1:05 AM AWST",
            "datetime": "1739379926",
            "relative_time": "29 days ago"
          },
          {
            "text": "The way Kickstarter works is that, once a campaign is complete, all backers receive an email that clarifies remaining questions like, do you want any additional sale priced items from our add-on store? Is this the physical address where we will be shipping your Delta? etc. Kickstarter calls this a \"survey\" but it's really just a 'post-campaign final details collection' document. It will be emailed to the address on file that was used when each backer made their pledge.",
            "commenter": "Lawrence Becker",
            "timestamp": "February 13, 2025 2:06 AM AWST",
            "datetime": "1739383566",
            "relative_time": "29 days ago"
          },
          {
            "text": "Headed to an Ecudorian Cloud forest Reserve and Galapagos in two weeks, have ordered a Delta for the second delivery window as I would be traveling when the first wave was to be shipped. Is there any possibility of getting one of the early arrivals before the end of February if I can upgrade $ ? I could get some photos of it in use from the Extreme I've already packed......Thanks",
            "commenter": "Daniel McKee",
            "timestamp": "February 12, 2025 10:35 AM AWST",
            "datetime": "1739327753",
            "relative_time": "29 days ago"
          },
          {
            "text": "Hi Daniel, as you can see from this latest update, the first shipment of Deltas is on hand for us to ship to early backers as promised. The promise was that early shipments would go out in the first 2 weeks of March, and this update confirms that it will happen. The shipping & deliver process is: 1) complete the campaign; 2) send out surveys to confirm shipping info plus any add-ons from the BackerKit add-on store; 3) Batch process survey responses to create shipping orders; 4) Ship out early backer packages consistent with the requests listed in the survey; 5) Process other orders for later backers With this in mind, the projected shipping timeframe for the earliest backers who also return their surveys, will be to receive their Platypod Deltas and add-ons in the first half of March.",
            "commenter": "Lawrence Becker",
            "timestamp": "February 12, 2025 7:21 PM AWST",
            "datetime": "1739359316",
            "relative_time": "29 days ago"
          }
        ]
      },
      {
        "update_number": "UPDATE #2",
        "title": "Wow! Over 1700 backers and 1 week to go!!!",
        "creator": "Larry Tiefenbrunn\nFebruary 8, 2025",
        "date": "February 8, 2025",
        "content": "Delta is due to arrive in California over the next several days and I am pleased to confirm that we plan to begin shipments to our “early delivery” backers during the first week of March in the United States, and the second week elsewhere. Once the shipment (over 1200 units) arrives in California, it will be transferred over to Fedex where it will head to our fulfillment center in New Jersey. As soon as I get confirmation from FedEx that they have the shipment, I will post another update, hopefully prior to the end of this campaign.\n\nWith only one week to go, I have to say that we have surpassed expectations and I want to thank you all! Now is the time to please reach out to your friends and photography colleagues to let them know what we are doing, so that they too can take advantage of being first in line to receive the amazing new Platypod Delta. This would be much appreciated.\n\nWe just returned from ImagingUSA 2025 in Dallas, where hundreds of people had the opportunity to try out our new equipment. They were most enthusiastic about the Delta and the new Platyball Traveler ballhead as well. Their only disappointment was that they could not purchase a Delta then and there, but we guided them over to Kickstarter.\n\nTo summarize, here's the projected schedule:\n\nFebruary 15th: Kickstarter ends.\n\nFebruary 25th (give or take a few days): We will send out the BackerKit “Survey.” For those new to Kickstarter, the “Survey” is a necessary data-collection form to gather address and logistic information. These surveys will be accompanied by the “Add-on\" store from BackerKit, where our backers will have the opportunity to purchase other Platypod equipment, as well as doubles or triples of their current offers at deep discounts. The flat rate shipping fee that appears at the bottom of the Kickstarter campaign will remain the same regardless of add-ons. Please be aware that many countries may charge VAT according to their own rules. Backers are responsible for local duties and VAT. We will not be charging VAT ourselves.\n\nBarring any unforeseen inventory issues, we plan to send out all items in the add-on store, together with the respective rewards. In other words, if you ordered rewards for \"early delivery\" the add-ons should ship together. If that is not possible, we will try to contact you for alternatives. BACKERS will only have ONE opportunity to use the add-on store so please, try to decide in advance, which items you want. Go to www.platypod.com to research our various products and accessories.\n\nMarch 3-7: shipping begins to “early delivery” backers throughout North and South America. \nMarch 10-14: shipping begins to “early delivery” backers for the rest of the world. These will ship out from Antwerp, Belgium.\n\nApril 1-15: shipping begins to all remaining backers.\n\nOne final note, our two fulfillment centers, the one in New Jersey and the one in Belgium, have algorithms that decide the best methods of delivery, combining price and speed of delivery. Therefore, we cannot tell you yet which carrier will bring your reward or exactly how long it will take. In the United States, the average delivery should take 2 to 7 days. Same in the European Union. In the rest of the world, the greatest delays usually occur due to your local customs authorities and that is totally out of our control. Expect anywhere from one week to six weeks in these locales. Please bear with us and we will try to make sure that everybody gets their rewards in very reasonable time.\n\nWe plan to post one more brief update prior to the close of the campaign, and again we want to thank everyone for your incredible support to help bring this wonderful product to market. We could not do this without you!\n\nBest wishes,\nLarry Tiefenbrunn",
        "url": "https://www.kickstarter.com/projects/platyball/platypod-delta-tripod/posts/4309341",
        "likes_count": 14,
        "comments_count": 3,
        "comments": [
          {
            "text": "Super. Thanks",
            "commenter": "Jean De staercke",
            "timestamp": "February 9, 2025 1:19 AM AWST",
            "datetime": "1739035190",
            "relative_time": "about 1 month ago"
          },
          {
            "text": "Will we be able to upgrade to the faster shipping during the Add-on Store process?",
            "commenter": "CJ White",
            "timestamp": "February 8, 2025 3:13 AM AWST",
            "datetime": "1738955638",
            "relative_time": "about 1 month ago"
          },
          {
            "text": "CJ, the Add-on store is just optional, additional items you might want to add to your original pledge. Kickstarter does not allow modifications to your original pledge choice structure. Only add-ons, and shipping is not available as an Add-on.",
            "commenter": "Lawrence Becker",
            "timestamp": "February 8, 2025 3:38 AM AWST",
            "datetime": "1738957121",
            "relative_time": "about 1 month ago"
          }
        ]
      },
      {
        "update_number": "UPDATE #1",
        "title": "The Delta Journey, now with over 1000 backers!!!",
        "creator": "Larry Tiefenbrunn\nJanuary 18, 2025",
        "date": "January 18, 2025",
        "content": "We are happy to report that our brand new Delta Kickstarter campaign is off to a fantastic start. A sincere thanks to all of our backers!!\n\nIn fact, we have more than 1000 backers in our first week and only about 29 more days to go. The first round of manufacturing has already happened and the shipment is on the way to us before the end of February so we can quickly deliver on our promises to our “Early Delivery” backers for delivery in March. We have also started additional production with our manufacturer in China, but that next batch may be produced slightly slower because of the Chinese New Year. No worries, it will still be here ahead of time for delivery in April as promised. Please be aware that some “Early Backer” Reward Levels may sell out due to limited quantities.\n\nMost people already know that we are based in the US and ship from New Jersey, but we have also recently established shipping to almost all of the EU from Belgium, so that will minimize VAT for our EU customers.\nOne final thing that Kickstarter backers know about is, many companies including Platypod, set up an “add-on store” and we will make this available to our backers as well. Essentially, when the Kickstarter campaign wraps up, you will get a survey from Backerkit that allows you to add multiple rewards as well as other Platypod products to your primary Kickstarter investment at a discount and without additional shipping charges! Watch for future updates as we get closer to the final days of the Delta Campaign.\nAll my best,\n\nLarry Becker",
        "url": "https://www.kickstarter.com/projects/platyball/platypod-delta-tripod/posts/4294749",
        "likes_count": 26,
        "comments_count": 0,
        "comments": []
      }
    ]
  }
}