{
  "url": "https://www.kickstarter.com/projects/flatoutgames/point-galaxy-propolis",
  "updates": {
    "count": 1,
    "content": [
      {
        "update_number": "UPDATE #1",
        "title": "YAY! We Did It - We're Fully Funded! Thank You and Welcome!",
        "creator": "FLATOUT GAMES\nFebruary 24, 2025",
        "date": "February 24, 2025",
        "content": "Hey there, Point Galaxy + Propolis backers!\nFirst, we hope you are having a wonderful weekend!\nSecond, thank you all SO MUCH for your support of the campaign! \nWhat an incredible start we have had! In under a week we have over 4,000 backers and are one of the top projects on Kickstarter! All because of you! The project is also fully funded! It is always so fun to bring our designs to Kickstarter! We are excited, and grateful, and so very pleased that we get to make this project with all of you! This is going to be fun!\nWelcome to the Point Galaxy + Propolis Kickstarter!\nWelcome! We are very excited to have you along for the ride! We already recognize many familiar faces from our previous campaigns! It's amazing to see so many of you back! One of the aspects of our campaigns is that we like to keep our backers informed of what is going on each step of the way. We will send semi-regular news when there is something new or exciting to report, but we don't have a regular schedule for updates. Our goal with the updates is to share new information with you and keep you all excited as part of the journey that we're taking together! During the campaign we will hopefully be getting new backers joining us every day, so we'll be excited to keep them up to date periodically with a new post. That said, we're also very active in the comments section of the page, so if you ever need anything, feel free to send us a direct message, or post in the comments and we'll get back to you as soon as we can.\nWe see this project as a journey that we are taking with our backers. We are a small but energetic team, relatively new to this work, and learning as we go. We don't have full-time staff or a dedicated support team. It's just a group of people making games we want to share with you. We have learned a lot from our past campaigns, both what to do and what not to do, but in the end we are absolutely thrilled with how our previous projects have turned out as games and overall products. We love fostering community, and our Kickstarter community is awesome! It is supportive and enthusiastic, and we love that! We want to create an exciting and productive space for us all to take the trip together!\nPoint Galaxy and Propolis are two games that have been in development for a couple of years. The concepts for the games have been around for a while, but it's been a real push over the last several months to get the games to where they are today. With the success of Point City, we were interested in trying our hand at designing a follow-up and naturally thought that 'scaling up' to the galaxy was the next place to go! The concept for that game was born during a long walk home where we discussed all of the possible ways 'Point Galaxy' could work, and came up with building sequences of planets in different solar systems. That concept worked well and became the basis for the game! Propolis was designed years ago and has gone through many iterations to find the right balance of interlocking mechanics. It started with the idea of a simple worker placement game that had a dynamic market of possible worker placement slots, along with a competitive area influence component. The game used to be called 'Realms', and the medieval bee theme is relatively new as an evolution of the original medieval theme. Over the past several months we worked on ways to integrate the mechanics and theme to make a really cohesive game design. We also spent a lot of time as a team refining all of the elements of the game so that they all harmonized and worked great together. It's also challenging to keep making high quality games and keeping our Kickstarter pledge prices as low as we can, but this is one of the challenges that we embrace! We love making games and we are so fortunate to be doing what we're doing. Thanks for your interest in our newest creations! \nWe are excited to have you along to make these games a reality! It would also really help us out if you could share the campaign on social media and any groups you might be a part of! You can use the following link: \nhttps://www.kickstarter.com/projects/flatoutgames/point-galaxy-propolis\nProgress!\nWe are making great progress with the games and hope to have them fulfilled as soon as possible! As you can see from the page and from the prototypes in the videos the games are very close to completion and we'll be getting production started very soon.\nThere are lots of great previews/reviews on our Kickstarter page, and there are a few more playthroughs and streams coming up!\nThank YOU So Much!\nWe always like to close out our updates with a massive THANK YOU to all of our backers! We are so appreciative of all of the support you give us and we simply could not make these games a reality without all of you. Our Point Galaxy + Propolis team has been working so hard to prepare for the launch of this campaign and put so many hours into designing, testing, retesting, building new modes, developing, and sharing these puzzly little games! Thank you, thank you, thank you, for showing up early to the campaign! We're going to be working hard every step of the way to complete the games, and we can't wait to see what the coming weeks and months have in store! We've had a couple days of rest after a very hectic few days getting ready for launch and we're back to work spreading the word and finishing up both games! Thanks for the comments and discussion and for sharing the campaign to help us grow the community! We always try to keep up and respond to every comment and it is great to hear all of the ideas and excitement for the game. Thanks again for your enthusiasm! \nTake care and please be lovely to one another!\nTeam Point Galaxy + Propolis\nMolly, Shawn, Robb, Dylan, David, and Joseph",
        "url": "https://www.kickstarter.com/projects/flatoutgames/point-galaxy-propolis/posts/4321352",
        "likes_count": 64,
        "comments_count": 8,
        "comments": [
          {
            "text": "Congratulations, Flatout Games! Cascadia is one of my favorite games and we also love Point Salad. We are thrilled to support your projects. ♥️",
            "commenter": "Laura Whitaker",
            "timestamp": "February 24, 2025 6:40 PM AWST",
            "datetime": "1740393656",
            "relative_time": "about 14 hours ago"
          },
          {
            "text": "Thank you, Laura! It really means a lot! We hope you'll love these new games as much as the old classics! :) Thanks so much for your support!",
            "commenter": "FLATOUT GAMES",
            "timestamp": "February 25, 2025 3:15 AM AWST",
            "datetime": "1740424526",
            "relative_time": "about 5 hours ago"
          },
          {
            "text": "I have no issues backing Flatout projects. My son loves all of your games so new ones always go down well! Good luck with production and I can't wait to get my hands on the new games! 🙂",
            "commenter": "Ian Plumpton",
            "timestamp": "February 24, 2025 4:20 PM AWST",
            "datetime": "1740385227",
            "relative_time": "about 16 hours ago"
          },
          {
            "text": "That's so great to hear - thanks for sharing! Can't wait for you and your son to enjoy the games together! Thanks for your support!",
            "commenter": "FLATOUT GAMES",
            "timestamp": "February 25, 2025 3:14 AM AWST",
            "datetime": "1740424494",
            "relative_time": "about 5 hours ago"
          },
          {
            "text": "I love the Point series. We are usually heavy game players, but it is very funny and addicting",
            "commenter": "Delia Volpi",
            "timestamp": "February 24, 2025 1:48 PM AWST",
            "datetime": "1740376107",
            "relative_time": "about 19 hours ago"
          },
          {
            "text": "That's great to hear! We love all types of games, but we do love when a game 'punches above its weight' and is competitive even for seasoned gamers. :) Thanks so much for your support!",
            "commenter": "FLATOUT GAMES",
            "timestamp": "February 25, 2025 3:14 AM AWST",
            "datetime": "1740424448",
            "relative_time": "about 5 hours ago"
          },
          {
            "text": "Happy to be here! I've watched every related content on YouTube, I'm excited about both games. But I do have a proposal improvement for Point Galaxy, since the graphic is in development: there could be an update on the small symbol for the orange planet, on the smaller symbol it kinda looks sad, like it has two eyes and a downward turned mouth... Or is it just me? 🤣🤗 Best of luck and hope to play the games soon",
            "commenter": "Andrei Steopan",
            "timestamp": "February 24, 2025 12:30 PM AWST",
            "datetime": "1740371450",
            "relative_time": "about 20 hours ago"
          },
          {
            "text": "Thanks so much for the feedback! Our artist/graphic designer worked to make sure that all of the icons were easy to differentiate - the sad face was unintentional - sorry about that! :) Thanks for all of your support! :)",
            "commenter": "FLATOUT GAMES",
            "timestamp": "February 24, 2025 1:02 PM AWST",
            "datetime": "1740373331",
            "relative_time": "about 20 hours ago"
          }
        ]
      }
    ]
  }
}