{
  "url": "https://www.kickstarter.com/projects/palaeogames/professor-primulas-portfolio-of-palaeontology",
  "campaign_details": {
    "funding_end_date": "2025-04-07T22:36:31.241865Z",
    "pledged_amount": "S$ 349,136",
    "funding_goal": "S$ 17,302",
    "backers_count": "2,738",
    "days_left": 12
  },
  "updates": {
    "count": 10,
    "content": [
      {
        "update_number": "UPDATE #13",
        "title": "Nearly reaching 200k! What will it get us?",
        "creator": "PalaeoGames\nMarch 25, 2025",
        "date": "March 25, 2025",
        "content": "Hey everyone,\nWe’re just shortly about to hit the next stretch goal – unlocking a gigantic 3D model for all backers who pledged with digital reward stretch goals! In case anyone is unfamiliar with it, the 3D model is for Paralititan, a titanosaur sauropod from northern Africa. This enormous dinosaur inhabited the same environment as Spinosaurus and full rules for it can be found in Dr Dhrolin’s Dictionary of Dinosaurs!\nCheck out just how big this titan was:\nYeah. That lil' thing is the giant Spinosaurus... This artwork was illustrated by Mark Witton for Dr Dhrolin's and really helps carry the magnitude of this animal. It makes for an amazing encounter.\nWhile we have you here, we’d like to show you a project that our friends over at Studio Agate are working on.\nSecrets of Magic\nAfter the critically acclaimed Creatures and Encyclopedia series, Secrets of Magic launches a brand-new collection of toolboxes for 5E—this time centered on magical lore and wonders! Bring fresh excitement to your next campaign with a trove of new lore, player options, and additional rules, rekindling the sense of wonder that magic brings to your 5E game!\nCompatible with both the 2014 and 2024 versions of 5E, as well as the major new installment in the Fateforge universe, Secrets of Magic is a 250+ page tome brimming with magical content, spellcaster-focused options, potion brewing, item crafting, new archetypes, sublimation rules, and much more!\nBased in France, Studio Agate is an indie studio gathering a dozen creators. They have become specialized in the creation of imaginary worlds, the writing of scenarios, and transmedia. They design role-playing game books (including Shadows of Esteren, the most award-winning French RPG), music albums, and video games. They also translate and publish licenses of great games (Brancalonia, Iron Kingdoms, 7th Sea, Vampire: the Requiem) under the Agate RPG label.\nThat's all for the moment. I'll likely be back with another update soon when we hit the 200k mark!\nAll the best,\nDr Barling",
        "url": "https://www.kickstarter.com/projects/palaeogames/professor-primulas-portfolio-of-palaeontology/posts/4344688",
        "likes_count": 19,
        "comments_count": 0,
        "comments": []
      },
      {
        "update_number": "UPDATE #12",
        "title": "Full preview: Path of the Tyrannosaur Barbarian",
        "creator": "PalaeoGames\nMarch 24, 2025",
        "date": "March 24, 2025",
        "content": "Hey everyone,\nOur wonderful friend Bone Wizard has just released a video reviewing and showing off the Path of the Tyrannosaur Barbarian. This review covers the full subclass!\nCheck it out here: https://www.youtube.com/watch?v=sL01P5zsL18\nBone Wizard is an absolutely amazing YouTuber who we think is going to be growing very fast and is hitting the D&D scene with force. Check out his channel for other excellent content.\nAll the best,\nDr Barling",
        "url": "https://www.kickstarter.com/projects/palaeogames/professor-primulas-portfolio-of-palaeontology/posts/4343986",
        "likes_count": 23,
        "comments_count": 2,
        "comments": [
          {
            "text": "Watched it. I now have a new favorite barbarian. Now I just need the Bone Wizard or YMBA to do a video on the Ancient Beast Warlock and the Circle of Cycles druid.",
            "commenter": "Lucian",
            "timestamp": "March 24, 2025 9:41 AM AWST",
            "datetime": "1742780468",
            "relative_time": "3 days ago"
          },
          {
            "text": "I'm sure we'll get to them at some point! Dr Barling",
            "commenter": "PalaeoGames",
            "timestamp": "March 24, 2025 5:09 PM AWST",
            "datetime": "1742807341",
            "relative_time": "2 days ago"
          }
        ]
      },
      {
        "update_number": "UPDATE #11",
        "title": "The Halfway Mark!",
        "creator": "PalaeoGames\nMarch 23, 2025",
        "date": "March 23, 2025",
        "content": "Hey everyone,\nWe’ve just crossed two massive milestones - the whopping £175k mark (1750% funded!) and the half-way point of the campaign. We never thought we’d come this far this quickly – already surpassing our first Kickstarter and only halfway through!\nWords can’t really express how thankful we are to everyone for their amazing support, but we’ll give it a try – THANK YOU! Knowing that our writing and artwork is enjoyed by so many people is frankly overwhelming and makes all of the hard work worth it.\nWe're going to do everything we possibly can to make this book the best it can be.\nAll the best,\nDr Barling",
        "url": "https://www.kickstarter.com/projects/palaeogames/professor-primulas-portfolio-of-palaeontology/posts/4343541",
        "likes_count": 51,
        "comments_count": 5,
        "comments": [
          {
            "text": "It's because the first book was so good! BTW, Ginny Di's sponsored vlog about dinosaurs in D&D was really solid. If I hadn't already backed this, that video would have made me do it.",
            "commenter": "Keith Langley",
            "timestamp": "March 23, 2025 1:27 PM AWST",
            "datetime": "1742707648",
            "relative_time": "3 days ago"
          },
          {
            "text": "Nothing says thank you for the success of the second book like an amazing third book would. 😇",
            "commenter": "Mike Fett",
            "timestamp": "March 23, 2025 7:32 AM AWST",
            "datetime": "1742686345",
            "relative_time": "4 days ago"
          },
          {
            "text": "🫡",
            "commenter": "PalaeoGames",
            "timestamp": "March 23, 2025 5:55 PM AWST",
            "datetime": "1742723708",
            "relative_time": "3 days ago"
          },
          {
            "text": "I can only imagine with Ginny Di's video there will be a lot more to come!",
            "commenter": "Kevin Handcock",
            "timestamp": "March 23, 2025 6:27 AM AWST",
            "datetime": "1742682473",
            "relative_time": "4 days ago"
          },
          {
            "text": "Fingers crossed!",
            "commenter": "PalaeoGames",
            "timestamp": "March 23, 2025 5:55 PM AWST",
            "datetime": "1742723726",
            "relative_time": "3 days ago"
          }
        ]
      },
      {
        "update_number": "UPDATE #10",
        "title": "ALL BOOK CONTENT UNLOCKED! £140k!!",
        "creator": "PalaeoGames\nMarch 18, 2025",
        "date": "March 18, 2025",
        "content": "Hey everyone,\nAfter a well-needed Sunday break yesterday, we’re back in the saddle of smashing stretch goals! We’ve just hit our £140k stretch goal, unlocking the last of the book’s content.\nThat means, we’re DONE with the book content! Everything that we can possibly add is lined up and funded. This means that we’re expecting the book to be a 320+ page BEHEMOTH of content, although won’t know for sure until the writing is done!\nThank you all so much for helping us get here, we hope you’re as excited for Professor Primula’s Portfolio of Palaeontology as we are to finish writing it. \nSo, what’s the up and beyond from here? Well, obviously there’s the Pathfinder Second Edition conversion. However, we’ll also be using any further money raised to expand the commissioned artwork in the book, as well as putting some aside for another couple of secret projects. You’ll be seeing those in future years.\nWe can’t share those projects just yet, because nothing is fully set in stone. However, we can assure you that they’ll be as ambitious as Dr Dhrolin’s & Professor Primula’s. Nevertheless, rest assured that our full attention is on Professor Primula’s for the upcoming year, and we won’t be diverting any attention away to other projects until we’re 100% satisfied with Professor Primula’s.\nThanks again for helping us reach this unbelievable goal, with still two thirds of the campaign left to go!!\nAll the best,\nDr Barling",
        "url": "https://www.kickstarter.com/projects/palaeogames/professor-primulas-portfolio-of-palaeontology/posts/4339040",
        "likes_count": 36,
        "comments_count": 3,
        "comments": [
          {
            "text": "COME ON PATHFINDER CONVERSION!!!!!!!!!!!!!!!!!!",
            "commenter": "Kevin Baeder",
            "timestamp": "March 18, 2025 10:46 AM AWST",
            "datetime": "1742265964",
            "relative_time": "8 days ago"
          },
          {
            "text": "Could use some of the money for supplemental pdf's. Like pre-human deities or settings from Edgar Rice Burroughs, Lin Carter or the warlord comics by DC, turok.",
            "commenter": "Paul Woods",
            "timestamp": "March 18, 2025 5:07 AM AWST",
            "datetime": "1742245623",
            "relative_time": "9 days ago"
          },
          {
            "text": "I cannot wait for the PF2e conversion, as then I can drop it into Starfinder 2ed and have an AWESOME DINOSAURS IN SPACE that I have wanted since I was a wee hatchling.",
            "commenter": "Doug Carter",
            "timestamp": "March 18, 2025 3:29 AM AWST",
            "datetime": "1742239746",
            "relative_time": "9 days ago"
          }
        ]
      },
      {
        "update_number": "UPDATE #9",
        "title": "We've just added another free digital reward stretch goal!",
        "creator": "PalaeoGames\nMarch 15, 2025",
        "date": "March 15, 2025",
        "content": "Hey everyone,\nWe're over half way to reaching the next stretch goal at £140k! That means we're likely to hit the that stretch goal tomorrow or the day after.\nIn anticipation of that, we've added in ANOTHER STRETCH GOAL, this time in the big gap between 140k and the Pathfinder version at 300k. \nSo now, at 200k, every backer who supports us at a tier that includes digital stretch goal rewards will receive a FREE Paralititan 3D model. This enormous multi-part model makes for an amazing centrepiece on your tabletop. \n\nSculpted by the amazing Matt Ramieri, this monster model will crush anything underfoot! We hope you like it.\n\nAll the best,\nDr Barling",
        "url": "https://www.kickstarter.com/projects/palaeogames/professor-primulas-portfolio-of-palaeontology/posts/4337763",
        "likes_count": 29,
        "comments_count": 0,
        "comments": []
      },
      {
        "update_number": "UPDATE #8",
        "title": "120k UNLOCKED & Cross Promo with Old Oak Games",
        "creator": "PalaeoGames\nMarch 15, 2025",
        "date": "March 15, 2025",
        "content": "Hey everyone,\nWell, we've done it. We've smashed the 120k goal and are STILL climbing. There are now only two more stretch goals left.... although, saying that... we're discussing amongst the team about trying to squeeze in some more between 140k and 300k! Watch this space over the coming days.\nThanks again for your amazing support and helping us get here!\nWhile we've got you here, our friends at Old Oak Games have just launched their new Kickstarter for Beyond the Woods, a brand new dark fantasy campaign setting for 5th edition inspired by Irish myth and legend! \nCreated by Emmet Byrne, the award-winning designer of Warhammer Age of Sigmar Soulbound and Broken Weave, Beyond the Woods brings classic open-world fantasy roleplaying and exploration to 5e. It's a hexcrawl survival game set against the backdrop of a beautiful and terrifying world inspired by Irish mythology and influenced by games like Elden Ring. Beyond the Woods includes new rules for survival and exploration, a reimagined inventory system inspired by classic survival horror games like Resident Evil, new classes and subclasses, new lineages, magic items, adventures, and more! \nEmmet is a powerhouse of game design, so you can expect the absolute highest-quality rules in the books. Irish folklore is also really close to Mike O'Sullivan's hear, so he has been nagging my ear off to support Old Oak Games however we can.\nAll the best,\nDr Barling",
        "url": "https://www.kickstarter.com/projects/palaeogames/professor-primulas-portfolio-of-palaeontology/posts/4336563",
        "likes_count": 15,
        "comments_count": 2,
        "comments": [
          {
            "text": "I love Dr Dhrolin’s, and really look forward to Prof Primula’s. I have one request, which might seem odd to you if you run your games in meatspace. For all of your creature stat blocks, could you please include these words in their attack lines? “Melee weapon attack: +n to hit, for m damage type damage” In DDDD you left out the words “to hit”, so when your stat blocks are imported into a VTT they don’t work. The attack line isn’t recognized so the creature won’t roll dice. I have to manually add “to hit” to every attack roll line of every dinosaur I want to use in a game. I know this is true for Fantasy Grounds users and it’s likely the case for Foundry and Roll20 GMs as well. It might sound like a small thing but as a professional GM I have six campaigns per week running, and since i can’t edit the source PDF of DDDD I have to separately edit each attack, for each creature, for each campaign in which I will use them. Those six characters missing makes a big difference for the millions of people who play remotely, if they want to use your amazing creation. Thanks for considering this. I run six campaigns per week using Fantasy Grounds virtual tabletop, one of the three most widely used VTTs along with Foundry and Roll20",
            "commenter": "Keith Langley",
            "timestamp": "March 15, 2025 3:16 PM AWST",
            "datetime": "1742022986",
            "relative_time": "11 days ago"
          },
          {
            "text": "Whoo! Hope you decide to slide something in there. Seeing more environs would be amazing, though I know those tend to be a lot of work. Clarno nut and Turtle cove assemblages are pretty complete, being only 15 million years apart, and pretty close together could make for a fun \"glitching\" or time shift environment. But even more critters and fossils would be amazing too.",
            "commenter": "Monroe",
            "timestamp": "March 15, 2025 12:45 AM AWST",
            "datetime": "1741970708",
            "relative_time": "12 days ago"
          }
        ]
      },
      {
        "update_number": "UPDATE #7",
        "title": "Another day, another milestone!",
        "creator": "PalaeoGames\nMarch 13, 2025",
        "date": "March 13, 2025",
        "content": "Hey everyone,\nOur project's momentum just won't stop! We're about to breach the 120k stretch goal, unlocking almost all of the remaining creatures. We've also sold out of Tier 13: Create a creature pledges!! This means that we'll be getting five extra creatures added that are total wildcards! \nInitial discussions are amazing and we're already cooking up some really fun ideas. Expect to see some awesome \"boss\" dinosaurs added!\nWhile we have you here, our friends over at the Eren Chronicles are running a new campaign for a project inspired by the grim, cautionary tales of Slavic and Balkan folklore! If you like The Witcher, then this is one to check out!\nZAMANORA: Ballad of the Witch introduces heaps of new content. Immersive mechanics, more than 20 character options, over 65 monsters, spells, curses, ceremonies, folkloric relics, and adventure locales sprung from the realm of myth are only a part of what this rustic setting has to offer. Moreover, everything is going to be compatible with the latest edition of D&D and the most anticipated RPG of 2025, Legend in the Mist!\nHonestly, the artwork for this project is stunning and it’s an amazing opportunity to learn about real-world folklore. As you all know, using TTRPGs to educate is our passion, so we love this project and we think you will too.\nThat's all for now. We'll see you on the other side when we breach the 120k mark and beyond!\nAll the best,\nDr Barling",
        "url": "https://www.kickstarter.com/projects/palaeogames/professor-primulas-portfolio-of-palaeontology/posts/4336221",
        "likes_count": 17,
        "comments_count": 0,
        "comments": []
      },
      {
        "update_number": "UPDATE #6",
        "title": "We've breached 100k!!",
        "creator": "PalaeoGames\nMarch 12, 2025",
        "date": "March 12, 2025",
        "content": "Hey everyone,\nHoly balls, £100k in FOUR DAYS! We’re far exceeding our wildest dreams with this Kickstarter and we’re yet to even launch into our sponsorships. From the bottom of our hearts: THANK YOU SO MUCH! With all of your support, we’re going to make Professor Primula’s the best we possibly can.\nThe momentum is continuing too, so it won’t be long before we hit the next stretch goal. We’re already over 30% of the way there! That will round off our creature list (except one), filling out the book to near capacity.\nThe last stretch goal we unlocked was for a custom palaeo-themed D20 dice. This dice is FREE for everyone who backed at a tier with physical reward stretch goals included. We’re aiming for a high-quality custom dice with an inclusion that is palaeontology-themed. We’ve got some fun ideas for it, but let us know in the comments below what you’d like to see!\nAll the best,\nDr Barling",
        "url": "https://www.kickstarter.com/projects/palaeogames/professor-primulas-portfolio-of-palaeontology/posts/4335213",
        "likes_count": 32,
        "comments_count": 15,
        "comments": [
          {
            "text": "A shell or bone fossil inclusion like an ammonite or skull would be cool.",
            "commenter": "I",
            "timestamp": "March 13, 2025 7:12 AM AWST",
            "datetime": "1741821162",
            "relative_time": "14 days ago"
          },
          {
            "text": "Could even be of a specific individual fossil that is notable.",
            "commenter": "I",
            "timestamp": "March 13, 2025 7:27 AM AWST",
            "datetime": "1741822050",
            "relative_time": "14 days ago"
          },
          {
            "text": "My second instinct to say an amber themed one with maybe feathers inside? My first was a certain harvestman described by Dr Dunlap.",
            "commenter": "Monroe",
            "timestamp": "March 13, 2025 6:33 AM AWST",
            "datetime": "1741818787",
            "relative_time": "14 days ago"
          },
          {
            "text": "Do you mean by James Dunlop? He's described so much over the years. Really awesome guy too. Dr Barling",
            "commenter": "PalaeoGames",
            "timestamp": "March 13, 2025 3:58 PM AWST",
            "datetime": "1741852691",
            "relative_time": "13 days ago"
          },
          {
            "text": "I think simple fossil themed dice would be so cool",
            "commenter": "Sonia Mann",
            "timestamp": "March 13, 2025 6:15 AM AWST",
            "datetime": "1741817746",
            "relative_time": "14 days ago"
          },
          {
            "text": "Regarding the dice, although amber is popular opinion, I would see a paleo-themed dice in ivory and rustic or limestone-colored. And the numbers are \"roughly engraved\" except for nat 20 which is a \"gold-toned\" T. rex skull from the front and nat 1 which is a \"gold-toned\" Triceratops skull from the front. Or nat 1 could also be an Ammonite from the side.",
            "commenter": "Daniel Malinen",
            "timestamp": "March 13, 2025 6:05 AM AWST",
            "datetime": "1741817137",
            "relative_time": "14 days ago"
          },
          {
            "text": "I’m thinking lava themed or fossil themed dice",
            "commenter": "Ahusky123",
            "timestamp": "March 12, 2025 9:23 PM AWST",
            "datetime": "1741785801",
            "relative_time": "14 days ago"
          },
          {
            "text": "Maybe use bones for the numbers :)",
            "commenter": "Ahusky123",
            "timestamp": "March 13, 2025 12:50 AM AWST",
            "datetime": "1741798243",
            "relative_time": "14 days ago"
          },
          {
            "text": "Bone for the numbers is a really cool idea! I'll need to check if that is possible for us to do.",
            "commenter": "PalaeoGames",
            "timestamp": "March 13, 2025 1:10 AM AWST",
            "datetime": "1741799435",
            "relative_time": "14 days ago"
          },
          {
            "text": "I would like trilobite dice.",
            "commenter": "Jenny Wiersma",
            "timestamp": "March 12, 2025 8:41 PM AWST",
            "datetime": "1741783273",
            "relative_time": "14 days ago"
          },
          {
            "text": "A cool idea!",
            "commenter": "PalaeoGames",
            "timestamp": "March 12, 2025 8:54 PM AWST",
            "datetime": "1741784077",
            "relative_time": "14 days ago"
          },
          {
            "text": "I hate to be cliche, but I'm thinking amber die with something inside it. Hopefully something more exciting than a mosquito, I really like the idea of a carnivorous dino skull inside (great idea Oidhreacht!).",
            "commenter": "Mike Fett",
            "timestamp": "March 12, 2025 8:23 PM AWST",
            "datetime": "1741782199",
            "relative_time": "14 days ago"
          },
          {
            "text": "We talked about doing a mosquito, but other companies have done that before. I'm thinking amber too, then we'll have to decide exactly what'll be inside it!",
            "commenter": "PalaeoGames",
            "timestamp": "March 12, 2025 8:36 PM AWST",
            "datetime": "1741782968",
            "relative_time": "14 days ago"
          },
          {
            "text": "Perhaps the dice could be a resin dice, with something palaeo themed inside, like mabey an upper skull of an extinct creature inside, or if you could get them small and anatomical enough perhaps a feathery dromiosaur or even downy tyranid?",
            "commenter": "Oidhreacht",
            "timestamp": "March 12, 2025 8:04 PM AWST",
            "datetime": "1741781075",
            "relative_time": "14 days ago"
          },
          {
            "text": "Those are great ideas. If we resin print the inclusion ourselves, there's quite a lot we could do!",
            "commenter": "PalaeoGames",
            "timestamp": "March 12, 2025 8:22 PM AWST",
            "datetime": "1741782154",
            "relative_time": "14 days ago"
          }
        ]
      },
      {
        "update_number": "UPDATE #5",
        "title": "Check out this other amazing D&D project from our friends at Roll For Combat!",
        "creator": "PalaeoGames\nMarch 11, 2025",
        "date": "March 11, 2025",
        "content": "Hey everyone,\nAs we climb to the £100k mark, we wanted to share something extra with you. Our wonderful friends at Roll For Combat have just released their new Kickstarter. It's called:\nBattlezoo Ancestries: Living Legends \nIt includes 14 playable species/ancestries for both D&D 5E and Pathfinder Second Edition.\nCheck it out here!\nIf you like angels, devils, werecreatures, and other legendary creatures as much as we do,\ntake a look at Living Legends.\nInside Living Legends You’ll Find:\n14 Playable Ancestries and Species: Play all sorts of creatures from myths,\nlegends, and fantasy folklore, including ocular evil eyes, nautiloid cerebrophages,\nstony gargoyles, riddling sphinxes, towering giants, treelike arboreals, ferocious\nwerecreatures, leonine and ophidian lamias, multifaceted swarmblood, scheming\ndevils, multipart fusions, and celestial angels, as well as golemborn, constructs come\nto life, and psychopomps, the emissaries of death.\nDeep Lore: These ancestries aren’t monoliths! Learn about their society and\nculture, including multiple factions and societal groups for each ancestry\nHundreds of Feats: Customize your character in style and shape your\ncharacter’s legend with plenty of feats for each ancestry.\nDigital Assets and Pathbuilder 2e File: All purchases receive a full set of art\nand tokens to be used in any VTT or your other favorite online game, and\nPathfinder 2e purchases receive a JSON file for Pathbuilder 2e to help build\nyour character.\nFoundry VTT, Animated Tokens, Plastic Pawns, Plushies, and More:\nBecome a legend in style with a premium Foundry VTT module for Pathfinder\n2e and 5E, over a hundred physical plastic tokens, hundreds of animated\ndigital tokens that work on nearly any VTT, psychopomp plushies, and much\nmore!\nThis and more can be unlocked with stretch goals!\nRoll For Combat have an outstanding track record of producing really high-quality and in-depth content, so if you're unfamailiar with them take a look at their Kickstarter and website for examples.\nThe Kickstarter also comes with a whole heap of really cool physical rewards that you can pick up by jumping in early or picking up as add-ons. The team behind Roll For Combat don't hold back on their physical rewards, so these will be extremely high-quality! I've copied some of their images below - take a look!\nThanks for checking them out and take care everyone!\nAll the best,\nDr Barling",
        "url": "https://www.kickstarter.com/projects/palaeogames/professor-primulas-portfolio-of-palaeontology/posts/4332849",
        "likes_count": 6,
        "comments_count": 1,
        "comments": [
          {
            "text": "Races to play Groot and Voltron? *wallet grumbling*",
            "commenter": "Mike Fett",
            "timestamp": "March 12, 2025 8:25 PM AWST",
            "datetime": "1741782327",
            "relative_time": "14 days ago"
          }
        ]
      },
      {
        "update_number": "UPDATE #4",
        "title": "24 Hours in - the first day complete! WTF",
        "creator": "PalaeoGames\nMarch 10, 2025",
        "date": "March 10, 2025",
        "content": "Hey everyone,\nThe last 24 hours have been a wild ride to say the least. After a rocky start with technical problems, our first day has not only seen us fund the book more than seven times over, but also unlock almost all of our stretch goals and pretty much all of the content for the book.\nIt's hard for us to really be able to convey our gratitude for such a stellar turn out for day one. Let's see just how far we can get over the next 29 days, but I have no doubt that we'll have unlocked absolutely everything. I hope you're all as excited as we are to see the rest of the stretch goals cleared!\nAll the best,\nDr Barling",
        "url": "https://www.kickstarter.com/projects/palaeogames/professor-primulas-portfolio-of-palaeontology/posts/4332922",
        "likes_count": 30,
        "comments_count": 8,
        "comments": [
          {
            "text": "Quality = Sales. The speed of sales shows the quality. Here's to continued high amounts of both.",
            "commenter": "Kenneth Smith",
            "timestamp": "March 10, 2025 8:59 AM AWST",
            "datetime": "1741568356",
            "relative_time": "17 days ago"
          },
          {
            "text": "Thank you so much. Means a lot to have the work we put in be recognised Dr. O'Sullivan",
            "commenter": "PalaeoGames",
            "timestamp": "March 10, 2025 9:00 PM AWST",
            "datetime": "1741611622",
            "relative_time": "16 days ago"
          },
          {
            "text": "It's almost as if someone built a solid rep on their first Kickstarter and word got out about a quality product delivered in a timely manner. Congrats!",
            "commenter": "James 'The Great Old One' Burke",
            "timestamp": "March 10, 2025 2:34 AM AWST",
            "datetime": "1741545266",
            "relative_time": "17 days ago"
          },
          {
            "text": "Thank you so much for the kind words James! Dr Barling",
            "commenter": "PalaeoGames",
            "timestamp": "March 10, 2025 3:12 AM AWST",
            "datetime": "1741547550",
            "relative_time": "17 days ago"
          },
          {
            "text": "Didn't find out about the other book and campaign until after it had ended, though I still was able to get the first book on the website. Happy to have been able to support this one. You guys deserve every ounce of success you’ve gotten so far and will get, looking forward to getting this one!",
            "commenter": "Hunter Voight",
            "timestamp": "March 10, 2025 1:29 AM AWST",
            "datetime": "1741541363",
            "relative_time": "17 days ago"
          },
          {
            "text": "<3",
            "commenter": "PalaeoGames",
            "timestamp": "March 10, 2025 1:32 AM AWST",
            "datetime": "1741541543",
            "relative_time": "17 days ago"
          },
          {
            "text": "I only found out about the first campaign after it had ended, so I'm really glad to have caught this one! Congratulations on your success!",
            "commenter": "Callum J Reid",
            "timestamp": "March 10, 2025 1:04 AM AWST",
            "datetime": "1741539850",
            "relative_time": "17 days ago"
          },
          {
            "text": "Thank you Callum. Gald you could be here with us for it! Dr Barling",
            "commenter": "PalaeoGames",
            "timestamp": "March 10, 2025 1:05 AM AWST",
            "datetime": "1741539931",
            "relative_time": "17 days ago"
          }
        ]
      }
    ]
  }
}