{
  "url": "https://www.kickstarter.com/projects/maak/scout-battery-smart-rugged-and-modular-power",
  "campaign_details": {
    "funding_period_text": "Funding period\nJan 31 2025 - Mar 2 2025 (30 days)",
    "funding_start_date": "2025-01-30T11:00:04-05:00",
    "funding_end_date": "2025-03-01T11:00:04-05:00",
    "funding_duration_days": 30,
    "pledged_amount": "$101,486",
    "funding_goal": "$5,000",
    "backers_count": "568"
  },
  "updates": {
    "count": 6,
    "content": [
      {
        "update_number": "UPDATE #6",
        "title": "THANK YOU TO ALL OF OUR AMAZING BACKERS! 🚀",
        "creator": "MAAK Outdoor\nMarch 7, 2025",
        "date": "March 7, 2025",
        "content": "We raised over $100,000 with over 500 backers for the MAAK Scout!\nYour support has validated our team's years of hard work to bring a new rugged power bank to the market and the outpour of support means the world to us. We're grateful for each and every one of our supporters and can't wait to get you your Scout! \nBacker Survey\nOur backer survey will be sent out in about 2 weeks. We'll post another update when the surveys go out to make sure you don't miss it. The survey will collect product preferences and shipping addresses to ensure a smooth fulfillment process. Keep an eye out for the survey!\nStay tuned for more product updates! \nDon't miss out on new projects, click below to join First Backer and find out first about the newest Kickstarter projects and amazing early bird offers!",
        "url": "https://www.kickstarter.com/projects/maak/scout-battery-smart-rugged-and-modular-power/posts/4328891",
        "likes_count": 7,
        "comments_count": 0,
        "comments": []
      },
      {
        "update_number": "UPDATE #5",
        "title": "Versatile Mounting, Anywhere You Need It!",
        "creator": "MAAK Outdoor\nFebruary 15, 2025",
        "date": "February 15, 2025",
        "content": "We’re excited to share more about the Adventure Clip, an accessory that enhances how you use your power—included with your pledge!\nSymmetrical Mounting\nAttach the battery in both directions to access MagSafe-compatible wireless charging.\nAMPS Compatibility \nWorks with standard AMPS mounts, making it great for boating, overlanding, ATVs, motorcycles, and more.\nCamera Mounting\nAttaches to Cameras and Camera Frames using a 1/4\"-20 screw, perfect for long filming days, time-lapse setups, and extended photography sessions.\nCar Camping \nThe strap attaches to grab handles, MOLLE panels, and more, creating the perfect charging station for your MagSafe-compatible phone when you're camping in your car.\nWe truly appreciate your support and can't thank you enough for being part of the MAAK community! 🙌 Let’s redefine outdoor gear together! 🔋\n👉 Check out these awesome projects that share our passion for modular and multipurpose design!\nHunt Pro: The Titanium 5-LED Mini Flashlight & Tool in One\nDiscover the Hunt Pro, the ultimate multitool flashlight designed for life's varied challenges. Compact yet mighty, this flashlight features 5 LED colors in one unit, 11 light modes, and a versatile pry-bar tail, all encased in a vibrant, durable titanium body. It's the perfect companion for your everyday adventures, ensuring you're prepared for anything, anytime.\n\nUnlock your everyday potential—CLICK HERE to grab your Hunt Pro today!\nRulaPen+: The Smarter Ruler-Pen Combo\n\nKey Features at a Glance:\n✔ Ergonomic 30° Tilt – Improved comfort and visibility.\n✔ Built-In Pen – Compatible with 30+ refills.\n✔ Dual Metric & Imperial Scales – CM and inches in one tool.\n✔ Laser-Engraved Marks – Permanent and ultra-precise.\n✔ True Zero Start – Edge-to-edge measuring for accuracy.\n✔ Durable Aluminium Build – Lightweight yet sturdy.\n✔ Available in 5 Colors – A stylish tool to match any workspace.\nCLICK HERE to unlock your early bird reward and help bring the game-changing RulaPen+ to life!",
        "url": "https://www.kickstarter.com/projects/maak/scout-battery-smart-rugged-and-modular-power/posts/4314865",
        "likes_count": 2,
        "comments_count": 0,
        "comments": []
      },
      {
        "update_number": "UPDATE #4",
        "title": "MAAK Chest Mount – Early Preview!",
        "creator": "MAAK Outdoor\nFebruary 12, 2025",
        "date": "February 12, 2025",
        "content": "Discover the MAAK Chest Mount, designed to enhance your MOLLE-mounted Phone setup!\nWe know running geospatial apps like ATAK drains your phone’s battery fast. That’s why we created the MAAK Chest Mount. Designed to work seamlessly with the Scout \nBattery and Forge Phone Case—keeping you powered and connected longer.\n🔥 Why the MAAK Chest Mount?\n✅ Modular – Use it with or without the Scout battery. Plus compatible with Scout Cable Lock & upcoming 2025 accessories.\n✅ Future-Proof – Swap phone adapters when upgrading phone. No need to replace the mount.\n✅ Rugged & Secure – Designed for high-mobility in demanding environments.\nCurrently available for: Samsung S24 (Regular, not Ultra), S23, S23TE (Regular, not Ultra), and S20FE.",
        "url": "https://www.kickstarter.com/projects/maak/scout-battery-smart-rugged-and-modular-power/posts/4311961",
        "likes_count": 4,
        "comments_count": 4,
        "comments": [
          {
            "text": "Hi Chris! It’s likely that we’ll make a Forge case for iPhones in the future, but until then, our chest mount will be able to work with a third-party case. We’ll be able to confirm specific compatibility as we finalize the details. Stay tuned for updates! Thank you and let us know if you have any other questions.",
            "commenter": "Sam Foss",
            "timestamp": "February 12, 2025 4:29 AM AWST",
            "datetime": "1739305774",
            "relative_time": "30 days ago"
          },
          {
            "text": "Any plans to expand the design for more phone models? S22 Ultra has suited my fine for years and still going strong.",
            "commenter": "Trevor Valentine",
            "timestamp": "February 12, 2025 3:05 AM AWST",
            "datetime": "1739300714",
            "relative_time": "30 days ago"
          },
          {
            "text": "Yes, we have active plans to expand compatibility beyond the listed phones. Our goal for the swappable phone adapter is to support future Forge cases for additional phone models, as well as third-party cases for phones we haven’t made a case for. Our engineers are currently determining the specifics, and we should have more information soon—though likely after the Kickstarter closes.",
            "commenter": "Sam Foss",
            "timestamp": "February 12, 2025 4:25 AM AWST",
            "datetime": "1739305546",
            "relative_time": "30 days ago"
          },
          {
            "text": "Thanks for your support! Let us know of any more questions.",
            "commenter": "Sam Foss",
            "timestamp": "February 12, 2025 4:26 AM AWST",
            "datetime": "1739305583",
            "relative_time": "30 days ago"
          }
        ]
      },
      {
        "update_number": "UPDATE #3",
        "title": "GLOW IN THE DARK is UNLOCKED 🔑",
        "creator": "MAAK Outdoor\nFebruary 6, 2025",
        "date": "February 6, 2025",
        "content": "Glow in the Dark Adventure Strap is UNLOCKED\nThank you for all amazing support!\nWe've hit our $50,000 goal and have unlocked the glow in the dark Adventure Strap. We'll reach out to all of our backers at the end of the campaign to find out what color you all want - stay tuned!",
        "url": "https://www.kickstarter.com/projects/maak/scout-battery-smart-rugged-and-modular-power/posts/4307599",
        "likes_count": 12,
        "comments_count": 4,
        "comments": [
          {
            "text": "“New Reward Tier Unlocked.” Will this be a no cost replacement for the existing strap, or an add on? If designed correctly, I can see the strap/bracket assembly as being useful item to hold other components on a tripod beyond just the battery.",
            "commenter": "California Freddy",
            "timestamp": "February 6, 2025 5:02 AM AWST",
            "datetime": "1738789347",
            "relative_time": "about 1 month ago"
          },
          {
            "text": "This is a no-cost replacement! We'll reach out at the end of the campaign to confirm your preferred strap and battery color. Great use case idea! The strap is compatible with 1.5\" diameter poles but may be short for larger tripods. The adventure clip hooks work with some aftermarket straps, like MODL straps, if you need extra length.",
            "commenter": "MAAK Outdoor",
            "timestamp": "February 6, 2025 5:46 AM AWST",
            "datetime": "1738792006",
            "relative_time": "about 1 month ago"
          },
          {
            "text": "That’s awesome, I’m really looking forward to this project. Seems like there is nothing that great that fits my use case (wilderness use, waterproof, etc.)",
            "commenter": "Tim Cole",
            "timestamp": "February 6, 2025 1:31 AM AWST",
            "datetime": "1738776689",
            "relative_time": "about 1 month ago"
          },
          {
            "text": "Glad you're excited! This is exactly why we built it. Thank you for your support!",
            "commenter": "MAAK Outdoor",
            "timestamp": "February 6, 2025 2:28 AM AWST",
            "datetime": "1738780108",
            "relative_time": "about 1 month ago"
          }
        ]
      },
      {
        "update_number": "UPDATE #2",
        "title": "Graphite Black is UNLOCKED 🔑",
        "creator": "MAAK Outdoor\nFebruary 1, 2025",
        "date": "February 1, 2025",
        "content": "🎉 Thank you for all the amazing support!\nWe're excited to announce that we've surpassed our $20,000 goal and are now 🚀 464% funded! This milestone has unlocked the Graphite Black 🖤 color for Scout.",
        "url": "https://www.kickstarter.com/projects/maak/scout-battery-smart-rugged-and-modular-power/posts/4303884",
        "likes_count": 14,
        "comments_count": 2,
        "comments": [
          {
            "text": "Hi all! We've gotten a few people reaching out asking how they can get the Graphite Black so I thought I would put here: Once the campaign closes, we will be reaching out to confirm which color you would like. On this note: We will also confirm if you got a phone case which phone, shirt sizes, all of those finer details. Thank you for the incredible support in the first 30 hours! We're blown away and excited to see MAAK out in the world.",
            "commenter": "Sam Foss",
            "timestamp": "February 1, 2025 4:05 AM AWST",
            "datetime": "1738353938",
            "relative_time": "about 1 month ago"
          },
          {
            "text": "Hi Kevin - Once the campaign closes, we will be reaching out to everyone to confirm which color you would like. Thank you for backing!!",
            "commenter": "Sam Foss",
            "timestamp": "February 1, 2025 3:46 AM AWST",
            "datetime": "1738352792",
            "relative_time": "about 1 month ago"
          }
        ]
      },
      {
        "update_number": "UPDATE #1",
        "title": "Amazing Start! We Are Fully Funded!",
        "creator": "MAAK Outdoor\nJanuary 31, 2025",
        "date": "January 31, 2025",
        "content": "🚀 Fully Funded in Less Than an Hour! 🚀\nWe did it! Thanks to your incredible support, this project reached its funding goal in record time. This proves how the Kickstarter community thrives on innovation and pushes boundaries—and we’re just getting started!\nStay tuned for stretch goals, updates, and behind-the-scenes insights. Let’s keep building together!",
        "url": "https://www.kickstarter.com/projects/maak/scout-battery-smart-rugged-and-modular-power/posts/4303124",
        "likes_count": 9,
        "comments_count": 1,
        "comments": [
          {
            "text": "Hi Ben, great question, and thank you for your support! The Forge Case is not currently available for the S24 Ultra. It is only available for the S20FE, S23/S23TE, and S24 standard models. For now, we recommend downgrading your pledge to the cable bundle. It is on our near term roadmap to have the chest mount be compatible with other rugged phone cases. If you would like, reach out to us at support@maakoutdoor.com - we would be happy to honor the 27% discount for the chest mount in a few months once we confirmed we have a good option for your phone. Again, we are very appreciative of your support!",
            "commenter": "Sam Foss",
            "timestamp": "January 31, 2025 7:11 AM AWST",
            "datetime": "1738278711",
            "relative_time": "about 1 month ago"
          }
        ]
      }
    ]
  }
}