{
  "url": "https://www.kickstarter.com/projects/240wcharger/smartersmallerfaster-all-in-one-240w-gan-charger",
  "campaign_details": {
    "funding_period_text": "Funding period\nFeb 18 2025 - Apr 13 2025 (54 days)",
    "funding_start_date": "2025-02-18T00:00:00.000000Z",
    "funding_end_date": "2025-04-13T22:24:13.523998Z",
    "funding_duration_days": 54,
    "pledged_amount": "S$ 1,031",
    "funding_goal": "S$ 344",
    "backers_count": "8",
    "days_left": 18,
    "project_launch_text": "Project launches FEBRUARY 18, 2025"
  },
  "updates": {
    "count": 1,
    "content": [
      {
        "update_number": "UPDATE #1",
        "title": "Thank You for Your Incredible Support!",
        "creator": "Yeahs\nMarch 26, 2025",
        "date": "March 26, 2025",
        "content": "Thank You for Your Incredible Support!\nDear Supporters,\nWe are beyond grateful to share that our Kickstarter project has reached its goal, and we couldn’t have done it without your amazing support!\nThis is our first time launching a direct-to-consumer project on Kickstarter, and we acknowledge that we lacked experience in marketing and promotion. Despite this, your trust and encouragement have been truly invaluable, giving us the confidence and motivation to push forward.\nAs for the product itself, we have full confidence in its quality and cutting-edge technology. Our team has carefully designed it in collaboration with a highly experienced manufacturing partner with nearly 20 years in the industry. This factory primarily serves the European and North American markets, ensuring top-tier production standards and excellent quality control.\nWith your support, we are committed to delivering the best possible product. We will keep you updated throughout the production process and ensure a smooth delivery. Please continue following our progress, and feel free to reach out with any thoughts or questions—we truly appreciate hearing from you!\nOnce again, thank you for believing in us and making this journey possible.\nWith gratitude,\nYeahscharger",
        "url": "https://www.kickstarter.com/projects/240wcharger/smartersmallerfaster-all-in-one-240w-gan-charger/posts/4346077",
        "likes_count": 1,
        "comments_count": 1,
        "comments": [
          {
            "text": "Wow! I been waiting for this! Now i have more trust in you guys. 🙏🙏🙏",
            "commenter": "Per Larsen",
            "timestamp": "March 26, 2025 2:35 PM AWST",
            "datetime": "1742970940",
            "relative_time": "about 8 hours ago"
          }
        ]
      }
    ]
  }
}