{
  "url": "https://www.kickstarter.com/projects/tomfox/spoke-touch-sensing-made-simple",
  "updates": {
    "count": 3,
    "content": [
      {
        "update_number": "UPDATE #3",
        "title": "Two events coming up",
        "creator": "Thomas Fox\nFebruary 22, 2025",
        "date": "February 22, 2025",
        "content": "Once again I wanted to start by thanking everybody for your support so far. It's incredible and I'm beyond grateful.\nI have two SPOKE related events coming up I wanted to let you know about. One Online and one in person.\nNext week I will be talking online with the wonderful folks at Musichackspace. It is Thursday at 18:00 UK time and you can get access to it here: https://musichackspace.org/product/open-source-spoke-a-new-generation-of-capacitive-touchboard-for-interactive-computer-controlling/\nNext weekend, on March 1st, I will be at the Cambridge Raspberry Jam. To celebrate the (unofficial) 13th birthday or Raspberry Pi. This CamJam is being hosted at the University of Cambridge Computer Laboratory (at the William Gates Building) with the support of Raspberry Pi. It is a ticketed event, but very very affordable! https://www.eventbrite.co.uk/e/cambridge-raspberry-jam-1st-march-2025-raspberry-pis-13th-birthday-tickets-1243972107059 \nAt both events I'll be demonstrating SPOKE, the fun things you can do with it, the potential projects that can be made with it and also show-off how easy it is to use. \nI hope to see some of you there!\nTom",
        "url": "https://www.kickstarter.com/projects/tomfox/spoke-touch-sensing-made-simple/posts/4320526",
        "likes_count": 1,
        "comments_count": 0,
        "comments": []
      },
      {
        "update_number": "UPDATE #2",
        "title": "New feature unlocked! On-board audio.",
        "creator": "Thomas Fox\nFebruary 18, 2025",
        "date": "February 18, 2025",
        "content": "We designed SPOKE around the RP2040 chip from Raspberry Pi, it's a type of chip that can do lots and lots of things. \nBecause it can do lots and lots of things, I'm still experimenting with it and finding new things that it can do. \nJust recently I worked out that it can PLAY AUDIO DIRECTLY from the board! \nThis is a pretty huge step. This allows for more designs and projects that use SPOKE that don't include a computer and cant be stand-alone devices or installations. \nIt is using pwm-audio to play mp3 files. The quality isn't as good as a full quality .wav file, but honestly, after testing it with some well mixed audio from an Om Unit sample pack, it sounded pretty decent!",
        "url": "https://www.kickstarter.com/projects/tomfox/spoke-touch-sensing-made-simple/posts/4316932",
        "likes_count": 7,
        "comments_count": 1,
        "comments": [
          {
            "text": "Awesome! Very excited to see this project.",
            "commenter": "James Patterson",
            "timestamp": "February 19, 2025 4:07 AM AWST",
            "datetime": "1739909248",
            "relative_time": "20 days ago"
          }
        ]
      },
      {
        "update_number": "UPDATE #1",
        "title": "Funded already!",
        "creator": "Thomas Fox\nFebruary 16, 2025",
        "date": "February 16, 2025",
        "content": "It has been 4 days and this project is already 100% funded! I have been blown away by the support and the encouragement from everyone who's backed this project.\nI'm really excited to get the ball rolling on the next steps, on the design tweaks needed to manufacture, the interactive website re-design, the educational resources and lesson plans and also work on video tutorials/tips. \nThank you everyone who's backed me, and this project. I am grateful and humbled.\nTom",
        "url": "https://www.kickstarter.com/projects/tomfox/spoke-touch-sensing-made-simple/posts/4315357",
        "likes_count": 7,
        "comments_count": 0,
        "comments": []
      }
    ]
  }
}