{
  "url": "https://www.kickstarter.com/projects/aohi/starship-worlds-most-powerful-10000mah-power-bank",
  "updates": {
    "count": 1,
    "content": [
      {
        "update_number": "UPDATE #1",
        "title": "100% Funded in Just 15 Minutes – Thank You!",
        "creator": "AOHi\nFebruary 20, 2025",
        "date": "February 20, 2025",
        "content": "The Future Starship Pro campaign has been fully funded in just 15 minutes! 🤯 This incredible milestone wouldn’t have been possible without you—our amazing backers. Seeing your support roll in and knowing you believe in a power bank built for the future as much as we do is truly inspiring.\nThis isn’t just about another portable charger. It’s about redefining power on the go—delivering an ultra-fast 210W charge, a massive 10,000mAh capacity, and a compact, cutting-edge design that keeps up with the most demanding users. \nFrom all of us at AOHi Team —THANK YOU for making this vision a reality. We can't wait to share more with you soon! 🚀\nProjects We Love!\nPlanck: The World’s Smallest Phone-first SSD with up to 2TB\nMeet Planck - The Most Powerful SSD for Its Size! It clicks straight onto your Phone, disappears in your palm as you record, and packs more power than you’d ever expect from a device so incredibly small!\nUp to 2TB of storage\nFast 1050 MB/s transfer speeds\nUnlocks Apple ProRes 4K 60/120 fps\nWater & Dust Resistant\nIt’s time to change the  mobile content creation game.\nGet yours now with up to 36% OFF\nLemokey L5 HE 8K: The Ultimate Magnetic Gaming Keyboard\nLemokey L5 HE 8K combines top-grade specs with brilliant design, to revolutionize your gaming experience like never before.!\nCustomizable Magnetic Switches\nFull metal body\n8000 Hz Polling Rate up to 32K Hz scan rate\n0.01mm  actuation precision,\ndynamic rapid triggering\nIt’s the best 75% keyboard for gamers—centered around speed, precision, and durability.\nGet Yours Now!\nBreak the Norm with CIGA Design Z Series Hunter: The Future of Mechanical Watchmaking\nThe Z Series Hunter redefines the tonneau-shaped watch with cutting-edge design and precision engineering. Crafted by CIGA Design, an award-winning brand recognized for revolutionizing mechanical artistry, this timepiece is built for those who embrace ambition, adventure, and individuality.\nSkeletonized Automatic Movement – Powered by the CD-07 caliber, revealing intricate craftsmanship with a futuristic anchor-shaped rotor.\nThree-Layered Tonneau Case – A sleek, lightweight redesign featuring 316L stainless steel with DLC coating for superior durability and scratch resistance.\nSapphire Crystal Protection – Ensures lasting clarity and resistance to everyday wear.\nErgonomic Stainless Steel Bracelet – A tapered H-Link design with a hidden clasp for a seamless and comfortable fit.\nPrecision & Performance – 28,800 VPH movement frequency, 24-jewel mechanism, and a 40-hour power reserve for long-lasting accuracy.\nDesigned for pioneers who chase the extraordinary, the Z Series Hunter is more than a watch—it’s a statement of innovation and bold craftsmanship. \nGet yours today!",
        "url": "https://www.kickstarter.com/projects/aohi/starship-worlds-most-powerful-10000mah-power-bank/posts/4317829",
        "likes_count": 5,
        "comments_count": 0,
        "comments": []
      }
    ]
  }
}