{
  "url": "https://www.kickstarter.com/projects/sterilpure/sterilpure-portable-multifunctional-ultrasonic-dishwasher",
  "campaign_details": {
    "funding_start_date": "2025-02-13T00:00:00.000000Z",
    "pledged_amount": "S$ 236,419",
    "funding_goal": "S$ 6,701",
    "backers_count": "759",
    "days_left": 22,
    "project_launch_text": "Project launches FEBRUARY 13, 2025"
  },
  "updates": {
    "count": 4,
    "content": [
      {
        "update_number": "UPDATE #4",
        "title": "Last Chance: SterilPure’s Super Early Bird Offer Ends Soon!",
        "creator": "SterilPure\nMarch 23, 2025",
        "date": "March 23, 2025",
        "content": "🚨 Final Reminder! 🚨\nSterilPure's super early bird offer ends in less than 72 hours!  \nThis is your LAST chance to secure our revolutionary product at the unbeatable price of just $199—an exclusive deal designed to reward our early supporters. After this limited-time offer, the price will increase to $229 during the late pledge stage, and it won’t stop there! Once we launch on our upcoming website, the price will rise even further.  \nDon’t miss out on this opportunity to upgrade your lifestyle with a product that combines innovation, practicality, and affordability. Act now and join thousands of others who have already made the smart choice!",
        "url": "https://www.kickstarter.com/projects/sterilpure/sterilpure-portable-multifunctional-ultrasonic-dishwasher/posts/4343422",
        "likes_count": 3,
        "comments_count": 0,
        "comments": []
      },
      {
        "update_number": "UPDATE #3",
        "title": "Final Days to Back SterilPure on Kickstarter!",
        "creator": "SterilPure\nMarch 21, 2025",
        "date": "March 21, 2025",
        "content": "Hey SterilPure Backers,\nThe final countdown has begun—just 3 days remain before our Kickstarter campaign wraps up! Don’t miss your chance to secure SterilPure at an exclusive, unbeatable Kickstarter price.\nThinking about joining us? There’s no better time than now! Act fast—this special pricing won’t be available again.\nBy backing us today, you’re not only getting an innovative product but also supporting the future of smarter cleaning solutions and healthier living.\n\n✨ New Review Alert!\nTechLine just released an incredible review after testing our product! \nDiscover why they call SterilPure a cost-effective, space-saving solution for households—check it out here! 👇\nLet’s make this final days a big one. Thank you for being part of the SterilPure journey! 💼✨\nWarm regards,\nThe SterilPure Team",
        "url": "https://www.kickstarter.com/projects/sterilpure/sterilpure-portable-multifunctional-ultrasonic-dishwasher/posts/4342616",
        "likes_count": 3,
        "comments_count": 0,
        "comments": []
      },
      {
        "update_number": "UPDATE #2",
        "title": "Just 2 weeks to go! SterilPure is all set to ramp up for mass production!",
        "creator": "SterilPure\nMarch 11, 2025",
        "date": "March 11, 2025",
        "content": "Hey there,\nJust 2 weeks left to snag our best offer on Kickstarter! Thanks to your incredible support, we've surpassed an astonishing 3,295% of our funding goal!\nIf you’ve been following us on social media, you might already know that SterilPure has officially entered mass production. This critical phase involves our factory utilizing advanced molds to manufacture SterilPure components on a large scale, ensuring exceptional quality for every single product.Previously, we used 3D printing to create prototype covers, which, as some of you may have noticed in our content creator's videos, sometimes had visible scratches. With mass production, those imperfections are a thing of the past. The advanced molds deliver a flawless finish, ensuring that every SterilPure product meets the highest standards.\nWe’re thrilled to share a sneak peek of our production mold.\nAnd here are some questions from our recently pledged customers. Take a look to learn more about the product you're about to receive!\nShould you have any questions or encounter any issues, please don’t hesitate to reach out to us directly at hello@sterilpure.com  or via Kickstarter messages. We’re here to assist you and ensure you get the best experience while supporting our project.   \nOnly 2 weeks left! Share SterilPure with your friends and family before our best offer ends!\nWarm regards,  \nThe SterilPure Team  \n----------\nZERA Sonic-X | The Powerful Portable Flosser\nPowerful Impulse Motor | 3 Intelligent Modes | Easily Swap Nozzles | Long Running Time | Compact Size and Weight | IPX7 Waterproof\nIntroducing ZERA Sonic X- The Powerful Portable Flosser. Our dental scalers combine powerful cleaning power with delicate design to provide users with a superior oral care experience.The lightweight design makes it easy to operate. Whether at home or traveling, you can enjoy professional-grade teeth cleaning results anytime and anywhere. Choose our dental cleaner and let health and beauty go hand in hand!\nClick Here to Pledge Now!\n⁣⁣⁣⁣ ⁣⁣⁣⁣ ⁣⁣⁣⁣ \nSweetieFlake: The Ultimate Fully-Automatic Shaved Ice Maker\nMultiple Ice Styles | 10-Speed Blades | 5L Water Tank | 60s Ice Making | Easy to Use & Clean\nSweetieFlake transforms water into delicate, fluffy shaved ice in just 60 seconds—no prep needed. Powered by a 360-watt compressor and adjustable motor speeds, it lets you customize the ice texture. With a 5-liter tank, it serves up to 10 portions at once, perfect for gatherings. Easy to use with a magnetic panel and dishwasher-safe drip tray.\nGet 37% OFF Now!",
        "url": "https://www.kickstarter.com/projects/sterilpure/sterilpure-portable-multifunctional-ultrasonic-dishwasher/posts/4334452",
        "likes_count": 1,
        "comments_count": 2,
        "comments": [
          {
            "text": "Do the ultrasonic vibrations have any negative effect on cast iron cookware? Will it damage seasoning?",
            "commenter": "Jon Xuereb",
            "timestamp": "March 12, 2025 12:07 AM AWST",
            "datetime": "1741709265",
            "relative_time": "13 days ago"
          },
          {
            "text": "Hello Sir, ultrasonic cleaning with SterilPure's power and settings will not damage cast iron cookware or its seasoning. Cast iron is incredibly durable, and the polymerized oil on its surface adheres strongly when properly maintained. SterilPure's ultrasonic cleaning is far gentler than abrasive scrubbing or harsh chemicals, ensuring your cookware remains in good condition.",
            "commenter": "SterilPure",
            "timestamp": "March 12, 2025 3:43 PM AWST",
            "datetime": "1741765413",
            "relative_time": "12 days ago"
          }
        ]
      },
      {
        "update_number": "UPDATE #1",
        "title": "392% funded in 24 hours! We did it! 🎉",
        "creator": "SterilPure\nFebruary 14, 2025",
        "date": "February 14, 2025",
        "content": "Hey there,\nWe are thrilled to share an incredible news—thanks to your amazing support, we’ve achieved 392% of our funding goal in just 24 hours! 🎉🎉🎉\nThis overwhelming response has exceeded all our expectations and is a testament to the passion and belief you have in our project. \nYour support has not only enabled us to achieve our goal but has also paved the way for us to broaden our vision of creating a simple, convenient, and enjoyable cleaning experience with advanced technology🧼🧼🧼 while delivering even greater value. Thank you for being a vital part of this journey!\nLatest Updates:\n\n✨ New Review Alert!\nWe’ve received another glowing review from Alderand Jade, who had the chance to test our product. Don’t miss their thoughts—check it out here! 👇\n✨ New Section “Explore our factory” Added!\n\nWe understand that some users may have concerns about delivery reliability, especially due to past instances where other ultrasonic products on Kickstarter fell short of expectations. While such cases have understandably affected trust within the community, we want to reassure our backers about SterilPure. \nThat’s why we’ve added a new section to our campaign page called “Explore Our Factory.” If you haven’t checked it out yet, we encourage you to take a look!\nExplore our factory showroom, featuring a wide range of commercial-grade cleaning machines crafted on-site. The video concludes with an exclusive highlight of the SterilPure home dishwasher.\nSterilPure's factory has extensive expertise in manufacturing commercial ultrasonic cleaners, with commercial ultrasonic cleaners products consistently in production and sales. This enables the factory to easily scale up capacity to meet SterilPure's demands, alleviating consumer concerns about delivery capabilities.\nThis video showcases SterilPure's production factory, highlighting its rich history and advanced technological expertise. SterilPure is manufactured in a world-class facility with extensive experience in producing commercial-grade ultrasonic cleaners. This ensures that when developing a household ultrasonic dishwasher, the factory can guarantee both quality and safety without compromise.\nThank you once again for your incredible support!  \nAlthough we’ve reached this incredible milestone, our journey is just beginning. If our vision of transforming cleaning into a simple, convenient, and enjoyable experience resonates with you🧼🧼🧼, we’d be thrilled if you shared SterilPure with your friends, family, and loved ones.\nShould you have any questions or encounter any issues, please don’t hesitate to reach out to us directly at hello@sterilpure.com  or via Kickstarter messages. We’re here to assist you and ensure you get the best experience while supporting our project.  \nLet’s keep the momentum going strong!  \nWarm regards,  \nThe SterilPure Team",
        "url": "https://www.kickstarter.com/projects/sterilpure/sterilpure-portable-multifunctional-ultrasonic-dishwasher/posts/4313642",
        "likes_count": 3,
        "comments_count": 0,
        "comments": []
      }
    ]
  }
}