{
  "url": "https://www.kickstarter.com/projects/majmohsin/super-tiny-rp2040-esp32-display-development-board",
  "campaign_details": {
    "funding_period_text": "Funding period\nFeb 14 2025 - Mar 16 2025 (30 days)",
    "funding_start_date": "2025-02-14T08:08:21-05:00",
    "funding_end_date": "2025-03-16T08:08:21-04:00",
    "funding_duration_days": 30,
    "pledged_amount": "£13,305",
    "funding_goal": "£1,000",
    "backers_count": "190",
    "days_left": 22
  },
  "updates": {
    "count": 2,
    "content": [
      {
        "update_number": "UPDATE #2",
        "title": "Thank You for Your Support - Super Tiny RP2040/ESP32 Display Board",
        "creator": "Majeed Mohsin\nMarch 17, 2025",
        "date": "March 17, 2025",
        "content": "Dear Backers,\nWe are incredibly grateful for your amazing support in bringing the Super Tiny RP2040/ESP32 Display Development Board to life! Thanks to your enthusiasm and belief in this project, we successfully reached our funding goal.\nIf you missed out on the campaign or know someone who still wants to grab this versatile and compact display board, we have good news! The Super Tiny RP2040/ESP32 Display Development Board is now available for Late Pledge. This is your opportunity to secure the board and experience its powerful capabilities firsthand.\n🔗 Late Pledge Here\nWe truly appreciate your support and can't wait to see the innovative projects you create using the Super Tiny RP2040/ESP32 Display Board. Stay tuned for updates as we move forward with production and shipping.\nIf you have any questions or need assistance, feel free to reach out.\nThanks\nMajeed Mohsin",
        "url": "https://www.kickstarter.com/projects/majmohsin/super-tiny-rp2040-esp32-display-development-board/posts/4338698",
        "likes_count": 2,
        "comments_count": 1,
        "comments": [
          {
            "text": "Congrats on completing the first phase of the campaign 🎉",
            "commenter": "Zzz",
            "timestamp": "March 17, 2025 2:29 PM AWST",
            "datetime": "1742192960",
            "relative_time": "7 days ago"
          }
        ]
      },
      {
        "update_number": "UPDATE #1",
        "title": "🚀 Fully Funded in Just a Few Hours! THANK YOU! 🙌",
        "creator": "Majeed Mohsin\nFebruary 17, 2025",
        "date": "February 17, 2025",
        "content": "Dear Backers,\nWe are beyond thrilled to announce that our Super Tiny RP2040/ESP32 Display Development Board has been successfully funded in just a few hours! 🎉 This incredible milestone wouldn’t have been possible without your support, and we are truly grateful for each and every one of you.\nYour enthusiasm for this project fuels our passion, and we can’t wait to bring this compact, feature-packed development board to life. Now, let’s take this campaign to the next level!\nHelp Us Spread the Word! 📢\nWe’d love your help in reaching more makers, developers, and electronics enthusiasts who would benefit from this board. If you haven’t already, please share the campaign on your social media and with your communities.\nDrop your social media links in the comments! We’d love to follow, engage, and share your posts about the campaign. Let's build a strong community around this project!\n🔗 Kickstarter Campaign: Super Tiny RP2040/ESP32 Display Development Board\nOnce again, thank you for believing in this project! We’ll keep you updated as we progress. Stay tuned for more exciting developments! 🚀\nBest,\nMajeed Mohsin",
        "url": "https://www.kickstarter.com/projects/majmohsin/super-tiny-rp2040-esp32-display-development-board/posts/4315993",
        "likes_count": 2,
        "comments_count": 0,
        "comments": []
      }
    ]
  }
}