{
  "url": "https://www.kickstarter.com/projects/bedtimecompany/tape-the-pocket-audio-sketchbook",
  "campaign_details": {
    "funding_period_text": "Funding period\nDec 7 2024 - Jan 11 2025 (35 days)",
    "funding_start_date": "2024-12-06T16:13:52-05:00",
    "funding_end_date": "2025-01-10T16:13:52-05:00",
    "funding_duration_days": 35,
    "pledged_amount": "$111,383",
    "funding_goal": "$50,000",
    "backers_count": "253"
  },
  "updates": {
    "count": 3,
    "content": [
      {
        "update_number": "UPDATE #3",
        "title": "Finish of the campaign! 🏁",
        "creator": "bedtime company\nJanuary 11, 2025",
        "date": "January 11, 2025",
        "content": "As is often said in moments like this, the finish is really just the start. And we say that not to be trivial as hell, but we’d like to pause and treat this as the finish for a moment, reflecting on the campaign: what we expected, how it unfolded, and everything we accomplished this month.\nFirst of all, we prepared for this campaign for an incredible amount of time. A week before launch, we completely rewrote the text, prepared all the pictures, doublechecked everything, and then checked it all again as many times as we could. You can’t imagine how nerdy we can be about this stuff — and we both love and hate that about ourselves at the same time.\nTwo weeks before the release, we started shooting this video:\nWe hoped it would come together in a take or two, but in reality, it took nearly two weeks of daily shooting and endless effort to piece it together.\nIt used to be proper working space\nPreparation for this video began way back in the summer. Look at this rig we \"invented\" to shoot it!\nTo be completely honest, when the campaign launched, we were shocked to see the goal reached in under two hours. Yes, it’s not unheard of for Kickstarter campaigns, but we’re just two guys with no ad budget or media coverage. All we had at the start was 1,500 Instagram followers and 200 YouTube subscribers. Huge thanks to everyone who posted about us, liked, and shared—it made all the difference.\nAfter the initial feedback, we realized we wanted to implement MIDI functionality immediately to showcase its potential. So, mid-campaign, we switched gears back into engineering mode and made it happen.\nDuring the campaign, it was crucial for us to stay online and accessible for people across the globe. We kept in constant communication with you, answering emails, direct messages, and comments. It’s been amazing to connect with so many wonderful people who reached out to support us.\nOf course, we also received our fair share of negative feedback. Some folks complained about the price being too high, and we tried to explain the realities of low-volume production. Others didn’t fully get the idea—and that’s totally fine. We didn’t create this to please everyone on the planet; we built it to bring our vision of a specific workflow to life.\nWe also had plenty of heated discussions between ourselves, which were necessary and productive.\nEnough looking back — let’s talk about the future!\nToday, we’ll rest. But starting tomorrow, we’ll dive headfirst into logistics, sourcing, and tackling all the engineering hurdles ahead. This is the part we love the most. Don’t get us wrong—it’s been fantastic chatting with all of you and hearing your thoughts, and you’re always welcome to reach out with questions. But there’s something deeply satisfying about shifting focus from worrying about the campaign every minute to working on production and meeting deadlines. It’s hard to put into words.\nThank you for this incredible ride. Stay safe. If you’ve backed us, don’t forget to check your emails. If not, we hope to intrigue you further—let’s stay in touch!\nPeace and love,\nIgor and Kirill from Bedtime \n🌑",
        "url": "https://www.kickstarter.com/projects/bedtimecompany/tape-the-pocket-audio-sketchbook/posts/4290075",
        "likes_count": 25,
        "comments_count": 3,
        "comments": [
          {
            "text": "Congrats on the successful Kickstarter! I'm not exactly sure how I'll use this yet, but I will say that the MIDI feature is what pushed me over the edge to back the campaign. I've got a programmable MIDI pedalboard that I use for my FX pedal, and should be able to also hook into this for basic looping controls. Looking forward to seeing more videos of how to use it for different use cases, and very excited to get my hands on it when it's ready.",
            "commenter": "John F.",
            "timestamp": "January 17, 2025 2:25 AM AWST",
            "datetime": "1737051952",
            "relative_time": "about 2 months ago"
          },
          {
            "text": "I loved my OP-1's workflow...it was the aspect of the 4-track tape that I missed most when I sold it but couldn't justify the cost to bring it back into my rig. I hoped a product like this would come to market as I couldn't engineer it myself and Norns was something I just didn't want to deal with. I couldn't have imagined this any more perfect than you two have. Thank you!",
            "commenter": "Robert",
            "timestamp": "January 11, 2025 5:20 AM AWST",
            "datetime": "1736544032",
            "relative_time": "2 months ago"
          },
          {
            "text": "Thank you, Robert!",
            "commenter": "bedtime company",
            "timestamp": "January 11, 2025 5:32 AM AWST",
            "datetime": "1736544730",
            "relative_time": "2 months ago"
          }
        ]
      },
      {
        "update_number": "UPDATE #2",
        "title": "48 Hours to go!",
        "creator": "bedtime company\nJanuary 9, 2025",
        "date": "January 9, 2025",
        "content": "The finish line can be seen by naked eye 🤩, but there is still plenty of time to join the campaign!\nIt is safe to say the campaign has been a success. We’ve reached 200% of our funding goal — more than enough to start production while still giving us the ability to pay attention to each unit we produce.\nThis success is entirely thanks to you: our supporters, sharers of our vision, longtime followers, and newcomers. We are deeply grateful to have such a warm and diverse community. Truly, it’s an honor (っ ᵔ◡ᵔ)っ\nSpecial thanks to everyone who asked questions and showed interest. We know that not everyone was able to support us during the campaign due to the limited reward options. That’s why we’ve decided to introduce a 🦉Late Bird Reward Tier!\nFor $20, you can register your interest and receive a $20 discount coupon for a future purchase. This will help us estimate production volume and reduce the waiting period for next batch of tapes!\nYou will receive a unique code via email after the end of the campaign.\n🏷 How does it work?\nOnce we’ve ship all campaign units, we will reopen preorders. You will be able to use your $20 coupon towards your purchase at that time.\nDo not forget to subscribe to our Instagram and mailing list to stay updated. More exciting products are on the way, and the story of tape! is far from over!\nStay tuned!\n🌑",
        "url": "https://www.kickstarter.com/projects/bedtimecompany/tape-the-pocket-audio-sketchbook/posts/4288695",
        "likes_count": 12,
        "comments_count": 0,
        "comments": []
      },
      {
        "update_number": "UPDATE #1",
        "title": "🎄 Merry Christmas! An Important Update",
        "creator": "IgorCollaborator\nDecember 25, 2024",
        "date": "December 25, 2024",
        "content": "Hi there! We hope you’re having a wonderful holiday season, spending time with friends and family. We’ve been hard at work lately and have an exciting new feature showcase to share with you.\n200 tape! units\nFirst things first. The campaign has been running for two weeks now, and we’ve raised almost 200% of our goal! From the beginning, we didn’t set an artificially low target to achieve the \"10,000% funded\" milestone - it’s a fun number indeed, but we’re not into those kinds of tricks. Our goal was clear: create 100 devices and move forward.\nHowever, increasing the level of production would help us to cut some of the components costs, so we could invest more resources into developing features you (and we🤩) want, without raising final price!\nLet’s make that happen! We are excited to introduce a stretch goal, and you’ll love it!\nBut before we dive into that, let’s get back to the showcase. Over the past weeks, we’ve been exploring various MIDI use cases, as robust and comprehensive MIDI implementation is a very important aspect of any musical gear. And we have to admit - it’s a game-changer.\nWhile tape! remains a portable device you can take anywhere, MIDI integration now makes deeper connections with your studio setup and live rig possible.\n🎹 <- -> 📼\nSimply connect your tape! to your computer or any MIDI host, and you can control its parameters, set speed, start and stop tapeheads, synchronize loops with external sources, modulate it using Max/MSP or Pure Data, control tape! from your modular setup with a CV to MIDI converter and so on and so on. Possibilities are virtually endless. tape! is ready to support MIDI 2.0 and MPE.\nHere’s a list of devices that can act as a MIDI host for tape! to name a few:\nAny PC (Mac, Raspberry Pi, etc.)\nNorns\nOrganelle\nOP-1 Field, OP-Z\nPush 3\nSquarp Hermod\nKenton USB MIDI Host\nAnd many more!\nCheck out our showcase video here:\nNow, onto the stretch goal!\nCurrently, tape! cannot act as a MIDI host. It is a hardware limitation. So, we are setting a midi host stretch goal -  $200k. If we reach it, hardware and software will receive an upgrade to support it. \nBeing a MIDI host adds a lot of new responsibilities to the device - from providing power over the USB cable when the connected device requires it, to dynamical parameters mapping - to support numerous amount of various midi controllers, available today. Just to scratch the surface.\nImplementing this will require complex hardware upgrade and a lots of work on the software side as well.\nActually 🤓 MIDI host depends on USB host. Adding it would also open up various possibilities for connecting other external gear, yet we still gotta research that more closely! \nAs a bonus, we’ll also introduce a granular engine for tape!, expanding its sonic capabilities even further.\nIf you’re curious about devices that can act as MIDI hosts, this article is a great source of inspiration.\nThank you for your continued support, and let’s make tape! even better together! \nMerry Christmas! \n🌑",
        "url": "https://www.kickstarter.com/projects/bedtimecompany/tape-the-pocket-audio-sketchbook/posts/4281207",
        "likes_count": 18,
        "comments_count": 2,
        "comments": [
          {
            "text": "It would be great if you can connect to a midi keyboard and use it as essentially a custom mellotron like you showed in the video. I really hope it can do this. Then you can use it as an instrument as well as a recorder",
            "commenter": "Mark Cofer",
            "timestamp": "January 9, 2025 11:18 PM AWST",
            "datetime": "1736435882",
            "relative_time": "2 months ago"
          },
          {
            "text": "Thanks! Yes, it is already there since we have shown it. It is still a bit rough, but we will polish it and include it in the final release.",
            "commenter": "bedtime company",
            "timestamp": "January 10, 2025 12:03 AM AWST",
            "datetime": "1736438615",
            "relative_time": "2 months ago"
          }
        ]
      }
    ]
  }
}