{
  "url": "https://www.kickstarter.com/projects/tapptec/tapptec",
  "campaign_details": {
    "funding_period_text": "Funding period\nJan 7 2025 - Feb 26 2025 (50 days)",
    "funding_start_date": "2025-01-07T08:50:26-05:00",
    "funding_end_date": "2025-02-26T08:50:26-05:00",
    "funding_duration_days": 50,
    "pledged_amount": "",
    "funding_goal": "$5,000",
    "backers_count": "505"
  },
  "updates": {
    "count": 1,
    "content": [
      {
        "update_number": "UPDATE #1",
        "title": "🎉 We’ve Reached Our Goal! 🎉",
        "creator": "TappTec\nJanuary 23, 2025",
        "date": "January 23, 2025",
        "content": "Dear Backers,\nWe are thrilled to announce that thanks to your incredible support, TappTec has successfully reached our Kickstarter goal! 🙌 We couldn't have done it without each and every one of you. Your enthusiasm, feedback, and commitment have made this journey possible, and we’re excited to continue moving forward together!\nWe’re now even more motivated to bring you the best possible product. As we work toward fulfilling our promises and delivering TappTec, we’d love to hear from you!\n💬 We invite you to share in the comments:\nWhat do you love most about TappTec so far?\nDo you have any suggestions or ideas to make it even better?\nYour feedback means the world to us, and we’re always looking for ways to improve and exceed your expectations.\nThank you once again for being part of this incredible adventure. We can't wait to share more updates with you soon!\nBest,\nThe TappTec Team",
        "url": "https://www.kickstarter.com/projects/tapptec/tapptec/posts/4290259",
        "likes_count": 7,
        "comments_count": 3,
        "comments": [
          {
            "text": "I love that Tapptec combines 5+ tools into 1 & has the following features: detects hidden wires & pipes, smart tape measure (esp. 1 click saving of incremental measurements), OLED dual displays, laser assisted leveling & precise measurements, dual headed laser projections, digital angle guage, quick area & volume calculations, & effortless switch b/w units/unit convertions.",
            "commenter": "Catherine A Patterson",
            "timestamp": "March 3, 2025 7:45 AM AWST",
            "datetime": "1740959137",
            "relative_time": "11 days ago"
          },
          {
            "text": "Regarding the product introduction, TappTec is powerful enough to cover all of my needs during daily work on construction sites. I would like to focus more on understanding its software solution behavior. If you could take a look at the app called \"magicplan\": https://www.magicplan.app/, you notice that they are offering the measurement and documents management features via LIDAR camera and smart phone/pad HW, which helps me a lot, if TappTec can be integrated into the app, it will be awesome. What's more I am also seeking for some cheap tool which can support on-site layout feature i.e. Leica ICON ics20/ics50, Trimble Ri and other total station could offer. maybe that could be the direction for your next step. thanks.",
            "commenter": "dingbob",
            "timestamp": "January 27, 2025 10:39 AM AWST",
            "datetime": "1737945586",
            "relative_time": "about 2 months ago"
          },
          {
            "text": "I’m so excited for this product!!",
            "commenter": "David Jelks",
            "timestamp": "January 23, 2025 10:26 AM AWST",
            "datetime": "1737599178",
            "relative_time": "about 2 months ago"
          }
        ]
      }
    ]
  }
}