{
  "url": "https://www.kickstarter.com/projects/rythmagica/tdc17-affordable-innovative-arcade-size-taiko-drum",
  "campaign_details": {
    "funding_period_text": "Funding period\nJan 17 2025 - Feb 16 2025 (30 days)",
    "funding_start_date": "2025-01-17T10:17:13-05:00",
    "funding_end_date": "2025-02-16T10:17:13-05:00",
    "funding_duration_days": 30,
    "pledged_amount": "S$ 43,513",
    "funding_goal": "S$ 3,000",
    "backers_count": "88"
  },
  "updates": {
    "count": 2,
    "content": [
      {
        "update_number": "UPDATE #2",
        "title": "TDC17 Production & Shipping Update, Mar 3.",
        "creator": "Rythmagica Team\nMarch 3, 2025",
        "date": "March 3, 2025",
        "content": "Dear TDC17 Supporters,\nWe’re excited to share the latest TDC17 production update with you! Everything is progressing according to schedule, and we appreciate your patience and support. Here’s where things stand:\n1️⃣ Production on Track – This week, we will complete the final assembly of the TDC17 and begin quality control checks. The packaging boxes are currently in production and are expected to be completed and delivered next week.\n2️⃣ New Drumsticks in Development – The F5 drumsticks, designed specifically for the TDC17, are in production. We’ve also designed two additional models, F3 and F8, all 37cm in length. Since each requires its own mold, adjustments have taken longer than expected. Additionally, the current production yield needs improvement. While this has caused some delays in this part of production, it does not impact the overall timeline.\n3️⃣ Shipping Schedule – We are still on track for the first batch of TDC17 shipments to begin on March 15 as planned.\nThank you again for your patience and support! We’ll continue to keep you updated as we move closer to shipping. If you have any questions, feel free to reach out.\nBest,\nrythmagica team",
        "url": "https://www.kickstarter.com/projects/rythmagica/tdc17-affordable-innovative-arcade-size-taiko-drum/posts/4327649",
        "likes_count": 7,
        "comments_count": 0,
        "comments": []
      },
      {
        "update_number": "UPDATE #1",
        "title": "🎉 TDC17 Crowdfunding Successfully Completed – Thank You!",
        "creator": "Rythmagica Team\nFebruary 16, 2025",
        "date": "February 16, 2025",
        "content": "Dear TDC17 Supporters,\nWe are beyond thrilled to announce that the TDC17 crowdfunding campaign has been a huge success!  Our initial goal was 3,000 SGD, but thanks to your incredible support, we reached an amazing 43,000 SGD! This wouldn’t have been possible without each and every one of you—thank you from the bottom of our hearts!\nFrom the very beginning of the campaign, we simultaneously started production to ensure a smooth delivery process. We’re happy to report that all production stages are progressing as planned, and the first batch of TDC17 units is expected to ship by mid-March.\nWe’ll continue to provide updates on the production progress, and of course, if you have any questions or would like to reach out, feel free to contact us anytime!\nYour support means everything to us, and we can’t wait for you to experience the TDC17! 🥁\nBest regards,\nRythmagica Team",
        "url": "https://www.kickstarter.com/projects/rythmagica/tdc17-affordable-innovative-arcade-size-taiko-drum/posts/4315628",
        "likes_count": 13,
        "comments_count": 1,
        "comments": [
          {
            "text": "Looking forward!!",
            "commenter": "Edgar Lim",
            "timestamp": "February 17, 2025 12:08 AM AWST",
            "datetime": "1739722136",
            "relative_time": "25 days ago"
          }
        ]
      }
    ]
  }
}