{
  "url": "https://www.kickstarter.com/projects/thethinningveil/the-undead-geistbound-battalions-stl-collection",
  "campaign_details": {
    "funding_start_date": "2025-03-06T00:00:00.000000Z",
    "pledged_amount": "S$ 1,288",
    "funding_goal": "S$ 1,036",
    "backers_count": "10",
    "days_left": 47,
    "project_launch_text": "Project launches MARCH 6, 2025"
  },
  "updates": {
    "count": 8,
    "content": [
      {
        "update_number": "UPDATE #8",
        "title": "Danse Macabre Geistbound Battalion Special Offer!",
        "creator": "Triskelion Games Ltd\nMarch 20, 2025",
        "date": "March 20, 2025",
        "content": "Hail Heroes!\nLife is a learning curve! We appreciate the support from our backers and Kickstarter, and upon review have decided to add a special offer for the last week of the campaign.\nThe Danse Macabre has a new Special Offer Tier! \nThe first 100 backers to take advantage of it will get the Danse Macabre Geistbound Battlalion pledge, for Personal Use at £35.\nWe hope that encourages some more support and gets some Stretch Goals unlocked! \nOnce again thank you, and we look forward to sending you the links for your STLs!\nUntil next time, Heroes!\nBlessed Be\nThe Triskelion Games Team",
        "url": "https://www.kickstarter.com/projects/thethinningveil/the-undead-geistbound-battalions-stl-collection/posts/4341245",
        "likes_count": 0,
        "comments_count": 0,
        "comments": []
      },
      {
        "update_number": "UPDATE #7",
        "title": "Having a good weekend? Check out this physical print!",
        "creator": "Triskelion Games Ltd\nMarch 17, 2025",
        "date": "March 17, 2025",
        "content": "Hail Heroes\nWe hope you are all having a great weekend! We certainly are! Here is a physical print of the Bone Giant, the Celtic version from the Add-ons. We think our sculptor and artist did a great job together on this, and the rest of the collection, don't you?\nThe Ghoul print in the shot is for size comparison only, and that Ghoul is a 40mm scale miniature. \nThe Bone Giant is a 2 part print, and stands at an impressive height! 150mm base to top of the head, it is approx 180mm in height total.\nThe Bone Giant should be a marvellous miniature to paint up, which is something Paul will be doing in his free time over the next few days, so we can show you that in the coming week. \nEnjoy the rest of your weekend, and we'll be back with more news and updates in the week! Stay classy!\nUntil next time Heroes!\nBlessed Be\nThe Triskelion Games Team",
        "url": "https://www.kickstarter.com/projects/thethinningveil/the-undead-geistbound-battalions-stl-collection/posts/4338372",
        "likes_count": 0,
        "comments_count": 0,
        "comments": []
      },
      {
        "update_number": "UPDATE #6",
        "title": "TikTok & Tick-Tock! We have 10 days to go! Join us!",
        "creator": "Triskelion Games Ltd\nMarch 16, 2025",
        "date": "March 16, 2025",
        "content": "Hail Heroes!\nWe've refreshed the look of the page and helped to clarify a few points, and show the sculpts off in a way we think surpasses our original attempt! Regale yourselves!\nIn the meantime, we are now on TikTok and would love you to check us out and follow us there!\nhttps://www.tiktok.com/@triskelion.games/video/7482135339813915926?is_from_webapp=1&sender_device=pc&web_id=7482131013689083415\nOn YouTube the same video can be viewed here:\n\n\nOn the campaign page you'll see a little animation of the Bone Giant stood next to a regular Geistbound! You'll see how big that sculpt really is! With 10 days to go we're on the clock, but we're confident we'll open the Charnel Gate, but it is only possible with your help! Take another look at the page and join the march!\n\nUntil next time Heroes!\nBlessed Be\nThe Triskelion Games Team",
        "url": "https://www.kickstarter.com/projects/thethinningveil/the-undead-geistbound-battalions-stl-collection/posts/4337397",
        "likes_count": 0,
        "comments_count": 0,
        "comments": []
      },
      {
        "update_number": "UPDATE #5",
        "title": "Danse Macabre Geistbound Battalions & Stretch Goal Rewards!",
        "creator": "Triskelion Games Ltd\nMarch 14, 2025",
        "date": "March 14, 2025",
        "content": "",
        "url": "https://www.kickstarter.com/projects/thethinningveil/the-undead-geistbound-battalions-stl-collection/posts/4336566",
        "likes_count": 0,
        "comments_count": 0,
        "comments": []
      },
      {
        "update_number": "UPDATE #4",
        "title": "The Khemite Bone Giant & the Charnel Gate",
        "creator": "Triskelion Games Ltd\nMarch 13, 2025",
        "date": "March 13, 2025",
        "content": "Hail Heroes!\nThe £1000 threshold is what opens our first Stretch Goal, and when we cross it everyone who backs the Battalion gets a Charnel Gate STL (WIP) added to their pledge, be that pledge licenced or unlicenced. Obviously if you back for the commercial licence, that licence will extend to the Stretch Goals.\nThe Charnel Gates stand dormant, scattered across the lands. Some of them dominate plazas in important cities, or appear at temple sites or shrines, while others lay in hidden valleys and sunken tombs, away from mortal eyes. Now the Charnel Gates are perilously close to becoming active, opening for the first time in a millennia and what might come through these gigantic constructs to swell the ranks of the Geistbound Battalions? Who can say?\nWe have boosted the value of the Battalion by offering a Khemite Bone Giant to every Battalion pledge, licenced or unlicenced. This towering monster can be bought on its own as an add-on if you don't fancy the Battalion but would like the Giant! This now joins the Celtic Bone Giant already unveiled.\nShare news of the project and tell your friends about it, and we're sure to see more and more emerge from the Charnel Gate once it is open! More Stretch Goals will be announced. The Charnel Gate will stand an impressive 160mm tall, and 120mm wide, so even a Bone Giant might stoop to emerge through it from the Land of the Dead!\nUntil next time, Heroes!\nBlessed Be\nThe Triskelion Games Team",
        "url": "https://www.kickstarter.com/projects/thethinningveil/the-undead-geistbound-battalions-stl-collection/posts/4335656",
        "likes_count": 0,
        "comments_count": 0,
        "comments": []
      },
      {
        "update_number": "UPDATE #3",
        "title": "Geistbound Battalions funds & the Bone Giant Add-on is here!",
        "creator": "Triskelion Games Ltd\nMarch 11, 2025",
        "date": "March 11, 2025",
        "content": "Hail Heroes!\nAs you may know we have now funded (see Update 2) and we are so thrilled at this! To celebrate we announced the Geistbound Arch-Militants will be our Stretch Goals, provided we can, together, reach headier heights! \nPlease do share news of the campaign about your socials, reddit, facebook and discord groups! We're a small team and our reach is not extensive! But together we are legion!\nWe wanted to do something special in recognition of the milestone of funding this Kickstarter. So we have chosen to unveil the 150mm tall Bone Giant, as an add-on, both for private use and as a commercial lincence. You can see them in the reward section.\nThe Bone Giant strides forth from the charnel bone pits and seeks revenge on the living for every slight done to him and his people. There are too many to count! Some say these giants hailed from the hosts of the Firbolg, but even the tallest Firbolg is dwarfed by the Bone Giant. Some say these beings dwelled in Inis Fael and lands across the Sundering Sea before the cataclysm caused the Shift that led to the Tumult. It takes a Necrourge, Bone Dancer or Druid of the Dark Path of formidable power to command a Bone Giant, and any Geistbound Battalion with such a warrior in its ranks is considered prestigious and to be greatly feared.\n\nThe Bone Giant is an STL worthy of the 'giant' appellation, and has a base which is 75mm across and the Bone Giant measures 150mm from base to the top of his skull. It takes a truly brave or mindbendingly insane warrior to willingly face this walking horror. Available with and without a commercial licence, it is now among the Add-ons of this project.\n\nUntil next time, Heroes!\nBlessed Be\nThe Triskelion Games Team",
        "url": "https://www.kickstarter.com/projects/thethinningveil/the-undead-geistbound-battalions-stl-collection/posts/4333757",
        "likes_count": 0,
        "comments_count": 0,
        "comments": []
      },
      {
        "update_number": "UPDATE #2",
        "title": "Funded! The Geistbound Battalions are on the march!",
        "creator": "Triskelion Games Ltd\nMarch 10, 2025",
        "date": "March 10, 2025",
        "content": "Hail Heroes! \nIt is a real moment for us on this platform, as some of you may know, but for others, believe us, we are very grateful for your support! It is deeply meaningful to this team.\nAs an Indie publisher with a small dedicated team, the challenges in crowdfunding are many. This means so much to us! Please do spread the word of the project across your social media, tell your friends about it, hit Reddit or Discord or MMF and talk about it. Why? It helps us! And if it helps us, it will help you!\nHow? We are hoping if the funding goes up we can commission the Stretch Goal sculpts for you and there is plenty of time! Who wouldn't want the Geistbound Arch-Militants? Some of the most nefarious warleaders from across the countless years of Inis Fael's blood drenched shores and battlefields! We'll be unveiling them with any luck, and with some assistance from you, our backers!\n\nWe are thrilled to bring this motely collection of morbid military might to your collections and then to your gaming tables. As evidenced above and below, you can see these are all magnificent highly detailed sculpts!\nWe were also asked to make the 3 World Pledge from one of our games available again, so you can find that in two forms here, now added to the pledges. They are not licenced, but for private use. We hope you understand. \n\nLater on, we'll have a surprise new add-on for the dedicated Geistbound armies and commanders among you, who want to pack some serious punch in the arena of war...\nYou'll also find we added some of the big monsters from our Denizens of Midnight pack to the add-ons available individually. Check those out! \nDecora the Many Legged is an alien minded entity from another dimension, stranded in the Midnight and preying on the Aos Si and the Quick alike! She fell through the gaps between the spaces, and cannot find her way home, so she's making the best of it, and having a nosh right where she is!\nMore later! Thanks once again! Hopefully together we'll get to some of the Arch-Militants!\n\nUntil next time, Heroes! \nBlessed Be\nThe Triskelion Games Team",
        "url": "https://www.kickstarter.com/projects/thethinningveil/the-undead-geistbound-battalions-stl-collection/posts/4333509",
        "likes_count": 0,
        "comments_count": 0,
        "comments": []
      },
      {
        "update_number": "UPDATE #1",
        "title": "Almost funded! A Call to Arms!",
        "creator": "Triskelion Games Ltd\nMarch 10, 2025",
        "date": "March 10, 2025",
        "content": "Hail Heroes!\nWe are almost funded which is great news! We hope you'll help share news of the campaign around your social media, groups and so on, and together we are legion! Admittedly a small select legion right now, but you gotta dream, right?\n\nYou could share the above image and link the campaign to your favourite communities, or otherwise assist with spreading the word! We are going to spruce up the page over the next week and our sculptor is working on a phenomenally cool new add-on we know you'll love!\nIn the meantime, let's take a look at one of the lovely new sculpts we made for these collections!\n\nInfernal Commander Mal-Caoimhínm, of the Eternal Watch\nWe are sure you noticed the Infernal Commanders, preparing to march forth from the Land of the Dead. The Geistbound take on many forms, and the battalions are comprised of footsoldiers tochampions, and the kinds of spirits bound within their rotting carcasses ensure that their capabilities remain unpredictable.\nMal-Caoimhínm died long ago in the Frozen Wastes, when Inis Fael was connected to other lands and there was no Sundering Sea. The ice in which he fell crept into his dead heart and now his ferocious attacks are imbued with cruel cold that numbs and slows his enemies in the coldburn of his swinging axe blade.\nMal-Caoimhínm's eyes blaze with a blue fire, and it is said that any who dare meet his chilling gaze freeze in fear. When his legions were among the living and alive, as opposed to among the living to make them as dead as they are, Mal-Caoimhínm was renowned as a calculating strategist. When the Tuatha De Danaan descended in their sky-chariots, raining a fire which peeled flesh from bone, there was nothing Mal-Caoimhínm could do. Even in undeath his spirit remembers - and when turned on the Aos Si this Infernal Commander fights with even greater vigour.\n\nPlease remember to help spread the word in any way you can, and we'll be sure to have a few new add-ons and reveals to show you as the campaign marches on!\nUntil next time, Heroes!\nBlessed Be\nThe Triskelion Games Team",
        "url": "https://www.kickstarter.com/projects/thethinningveil/the-undead-geistbound-battalions-stl-collection/posts/4332927",
        "likes_count": 1,
        "comments_count": 0,
        "comments": []
      }
    ]
  }
}