{
  "url": "https://www.kickstarter.com/projects/tangled-wilderness/the-immortal-choir-holds-every-voice",
  "campaign_details": {
    "funding_period_text": "Funding period\nMar 4 2025 - Mar 21 2025 (17 days)",
    "funding_start_date": "2025-03-03T11:59:20-05:00",
    "funding_end_date": "2025-03-21T09:06:00-04:00",
    "funding_duration_days": 17,
    "pledged_amount": "$70,812",
    "funding_goal": "$15,000",
    "backers_count": "1,360",
    "days_left": 16
  },
  "updates": {
    "count": 5,
    "content": [
      {
        "update_number": "UPDATE #5",
        "title": "Less Than 24 Hours!",
        "creator": "Strangers in a Tangled Wilderness\nMarch 21, 2025",
        "date": "March 21, 2025",
        "content": "GOLLY! We're so excited this Kickstarter has meant so much to yall! We're in the closing 24 hours of the campaign and we have succeeded in a way that we just didn't anticipate! We hit every Stretch Goal that was not a joke and it has utterly humbled us! This includes the Danielle Cain RPG session! What system are we using? We don't know yet! Who's playing? Who knows! But it's gonna happen and it's gonna be FUN. We're really excited that we get to bring you this whole series in a new home. We're excited that it's been enough of a success that we hope Margaret will be inspired to continue the series further. We now have the capital to afford all of the production costs associated with the audiobooks. And the publishing collective is going to have a robust cushion so that we can continue to bring you more amazing projects in the future...and afford a nicer trenchcoat for our 7 punks in a trenchcoat. \n\nBut! We are also now addicted to Stretch Goal completion and wouldn't it be funny if you called our bluff on the tattoo goal? Tell your friends! HELP MAKE US GET ULIKSI TATTOOS!",
        "url": "https://www.kickstarter.com/projects/tangled-wilderness/the-immortal-choir-holds-every-voice/posts/4341788",
        "likes_count": 11,
        "comments_count": 0,
        "comments": []
      },
      {
        "update_number": "UPDATE #4",
        "title": "Only a Few More Days!",
        "creator": "Strangers in a Tangled Wilderness\nMarch 18, 2025",
        "date": "March 18, 2025",
        "content": "Thanks y'all so much for helping us get as far as we have! We had no idea that a third novella in a long-dormant series would be this popular! \n\nWe're so excited we made so many of our stretch goals! We'll make peace with the fact that we probably won't be moving in to Margaret's van to hunt demons for real... but we are excited to maybe hit the $60k stretch goal! Which, we really want to hit, cause we really wanna do a ttrpg session set in the world of Danielle Cain! Which we can definitely never do regardless of the outcome *they said sarcastically.*\n\nIf you love this world, let your friends know, and maybe y'all can love it together! \n\nALSO, a spot in the Uliksi Book Club opened up... so if you and 5 of your friends want to upgrade your pledge, say the words, and summon Uliksi together—we know that worked out so well for the characters in the first book—we promise it won't be a demon deer that greets you, but Margaret Killjoy herself, who we don't think is a demon deer. We don't know. We've never asked.",
        "url": "https://www.kickstarter.com/projects/tangled-wilderness/the-immortal-choir-holds-every-voice/posts/4339082",
        "likes_count": 6,
        "comments_count": 1,
        "comments": [
          {
            "text": "I am just SUPER EXCITED for anything and everything Margaret makes. :)",
            "commenter": "Michael Nestick",
            "timestamp": "March 18, 2025 1:12 AM AWST",
            "datetime": "1742231576",
            "relative_time": "7 days ago"
          }
        ]
      },
      {
        "update_number": "UPDATE #3",
        "title": "$40k Stretch Goal Reached! More to come!",
        "creator": "Strangers in a Tangled Wilderness\nMarch 7, 2025",
        "date": "March 7, 2025",
        "content": "We said if we hit $40k, Margaret would write another short story, and we have, so she will! And since y'all are so hungry for stretch goals, we have THREE more for you. To be honest, two of them are jokes but go ahead, call our bluff! Also $100K suddenly doesn't seem that far off... And $1 Million? Who doesn't want to see us become the real life Danielle Cain crew? \n$40K: Additional Short Story Zine\nIf we hit $40k, Margaret will write an additional short story that could have been told on Samhain in The Immortal Choir Holds Every Voice, and Robin Savage will illustrate it. Backers of any reward tier will be sent a readable PDF of the zine. This short story may be released after the other rewards are sent out. \n$60K: Danielle Cain RPG One Shot \nIf we hit $60k, with Margaret's help, we will run a TTRPG one shot set in the world of Danielle Cain with her and stream it. \n$ 100K: Join Uliksi\nIf we hit $100k then everyone in Strangers in a Tangled Wilderness will get one of the tattoos from the flash sheet. But also we reserve the right to back out at any time. Except Inmn. They have to. \n$1 Million: Join Uliksi For Real\nIf we hit $1 million, Strangers in a Tangled Wilderness will travel the continent in a van and hunt demons of our own. You may think we put this in as a joke, and we did, but wouldn’t it be funny if you and a few hundred thousand friends called our bluff?",
        "url": "https://www.kickstarter.com/projects/tangled-wilderness/the-immortal-choir-holds-every-voice/posts/4331008",
        "likes_count": 14,
        "comments_count": 0,
        "comments": []
      },
      {
        "update_number": "UPDATE #2",
        "title": "Blowing By Stretch Goals!",
        "creator": "Strangers in a Tangled Wilderness\nMarch 4, 2025",
        "date": "March 4, 2025",
        "content": "We just can't! Thanks everyone who's backed this campaign so far. It means so much to us that so many people want to see this series thrive. We weren't totally sure that a novella about traveling crust punks hunting demons was going to be such a hit! But we were the fools! \n\nY'all are unlocking Stretch Goals so fast we even didn't even have a chance to tease them! So here's two more! \n$30K: Road Trip Playlist For The Crew\nIf we hit $30k, which we have, Margaret will put together a Spotify playlist of songs Danielle, Brynn, Vulture, Doomsday, and Thursday might have on their mixtape and listen to in the van as they drive across the haunted plains of rural Turtle Island. Backers at every level will get a link to the play list. Accompanying the private Spotify play list will be document with the playlist and annotations and notes from Margaret. Backers of any reward tier will receive a PDF download of the written out playlist. Backers with physical rewards will get a print out of the playlist with their rewards. Who chose which song? What does Brynn love that Doomsday can’t stand?\nNow let's get to $40k!!! Let's get another story in the world of Danielle Cain!\n$40K: Additional Short Story Zine\nIf we hit $40k, Margaret will write an additional short story that could have been told on Samhain in The Immortal Choir Holds Every Voice, and Robin Savage will illustrate it. Backers of any reward tier will be sent a readable PDF of the zine. This short story may be released after the other rewards are sent out.",
        "url": "https://www.kickstarter.com/projects/tangled-wilderness/the-immortal-choir-holds-every-voice/posts/4328786",
        "likes_count": 13,
        "comments_count": 0,
        "comments": []
      },
      {
        "update_number": "UPDATE #1",
        "title": "We're funded!",
        "creator": "Strangers in a Tangled Wilderness\nMarch 4, 2025",
        "date": "March 4, 2025",
        "content": "Gollly! We're funded in 2 hrs and that is just incredible! THANK YOU SO MUCH! We're so excited we're going to be able to bring yall all three audiobooks for the whole series now! \n\nAnd.... Here's the first Stretch Goal! It's not unlocked yet, but we don't see that being too far off at this rate!!\n\n   $20K: Flash art Sheet\nIf we hit $20k, our illustrator Robin Savage will work with Margaret Killjoy to design a sheet of flash-style tattoos straight from the world of Danielle Cain that Brynn might tattoo on anyone in the crew.You can get any of these tattooed on yourself!. Backers of any reward tier will get a downloadable PDF of the flash art. Backers with physical rewards will get a print out of the flash sheet with their rewards.",
        "url": "https://www.kickstarter.com/projects/tangled-wilderness/the-immortal-choir-holds-every-voice/posts/4328018",
        "likes_count": 13,
        "comments_count": 0,
        "comments": []
      }
    ]
  }
}