{
  "url": "https://www.kickstarter.com/projects/17991623/the-first-ever-power-strip-with-an-internal-safety-switch",
  "campaign_details": {
    "funding_period_text": "Funding period\nJan 21 2025 - Mar 9 2025 (47 days)",
    "funding_start_date": "2025-01-21T00:59:58-05:00",
    "funding_end_date": "2025-03-09T00:59:58-05:00",
    "funding_duration_days": 47,
    "pledged_amount": "$9,314",
    "funding_goal": "$2,000",
    "backers_count": "160"
  },
  "updates": {
    "count": 2,
    "content": [
      {
        "update_number": "UPDATE #3",
        "title": "Product Design Feedback & Idea Sharing",
        "creator": "GOOD LIFE\nFebruary 19, 2025",
        "date": "February 19, 2025",
        "content": "Hello, backers!\nThis is the GOODLIFE Team.\nDue to your passionate support, 130 backers joined us. We can't hide my excitement\nand anticipation as we think about all of you becoming the first users of our product.\nWe are still a small startup, and we're not very familiar with the Kickstarter\ncommunity, but we want to communicate actively with you all because we believe\nour growth is only possible through your encouragement and interest.\nRecently, one of our backers gave us feedback on the product design. In fact, our\nfocus has been on the core functions and value of the product—enhancing user\nsafety through a smart internal mechanism—so we haven't paid as much attention to\nthe exterior design. However, hearing that the product will be placed in the users’\nspaces and will be seen daily, we realized that the design might be too plain and\nmonotonous. This feedback led us to spend some time reflecting deeply on the issue.\nOur product has specialized features, but since its internal components are not\ncurrently visible, how about creating a transparent case by adjusting the CMF (Color,\nMaterial, Finish) to upgrade feasible options and allow users to see how the product\nworks inside?\nWe believe that we can grow through communication and collaboration with our\nbackers. That's why we want to share this idea with you and hear your thoughts!\nPlease feel free to leave your opinions!\nThank you.\n[The GOODLIFE Team]",
        "url": "https://www.kickstarter.com/projects/17991623/the-first-ever-power-strip-with-an-internal-safety-switch/posts/4316995",
        "likes_count": 13,
        "comments_count": 13,
        "comments": [
          {
            "text": "I am late to the party. I backed this project before I realized that the case will be transparent. I will probably add more strips to my order if I will have a chance. Good work!",
            "commenter": "Eran Gabber",
            "timestamp": "March 10, 2025 10:37 PM AWST",
            "datetime": "1741617422",
            "relative_time": "3 days ago"
          },
          {
            "text": "Dear Eran Gabber First of all, we sincerely appreciate your interest in our products and the valuable feedback you have shared with us. As many customers have expressed their desire for a transparent product, we are actively reviewing this possibility. However, at this stage, it is difficult for us to confirm the release schedule or method. The reasons are as follows: 1) To apply a transparent material, we must use a UL-certified material that meets the standards of the U.S. electrical product safety certification body (ETL) and obtain approval. 2) Our current products use ABS flame-retardant grade 1 material.   This material is excellent for precisely molding even the fine functional parts inside the product. 3)  Most transparent products on the market use polycarbonate (PC) material.    However, polycarbonate (PC) has a different composition from the ABS material we currently use, and due to its lower processability, it is difficult to use with our existing molds. 4) Therefore, we are actively reviewing transparent ABS flame-retardant grade 1 materials that not only meet ETL certification standards but also offer excellent processability and compatibility with our existing molds. Due to these factors, it is challenging to implement the change immediately.There are still many other aspects to consider, but we are committed to finding the best possible solution. While we regret that we are unable to provide a transparent material product right away, we kindly ask for your understanding. Once again, thank you for your valuable feedback and interest.Wishing you a wonderful day ahead. [GOODLIFE TEAM]",
            "commenter": "GOOD LIFE",
            "timestamp": "March 11, 2025 10:28 PM AWST",
            "datetime": "1741703312",
            "relative_time": "2 days ago"
          },
          {
            "text": "Transparent and orange is exactly what I want. Gimme.",
            "commenter": "Ross Williams",
            "timestamp": "February 19, 2025 3:51 PM AWST",
            "datetime": "1739951468",
            "relative_time": "22 days ago"
          },
          {
            "text": "Dear Ross Williams, Highly appreciate your interest. The content of Update #3 is one of the ideas that we are currently reviewing internally, and it was posted to gather feedback and advice from our supporters. At the moment, we are in the process of collecting the majority opinions of our supporters regarding the transparent design. Once again, thank you for your active support. [The GOODLIFE Team]",
            "commenter": "GOOD LIFE",
            "timestamp": "February 19, 2025 5:32 PM AWST",
            "datetime": "1739957549",
            "relative_time": "22 days ago"
          },
          {
            "text": "That clear casing looks great and distinctive! Worthy of the distinction of your innovative power strip.",
            "commenter": "Chocolate",
            "timestamp": "February 19, 2025 9:59 AM AWST",
            "datetime": "1739930340",
            "relative_time": "22 days ago"
          },
          {
            "text": "The design posted in the announcement is one of the ideas that is currently being reviewed internally within the company. It is possible to apply various colors, and we are developing materials and production processes for each color. We are also conducting experiments to see if certain colors affect the product's durability or quality, and we are working to find the optimal approach considering these factors. We wanted to hear the opinions of our supporters, and we appreciate the great feedback. Have a great day [The GOODLIFE Team]",
            "commenter": "GOOD LIFE",
            "timestamp": "February 19, 2025 3:09 PM AWST",
            "datetime": "1739948965",
            "relative_time": "22 days ago"
          },
          {
            "text": "I love it!",
            "commenter": "Pamela Borges DosSantos",
            "timestamp": "February 19, 2025 9:33 AM AWST",
            "datetime": "1739928802",
            "relative_time": "22 days ago"
          },
          {
            "text": "I have designed something based on the ideas discussed in our brainstorming session, and it motivates me as the creator to see that you like it. Offering a variety of colors can provide consumers with more choices, so we will review how the colors can impact the image or atmosphere the product conveys, and how the color choice can affect the product. Thank you for your great feedback. Have a wonderful day. [The GOODLIFE Team]",
            "commenter": "GOOD LIFE",
            "timestamp": "February 19, 2025 3:08 PM AWST",
            "datetime": "1739948883",
            "relative_time": "22 days ago"
          },
          {
            "text": "Yes make that an option in all categories I love it",
            "commenter": "Corbin",
            "timestamp": "February 19, 2025 9:20 AM AWST",
            "datetime": "1739928027",
            "relative_time": "22 days ago"
          },
          {
            "text": "Thank you for your enthusiastic support. We will actively review with our engineers to ensure it can be applied across all categories. By implementing transparent covers in various categories, we will make sure the product's appeal stands out, and we will actively incorporate your valuable feedback. Have a wonderful day. [The GOODLIFE Team]",
            "commenter": "GOOD LIFE",
            "timestamp": "February 19, 2025 3:05 PM AWST",
            "datetime": "1739948730",
            "relative_time": "22 days ago"
          },
          {
            "text": "I think the transparent case with orange accents looks pretty neat 😊 I think that would be a great third option 😎",
            "commenter": "Johnny B.",
            "timestamp": "February 19, 2025 9:12 AM AWST",
            "datetime": "1739927539",
            "relative_time": "22 days ago"
          },
          {
            "text": "I second this - the transparent/accented design looks awesome and I’d pick it over the other two styles, even if it were a little more expensive 👍",
            "commenter": "P",
            "timestamp": "February 19, 2025 9:24 AM AWST",
            "datetime": "1739928292",
            "relative_time": "22 days ago"
          },
          {
            "text": "Many people are showing a positive response to the transparent cover. The transparent cover can visually highlight the product's interior, making it more attractive to consumers. For products where the internal structure, ingredients, or technical elements are important, the transparent cover itself provides a unique appeal, so we will actively consider it. Thank you. [The GOODLIFE Team]",
            "commenter": "GOOD LIFE",
            "timestamp": "February 19, 2025 3:04 PM AWST",
            "datetime": "1739948640",
            "relative_time": "22 days ago"
          }
        ]
      },
      {
        "update_number": "UPDATE #2",
        "title": "Update on Our Progress",
        "creator": "GOOD LIFE\nFebruary 6, 2025",
        "date": "February 6, 2025",
        "content": "Dear Backers,\nThis is the GOOD LIFE Team.\nFirst and foremost, we sincerely appreciate your support for our project.\nYour contributions are not just financial support but also a tremendous source of motivation and encouragement for our team.\nTo meet your expectations, we are carefully managing every step of the production process, including the arrival schedules of each component. After thorough reviews, we are pleased to inform you that everything is progressing as planned.\nWaterproof Test [IPX4]\nProduct Photos\nProduction Readiness\nWe have noticed that some backers selected the regular Early Bird reward, even though the Super Early Bird (50% off) option is still available. If you intentionally chose the Early Bird reward to support us even further, we truly appreciate your generosity! However, if this was unintentional, please take note of this.\nOnce again, thank you for your support. We will continue to keep you updated and move forward on this journey together.\nBest regards,\n[The GOODLIFE Team]",
        "url": "https://www.kickstarter.com/projects/17991623/the-first-ever-power-strip-with-an-internal-safety-switch/posts/4300029",
        "likes_count": 3,
        "comments_count": 0,
        "comments": []
      }
    ]
  }
}