{
  "url": "https://www.kickstarter.com/projects/236568870/the-house-witch-a-humorous-romantic-fantasy",
  "updates": {
    "count": 6,
    "content": [
      {
        "update_number": "UPDATE #6",
        "title": "New Stretch Goal!",
        "creator": "Robin SullivanCollaborator\nFebruary 23, 2025",
        "date": "February 23, 2025",
        "content": "Well done all! You've blown through the third stretch goal and that means all the books will come with a 4-color Kraken bookmark!\nSince you blew through the last two so quickly, I've made the next one a little harder, but certainly doable.  Right now we have been averaging about $4722 USD per day and there are 6 days left.  So I put the next stretch goal at $50,000 USD ($10,000 USD from where we are now.\nWhat will you get if we reach this goal? Well, we'll upgrade the book with 4-color end sheets. I have a few different design ideas to pass by Emilie, and I'll do so on our Tuesday call. Once she picks an \"approach\" we'll tell you more about it.\nAs always, thanks for the amazing support.",
        "url": "https://www.kickstarter.com/projects/236568870/the-house-witch-a-humorous-romantic-fantasy/posts/4321010",
        "likes_count": 20,
        "comments_count": 2,
        "comments": [
          {
            "text": "What about Smyth-sewn bindings? The omnibus will be very thick and I plan on reading it often. It would be nice to have a sturdy binding that will hold up, thanks!",
            "commenter": "Christian Smith",
            "timestamp": "February 24, 2025 12:23 AM AWST",
            "datetime": "1740327822",
            "relative_time": "1 day ago"
          },
          {
            "text": "We are definitely considering that. There are plenty of books this size that are adhesive bound - but I plan on getting pricing for both options. We are discounting the Omnibus greatly, and I don't want to put Emilie in a position where she looses money on each book produced.",
            "commenter": "Robin Sullivan",
            "timestamp": "February 24, 2025 9:11 PM AWST",
            "datetime": "1740402699",
            "relative_time": "about 11 hours ago"
          }
        ]
      },
      {
        "update_number": "UPDATE #5",
        "title": "Who is #1 - You are!",
        "creator": "Robin SullivanCollaborator\nFebruary 23, 2025",
        "date": "February 23, 2025",
        "content": "Most Popular Fiction Kickstarter\nI just did a check of the rankings for the live fiction Kickstarter projects, and guess what was at #1 for popularity!  Yep, The House Witch project.  The support just continues to grow, so thanks everyone for helping Emilie's first Kickstarter to be a big success!\nSecond Stretch Goal Reached\nAnd not surprising, you all hit your second stretch goal, so there will be a zoom call afterparty filled with celebrations, congratulations, thank yous and Q&A's.\nMore stretch goals soon\nEmilie and I will be having a call on Tuesday (I'm currently at Con Nooga for a convention, and we'll figure out the fourth stretch goal - but if you want to break that barrier before then, we're fine with that!\nOur continued thanks\nAs always, Emilie and I would like to thank you for helping to spread the word about her books. We need more people reading these!",
        "url": "https://www.kickstarter.com/projects/236568870/the-house-witch-a-humorous-romantic-fantasy/posts/4320618",
        "likes_count": 18,
        "comments_count": 0,
        "comments": []
      },
      {
        "update_number": "UPDATE #4",
        "title": "A Double Stretch!",
        "creator": "Delemhach A.K.A Emilie Nikota\nFebruary 21, 2025",
        "date": "February 21, 2025",
        "content": "Hi everyone, \n\nI wanted to take the time today to thank you again to all of you for supporting this project. I am excited to say we have almost met the second stretch goal, and with any luck, maybe by end of day tomorrow, we will have knocked it out of the park!\n\n(I am already over the moon that we will be able to include gilded edges in the books!)\n\nI'm also here to answer just a couple common questions that have been popping up in my inbox during this Kickstarter.\n\nWill there be a Kickstarter for special editions of volumes 2 and 3 of The House Witch?\n\nAt this time, I have no plans for doing special editions of these two volumes. I'm not saying I never will, but there is nothing scheduled down the line right now.\n\nWill these special edition books be signed?\n\nYes, they will! Once the Kickstarter is over and we are working on fulfillment, I will be uncapping my pen to sign my name to all of these copies you all so generously purchased. Though a question for all of you:\n\nWould you like me to sign these books as my real name: Emilie Nikota or my pen name, Delemhach. \n\nLet me know in the comments! \n\nNow, if anyone is looking to expand their fantasy library and support some cool indie authors, I have gotten to connect with two authors that are currently running Kickstarters themselves!\n\nThe first book is a cozy fantasy by Liz Delton titled: The Witch at the Edge of the Wood\n\nCheck it out here:\n\nhttps://www.kickstarter.com/projects/lizdelton/the-witch-at-the-edge-of-the-wood-cozy-fantasy-luxe-edition?ref=user_menu \n\nIf you like the clean romance element of The House Witch, then you might be interested in this Phantom of the Opera re-telling by Celine Jeanjean titled: Music and Mirrors. \n\nFind the early launch page here:\n\nhttps://www.kickstarter.com/projects/celinejeanjean/music-mirrors \n\nWell, friends, hopefully I'll be able to do a post soon about us meeting more stretch goals. In the mean time, have a wonderful rest of your day, and go enjoy a good book! \n\nCheers, \nDelemhach",
        "url": "https://www.kickstarter.com/projects/236568870/the-house-witch-a-humorous-romantic-fantasy/posts/4319422",
        "likes_count": 21,
        "comments_count": 23,
        "comments": [
          {
            "text": "I personally would prefer Delemhach! I think I would get confused because I'm terrible with names if it was your real name xD",
            "commenter": "Maddie Biscotti",
            "timestamp": "February 22, 2025 6:11 AM AWST",
            "datetime": "1740175883",
            "relative_time": "3 days ago"
          },
          {
            "text": "I would choose your pen name, if I could only pick one, since this is how you started it all. I do love the idea of the pen name in larger print with your given name smaller under it! But still, you’re doing amazing and I love your work!",
            "commenter": "Kaley",
            "timestamp": "February 22, 2025 5:45 AM AWST",
            "datetime": "1740174326",
            "relative_time": "3 days ago"
          },
          {
            "text": "Emilie Nikota",
            "commenter": "Christian Smith",
            "timestamp": "February 22, 2025 4:32 AM AWST",
            "datetime": "1740169949",
            "relative_time": "3 days ago"
          },
          {
            "text": "I vote pen name!",
            "commenter": "Heather",
            "timestamp": "February 22, 2025 2:42 AM AWST",
            "datetime": "1740163367",
            "relative_time": "3 days ago"
          },
          {
            "text": "I'd vote both too :D",
            "commenter": "Lisette Roovers",
            "timestamp": "February 22, 2025 1:32 AM AWST",
            "datetime": "1740159155",
            "relative_time": "3 days ago"
          },
          {
            "text": "I also like the idea of both-Delemhach big and real name small--but that's a lot of signing, so I'd vote pen name if I had to chose. The idea of a Kraken paw print @Jessica Strawn mentioned sounds really fun as well.",
            "commenter": "Z",
            "timestamp": "February 21, 2025 1:08 PM AWST",
            "datetime": "1740114498",
            "relative_time": "4 days ago"
          },
          {
            "text": "I’d vote for both names as well",
            "commenter": "Cameron Stephens",
            "timestamp": "February 21, 2025 10:54 AM AWST",
            "datetime": "1740106460",
            "relative_time": "4 days ago"
          },
          {
            "text": "Pen Name big with small real name underneath so twenty years from now there will be no doubt you are one in the same",
            "commenter": "A E Richardson",
            "timestamp": "February 21, 2025 10:38 AM AWST",
            "datetime": "1740105537",
            "relative_time": "4 days ago"
          },
          {
            "text": "I'd prefer your pen name :) great job on your ks! I'm also running my campaign and it's fun!",
            "commenter": "Camilla Vavruch",
            "timestamp": "February 21, 2025 9:25 AM AWST",
            "datetime": "1740101110",
            "relative_time": "4 days ago"
          },
          {
            "text": "I honestly vote for both names on the signature Delemhach A.K.A Emilie Nikota",
            "commenter": "Gerardo Bahena",
            "timestamp": "February 21, 2025 9:09 AM AWST",
            "datetime": "1740100192",
            "relative_time": "4 days ago"
          },
          {
            "text": "Edit: that’s probably too much work though",
            "commenter": "Gerardo Bahena",
            "timestamp": "February 21, 2025 9:10 AM AWST",
            "datetime": "1740100235",
            "relative_time": "4 days ago"
          },
          {
            "text": "Delemhach! But also would it be possible to get an Emperor Kraken signature (paw print) on the signature page? Like a photo copy of your kitty's paw right next to your signature would be super cute ❤️",
            "commenter": "Jessica Strawn",
            "timestamp": "February 21, 2025 8:14 AM AWST",
            "datetime": "1740096865",
            "relative_time": "4 days ago"
          },
          {
            "text": "Emilie",
            "commenter": "Linda Wakefield",
            "timestamp": "February 21, 2025 7:57 AM AWST",
            "datetime": "1740095851",
            "relative_time": "4 days ago"
          },
          {
            "text": "Pen name! That’s what I personally associate with the house witch. I also feel like that’s how you typically sign off on things so it makes sense to continue it to me",
            "commenter": "Ashley LeBeau",
            "timestamp": "February 21, 2025 7:57 AM AWST",
            "datetime": "1740095844",
            "relative_time": "4 days ago"
          },
          {
            "text": "I’d say your real name, people use their pen name so much after they are famous which by the way your crushing it is clearly in your future! So I think it would be special to have your real name! For this big first! Plus it’s you & you’re awesome! So excited for this! Thanks for even asking.",
            "commenter": "Chrissy",
            "timestamp": "February 21, 2025 7:54 AM AWST",
            "datetime": "1740095658",
            "relative_time": "4 days ago"
          },
          {
            "text": "Delemach would be great!",
            "commenter": "Lauren Wilson",
            "timestamp": "February 21, 2025 7:48 AM AWST",
            "datetime": "1740095332",
            "relative_time": "4 days ago"
          },
          {
            "text": "I also vote for Delemhach!",
            "commenter": "Kathryn Kane",
            "timestamp": "February 21, 2025 7:45 AM AWST",
            "datetime": "1740095130",
            "relative_time": "4 days ago"
          },
          {
            "text": "Pen name!",
            "commenter": "Nikki Mathis",
            "timestamp": "February 21, 2025 7:34 AM AWST",
            "datetime": "1740094454",
            "relative_time": "4 days ago"
          },
          {
            "text": "Delemhach is how I think of you.",
            "commenter": "Susan Fried",
            "timestamp": "February 21, 2025 7:33 AM AWST",
            "datetime": "1740094414",
            "relative_time": "4 days ago"
          },
          {
            "text": "Delemhach!",
            "commenter": "Jessica Bowden",
            "timestamp": "February 21, 2025 7:25 AM AWST",
            "datetime": "1740093939",
            "relative_time": "4 days ago"
          },
          {
            "text": "I think Delemhach for the signatures. 😊",
            "commenter": "Chelsea Tucker",
            "timestamp": "February 21, 2025 7:21 AM AWST",
            "datetime": "1740093679",
            "relative_time": "4 days ago"
          },
          {
            "text": "Your pen name for the signature! I personally feel that it would mean a lot more with that name since it's the name that kickstarted (😉) this amazing series!",
            "commenter": "Rebecca",
            "timestamp": "February 21, 2025 7:15 AM AWST",
            "datetime": "1740093321",
            "relative_time": "4 days ago"
          },
          {
            "text": "Congrats! You’re crushing it!",
            "commenter": "S.L. Rowland",
            "timestamp": "February 21, 2025 7:14 AM AWST",
            "datetime": "1740093247",
            "relative_time": "4 days ago"
          }
        ]
      },
      {
        "update_number": "UPDATE #3",
        "title": "A newbies guide to Kickstarter",
        "creator": "Robin SullivanCollaborator\nFebruary 20, 2025",
        "date": "February 20, 2025",
        "content": "Gah. I wrote an incredibly long post and then accidentally lost it all. So here I go again. I hope I remember everything. This isn't so much an \"update\" as it is a \"how Kickstarters work tutorial.\" It's primarily targeted at those who are new to Kickstarter, but as each project has it's on peculiarities, even seasoned backers may find this helpful.\nKickstarter phases\nIn general a Kickstarter has several stages:\nProject Creation\nPre-launch notification\nThe Launch\nFunding Period\nProduction\nSurveys\nLockdown\nFulfillment\nProject Creation — happens weeks or months before a project goes live, where the creator has to verify who they are and where they live. They will also be vetted by Kickstarter as people with a bad past reputation won't be allowed to launch future projects. This is where we craft \"The Story\" and define the reward levels and what will be offered as add-ons. Once the creator has everything set, they ask for approval from Kickstarter to make sure it falls within their guidelines and they will either approve or reject the project.\nPre-launch notification — occurs between the \"approval\" and the \"launch\" - and at this time people can click on a button to be notified when a project goes live. If you are new to Kickstarter, you might want to browse other \"coming soon\" ficgtion projects and if you are curious about them, you can get a reminder at launch. For this Kickstarter we had just about 600 peoples sign up and so far 31% have backed the project (186 people).\nThe Launch  — occurs on the go live date and time. This is when people can start backing the project. Once someone backs a given reward tier, the creator won't be able to change it (except for adding supported shipping countries). They also won't be able to change the end date. Just something to know because we often see comments asking people to keep the project going for a few more days. If you miss the Funding Period, no worries, there will be a way for you to back the project later. See the below section on missing the Kickstarter.\nFunding Period — is pretty explanatory. It occurs between the Launch and the End Date. During this time, you can modify your pledge in a number of ways including: \nSwapping to a different tier (either up or down)\nIncluding or removing  add-on items\nIncluding or removing  \"bonus money\" for instance to reach a desired stretch goal\nCanceling your pledge (but please don't do that!)\nAt the end of the funding period, one of two things will happen.\nIf the funding goal is not reached, no credit cards are charged, no backer data is sent to the creator, and the project ends.\nIf the funding goal is reached, then your order is \"committed.\" This means all the backers' cards are immediately charged, the creator receives the email addresses of the backers (but not their shipping information), and the reward are \"locked in\" — although as you'll see in a moment, (during the suvey stage), you can \"upgrade\" after the Kickstarter if you wish.\nI should also note that Emilie won't receive the money pledged until several weeks after the funding period. This is because some credit cards will fail, and Kickstarter try to correct those errors for several weeks, and then any backers who haven't yet paid will be dropped from the Kickstarter - but don't worry, if this happens to you we can still get you in - see the People who miss the Kickstarter section below.\nProduction — For this project, it will  start after the project ends and it will also coincide with when the surveys go out. Why wait? Well we might augment the books and make them better if various funding goals are reached. For instance, if we started printing early, we wouldn't have been able to add the gilded edges (Stretch Goal #1).  There might be other additions made as the project continues.\nThe first step of production is determining the quantity of books to order (which we won't know until funding is completed). We will order more than the number purchased to account for (a) late backers (b) books lost or damaged in the mail, and (c) books that arrive to us in less than pristine shape. \nOnce we know the number we will get several printer quotes. Each printer has their own \"house papers\" and based on which printer we select (and which paper will be used) the width of the spine may change.  Once we have selected the printer, the cover designer can adjust the spine widths and provide print ready files.\nWhen the print ready files (and a 50% payment) is sent to the printer, we'll be put in a \"print queue\" - waiting for our turn to get on the press. We have no way of knowing ahead of time how long or short that queue is, but as soon as we know, we'll fill you in through an update.  At some point, we'll reach the top of the queue and the books are printed, packaged, and sent to our Virginia warehouse.\nSurveys — will go out a day or two after the end of the funding period.  I hate this term as it sounds like it's some kind of \"customer satisfaction\" inquiry - which it is not.  This is where we get important information from you —most importantly your mailing address!  So if you DO NOT fill out your survey we cannot mail you your book. \nWhile Kickstarter has their own survey (and recently added a late pledge option), we will be using a third-party fulfillment software for these functions. It's called BackerKit and it is a bit more sophisticated and easier to use than the built in Kickstarter features. So your survey will come from Kickstarter rathaer than from BackerKit.\nNOTE: the survey will be sent to the email you have on file with Kickstarter BUT it CANNOT reach you if you are using an Apple Pay Private email such as: k6ai9bshur@privaterelay.appleid.com. Nor can we email you to tell you your email address is invalid.  We will send you messages via Kickstarter - so please be on the lookout for those notifications and provide us with an updated email address so you can get your survey.\nIn addition to providing your shipping data, surveys will also allow you to change your mind and upgrade your pledge. Through it you can:\nSwitch to a higher reward tier (such as Both Books rather than Omni or Book #1)\nPurchase add-ons\nAdd a \"tip\" for either Emilie or the fulfillment team\nIf you upgrade, additional funds will be collected by BackerKit's secure checkout process. You'll enter your credit card information (which we do not receive) and we will charge you during the lockdown phase (see below).\nNOTE: Deluxe editions will also be available as \"add-ons\" during the survey phase - this will allow you to get two (or more) copies of the deluxe editions shipped together. The reason we don't do that during the Kickstarter is BackerKit has a more robust system for calculating shipping weights so rather than having a bunch of different reward levels for multiple deluxe editions - we'll handle that through survey add-ons.\nNOTE: You will not be able to \"downgrade\" your pledge as that commitment was made through Kickstarter and the money was collected by them and sent to Emilie already. \nLockdown — will be announced a few days before the books are scheduled to arrive at our warehouse. This is the last time to make any changes to your pledge or to update your shipping address if you moved (or plan to move soon and you want us to hold your order).  If you changed reward levels we'll charge your card then. As mentioned, we DO NOT receive your credit card information.\nFulfillment — starts after lockdown. James will create shipping labels; Emilie will sign the books, and the rest of the shipping team will start packing, labeling, and sending packages to various carriers.  Your tracking information will be updated in BackerKit and you will be notified via email.  \nIf you don't get a tracking number, check your email and Kickstarter messages, it's because we needed additional information from you (like apartment or suite number) and you've not seen the notifications. We do EVERYTHING we can to get the information required, but sometimes there are one or two people we can't ship to. In this case, we will reserve your books - and ship them once we learn where they should go - in some cases this has been years after the Kicksatarter ended!  Please don't be that guy/gal.\nIf you are not in the US, and your country charges import fees or value-added taxes on books sent from the US, you need to watch your shipping status carefully. That's because you will be contacted by your carrier to pay your import duties - which does not come to us. It goes directly to your taxation authority. If you fail to make this payment the package will come back to us. If that happens, you'll have to pay for a second shipment and it will be more expensive since Emilie has subsidized part of the postage on the first shipment. So please don't let this happen to you.\nWe will watch the status of all packages, and if it says \"delivered\" we will assume you have it and everything was fine. We take great care in packaging, but a very few number will be damaged in the mail - if this happens send a picture of your damaged book(s) to jms.books.logistics@gmail.com and we'll get a replacement sent out. If your package is marked as \"delivered\" but you don't have it - it may be because of porch pirate or wrong delivery by your post office. If that happens, please notify us right away, and we'll resend another package at our expense. We generally won't be watching a Kickstarter months after the packages have arrived, so if you wait too long, you'll hae to reach out to Emilie directly.\nPeople who miss the Kickstarter\nIf you missed the Kickstarter, or you cancelled or didn't pledge because you needed more time to put aside the money,  don't worry you can still get the books. BackerKit has the ability for a \"pre-order\" store where you'll be able to purchase any of the products sold through the Kickstarter. There will be a \"Late Backer\" button in the header of this Kickstarter (and we'll also post the URL in updates).\nNOTE: While there is a one time transfer of data from Kickstarter to BackerKit at the time the project ends, there is NO communication from BackerKit to Kickstarter. In other words if you pre-order or change your order in BackerKit, Kickstarter is not aware of that. If you pre-order you will not see updates automatically. So, please check the updates at this link before inquiring about the status of production or shipping.\nWrapping up\nAnd that's the process from soup to nuts. I hope I answered any questions you may have had, but if not - just add a comment or send a message to Emilie and I'll get the answer to you.  Thanks again for your support.",
        "url": "https://www.kickstarter.com/projects/236568870/the-house-witch-a-humorous-romantic-fantasy/posts/4318012",
        "likes_count": 13,
        "comments_count": 0,
        "comments": []
      },
      {
        "update_number": "UPDATE #2",
        "title": "First Stretch Goal Reached! And other status information",
        "creator": "Robin SullivanCollaborator\nFebruary 19, 2025",
        "date": "February 19, 2025",
        "content": "A Heartfelt Thanks\nHey all, Robin here. I'm thrilled to see so many people helping Emilie in her first project. Kickstarter is such an amazing community! We've even had 11 people who don't want any rewards but are simply backing the project to show their support. My thanks go out to all of you.\nBadge of Honor\nNot only do backers love this project, but so does Kickstarter. It's received the \"Projects We Love\" seal of approval. Something that's not easy to do. Out of the 16,154 fiction projects only 12% have received that badge.\nA Top Performer\nRight now, there are 168 live fiction Kickstarters and The House Witch is in the top 5 in all categories:\n4th most backed - Top 2%\n5th most popular - Top 3%\n5th most funded - Top 3%\nNew Kickstarter Members\nI'd like to welcome the more than 100 people who are using Kickstarter for the first (but hopefully not last) time! \nFor those new to Kickstarters, I'm going to be posting an update directly after this one to help explain the process. Pre-ordering items from Kickstarter isn't like buying something from other online sources because \nthe product doesn't yet exist ane\nwe don't get shipping information from Kickstarter.\nSo if you are new, please see my next update post.\nStretch Goal Updates\nAs mentioned - we hit our first Kickstarter - so we are going to provide a gilded edge to the books - this is an expensive addition to the books, but your added support helped to make that happen.\nWe are over 50% of the way to the second Kickstarter which will add an afterparty where you can ask me and Emily questions and share in our excitement about getting these really cool books into your hands and onto your shelves.\nI've also added a third stretch goal - this one for a four-color bookmark featuring Kracken!  All orders will have this included for free if we reach that goal.\nKickstarter Stats\nBefore I became a full-time publishing person, I used to be a software engineer, so numbers are kinda a thing with me.  If you are interested here is some data about the Kickstarter so far.\nIf we take out the 104 first time backers the remaining 269 people have pledged to 21,860 projects — that's a ton of support!\nThe average number of projects backed is 81.3.\nThe person who has backed the largest number of projects is 1,783!  \n2 backers have backed more than 1,000 projects, and 10 have backed more than 500.\n34 people have backed in the 100 - 499 range\nHow many books so far?\nSo far we've sold 466 copies of Emilie's books. And the Omnibus edition is by far the most popular choice:\n343 Omnibus editions\n53 Deluxe Book #1\n70 paperbacks\nOh, and one thing I didn't mention in the Kickstarter, but I'll add it now: the paperbacks are also going to be signed, so if you want one - trade up and pass your old copy onto someone who you think will love the books. Doing so will help us reach higher stretch goals! \nWrapping up\nWell, that's all I wanted to say for now. If you are new to Kickstarter, check out my next post about how the whole process works. \nMichael and I are on our way to Chattanooga for the ConNooga convention running this weekend. He's the literary guest of honor and will be doing a number of sessions on the craft of writing. I'll be on a number of publishing related panels including one on Kickstarters! So if you're going to be in the area - stop by and say hello!",
        "url": "https://www.kickstarter.com/projects/236568870/the-house-witch-a-humorous-romantic-fantasy/posts/4317952",
        "likes_count": 17,
        "comments_count": 4,
        "comments": [
          {
            "text": "How can I add on the paperbacks if I backed the early bird one? It won't let me back into that part",
            "commenter": "Tiffani Gunter",
            "timestamp": "February 20, 2025 1:47 AM AWST",
            "datetime": "1739987272",
            "relative_time": "5 days ago"
          },
          {
            "text": "I would also like to know. Thank you :)",
            "commenter": "Katie Kubisty",
            "timestamp": "February 20, 2025 1:55 AM AWST",
            "datetime": "1739987718",
            "relative_time": "5 days ago"
          },
          {
            "text": "Interesting. I didn't know that Kickstarter won't let you add add-ons to reward levels that are locked down - but no worries. You'll be able to do this during the \"survey process\" - The whole reason we use BackerKit for Surveys/late backers is that it's more sophisticated than Kickstarter. So you'll just do it AFTER The Kikcstarter when you are filling out your survey.",
            "commenter": "Robin Sullivan",
            "timestamp": "February 20, 2025 2:21 AM AWST",
            "datetime": "1739989298",
            "relative_time": "5 days ago"
          },
          {
            "text": "I talk about this a bit in the recent update \"A newbies guide to Kickstarters\" in the \"Survey section\"",
            "commenter": "Robin Sullivan",
            "timestamp": "February 20, 2025 2:22 AM AWST",
            "datetime": "1739989366",
            "relative_time": "5 days ago"
          }
        ]
      },
      {
        "update_number": "UPDATE #1",
        "title": "Holy Moly! We've Done It!",
        "creator": "Delemhach A.K.A Emilie Nikota\nFebruary 13, 2025",
        "date": "February 13, 2025",
        "content": "WOAH!\n\nWe have already passed our funding goal, and it has only been a little more than a day since we launched! \n\nEveryone, I am completely awed at all of your generosity and support, and I cannot thank you enough for contributing to this project! \n\nOur next steps, as you probably have guessed, will be putting our heads together to come up with some stretch goals to aim for. So stay tuned for what we will be trying to include for all of you incredible backers! \n\nAgain, a massive thank you to everyone who has joined this adventure, and I am so thrilled to know that we will be able to deliver those special books to you in the coming months, with hopefully some nice extras for you to enjoy. \n\nTake care of yourselves, friends! \n\nWe should hopefully have more news in the near future! \n\nUntil then, you have my best wishes.\n\nCheers!\nDelemhach",
        "url": "https://www.kickstarter.com/projects/236568870/the-house-witch-a-humorous-romantic-fantasy/posts/4313029",
        "likes_count": 32,
        "comments_count": 4,
        "comments": [
          {
            "text": "I fell in love with these books and the world that they transported me to. Thank you !",
            "commenter": "Angela Caltabiano",
            "timestamp": "February 14, 2025 1:46 AM AWST",
            "datetime": "1739468766",
            "relative_time": "11 days ago"
          },
          {
            "text": "It's so breat seeing people's love for these books.",
            "commenter": "Robin Sullivan",
            "timestamp": "February 20, 2025 7:38 PM AWST",
            "datetime": "1740051506",
            "relative_time": "5 days ago"
          },
          {
            "text": "This is probably going to sound weird, but I'm so incredibly proud of not only this amazing community that has backed you, but of you as well, Delemhach, for not giving up on a series you clearly have a lot of passion for!",
            "commenter": "Rebecca",
            "timestamp": "February 13, 2025 5:24 AM AWST",
            "datetime": "1739395472",
            "relative_time": "12 days ago"
          },
          {
            "text": "Agreed to everything you said!",
            "commenter": "Robin Sullivan",
            "timestamp": "February 13, 2025 8:22 PM AWST",
            "datetime": "1739449373",
            "relative_time": "12 days ago"
          }
        ]
      }
    ]
  }
}