{
  "url": "https://www.kickstarter.com/projects/stevegadlin/the-fart-pedal-number-two",
  "campaign_details": {
    "funding_period_text": "Funding period\nJan 23 2025 - Feb 22 2025 (30 days)",
    "funding_start_date": "2025-01-23T08:59:31-05:00",
    "funding_end_date": "2025-02-22T08:59:31-05:00",
    "funding_duration_days": 30,
    "pledged_amount": "$72,340",
    "funding_goal": "$60,000",
    "backers_count": "271"
  },
  "updates": {
    "count": 5,
    "content": [
      {
        "update_number": "UPDATE #11",
        "title": "Hundreds of Fart Pedals in production!",
        "creator": "Steve Gadlin\nMarch 7, 2025",
        "date": "March 7, 2025",
        "content": "Fart Pedals Ahoy!\nHowdy, Farty Friends. Just wanted to throw a few more updates your direction. My purchase order for 700 Fart Pedals is with the manufacturer, and everything is moving according to schedule. I'll be heading to the plant in Michigan to pick up the pedals in person, and hopefully get to watch some come off the line. I'll be sure to take some photos!\nSpeaking of photos - our final prototype was the subject of its own little photo shoot last week.\nI'll be updating the website with new photos once they're done being color corrected and touched up.\nPackaging has always been super important to me. When you receive your Fart Pedal, I want it to feel like a solid product, packed like something you'd buy at the Apple Store. I've put a lot of time, design, and money into making the packaging a part of the experience. I am SO happy with this design. The boxes look great. Here are a few shots of the external renderings:\nThe INSIDE design is actually loaded with a couple of Easter Eggs, and I'd rather you discover those for yourself - so I won't be posting any photos here.\nNew Videos!\nI've published the first couple of videos from my recent shoot at Fort Knox Studios, in Chicago. I'll continue to post these on my YouTube channel, and on my Instagram account. If you don't follow those yet, please check 'em out!\nClick the thumbnails to watch the videos!\nThank you!\nThanks again for your support! I'm committed to staying as transparent as possible about how things are moving along until those pedals are in your hands. So please feel free to reach out if you have any questions!\nBest,\nSteve Gadlin\nsteve@fart.pizza",
        "url": "https://www.kickstarter.com/projects/stevegadlin/the-fart-pedal-number-two/posts/4326453",
        "likes_count": 3,
        "comments_count": 0,
        "comments": []
      },
      {
        "update_number": "UPDATE #10",
        "title": "Final Prototype - Check!",
        "creator": "Steve Gadlin\nMarch 2, 2025",
        "date": "March 2, 2025",
        "content": "Our final prototype is in hand!\nHowdy, Farty Friends!\nJust wanted to keep you posted on the latest Fart Pedal: Number Two developments. We’re one week into our post-Kickstarter world, and things are moving. Stickers and labels have been delivered. Our packaging design is in its final phases. Fart Pedal socks have been delivered!\nAnd most importantly… our final prototype has been shipped to me. Notice we’re up to two knobs (now green!) and two switches! Now you can toggle pitch tracking on and off, and toggle between wet and dry farts.\nWhen it arrives on Monday, I’ll take three important steps:\nI’ll test it out to make sure it works as expected - then give the green light for our first real production run.\nI’ll drive it over to a local product photographer to get fantastic new shots for our website.\nI’ll ship it to a company for measurements so they can create custom foam inserts for the packaging so it fits nice and snug.\nIn the meantime, I hit my first production snag… but I hope it’s a small one. My Whoopee Cushion vendor has informed me that my custom whoopee cushions won’t be in stock until mid-April. If I’m ready to ship pedals before then, I’ll give everyone the option of waiting for their whoopee cushion, or getting their pedal shipped without it.\nI can imagine that’s going to be a very tough choice to make!\nMore updates soon!! The packaging design is coming together real nicely, and I look forward to sharing it with you next week.\nBest,\nSteve Gadlin",
        "url": "https://www.kickstarter.com/projects/stevegadlin/the-fart-pedal-number-two/posts/4326445",
        "likes_count": 3,
        "comments_count": 2,
        "comments": [
          {
            "text": "If we elect to get the pedal before the whoopee cushion arrives, will it be available afterwards?",
            "commenter": "Josh Nesoff",
            "timestamp": "March 2, 2025 11:50 PM AWST",
            "datetime": "1740930623",
            "relative_time": "11 days ago"
          },
          {
            "text": "Oh, of course, for those who still want them! But I am hoping this will not be an issue.",
            "commenter": "Steve Gadlin",
            "timestamp": "March 3, 2025 12:31 AM AWST",
            "datetime": "1740933086",
            "relative_time": "11 days ago"
          }
        ]
      },
      {
        "update_number": "UPDATE #9",
        "title": "One more \"thank you\" from Scott Ian (Anthrax, Mr. Bungle)!",
        "creator": "Steve Gadlin\nFebruary 23, 2025",
        "date": "February 23, 2025",
        "content": "Scott Ian wants to thank you!\nAbout a year ago I noticed a post on Scott Ian's Instagram account showing off his rig while on tour. One of the photos showed a Fart Pedal on his board.\nI'm a big Mr. Bungle fan, and it was so neat to see evidence of The Fart Pedal on a big guitarist's board out in the wild.\nI noticed he was on Cameo last week, and thought who better to create a Thank You video for all of the awesome Kickstarter supporters? Here's an edited version of his video - he had a bit at the top and the bottom just for me, and hopefully we'll be getting a Number Two on his pedal board very soon.\nSo hey, here's a thank you video from super famous guitarist, Scott Ian!\nMore videos coming very soon!\nI just got back from a video shoot this afternoon with a fantastic guitarist. She shows off the Number Two's pitch tracking abilities with a bunch o' fun riffs. I'll be sharing these videos on the Instagram and YouTube channels very soon!\nMore updates soon!\nThanks, friends!\nSteve Gadlin\nsteve@fart.pizza",
        "url": "https://www.kickstarter.com/projects/stevegadlin/the-fart-pedal-number-two/posts/4320797",
        "likes_count": 2,
        "comments_count": 0,
        "comments": []
      },
      {
        "update_number": "UPDATE #8",
        "title": "We did it! The Fart Pedal: Number Two Kickstarter is a wrap!",
        "creator": "Steve Gadlin\nFebruary 22, 2025",
        "date": "February 22, 2025",
        "content": "Aaaaaand... that's a wrap!\nThirty days ago, at 6AM California time, I nervously clicked a \"launch project\" button before hoofing it to the Anaheim Convention Center to exhibit at NAMM. I was treated to some instant gratification as our project hit 50% of its goal very quickly.\nThe following weeks were very stressful as I considered all sorts of scenarios. Did I set the goal too high? What would I do if we could not reach it? Thankfully, a second wind helped push the project past its goal with a week to spare.\nYesterday I started shopping - loading up on all of the materials I'll need to start fulfilling rewards. I put in an order for Whoopee Cushions, stickers, labels, mailers, and guitar picks. I created a purchase order and sent it to my manufacturer to start production of hundreds of Fart Pedals. Over the next few weeks I'll transform my basement into a fulfillment center. I'll be folding boxes, sorting t-shirts, and otherwise getting ready to ship those rewards.\nI'm never comfortable in hustle mode - spending my days thinking of new and un-obnoxious ways to bring new backers to the Kickstarter. But I'm very comfortable in this other hustle mode - working my butt off to wrap the project and ship exciting packages to your door. This is the fun part for me - getting all of the pieces in place to put Fart Pedals in your hands. I truly can not wait to see the cool things you do with them.\nToday I'm headed to Fort Knox, a rehearsal space in Chicago, to record a new series of videos that demonstrate The Fart Pedal: Number Two's pitch tracking capabilities. Hopefully I'll start releasing those on our YouTube and Instagram accounts in early March. I'll post some early photos in an update here soon.\nYou'll be receiving a backer survey via email - it's very important that you fill this out as soon as you can. This will give me access to your shipping address, so that I can send you your rewards. Don't sleep on the backer survey!\nAlso - I've launched a brand new design at TheFartPedal.com. You'll see that you can pre-order The Fart Pedal: Number Two directly from the site. No fear, I'm committed to shipping all Kickstarter rewards before fulfilling any of those pre-orders. But since I'll be ordering more inventory than I need to fulfill the Kickstarter, I wanted to give latecomers a chance to hop in line. You can also snag t-shirts or socks if you missed them here.\nAlright!@# Hustle hustle. Stay tuned to this space for updates, and alerts when pedals are shipping.\nI appreciate you,\nSteve Gadlin\nsteve@fart.pizza",
        "url": "https://www.kickstarter.com/projects/stevegadlin/the-fart-pedal-number-two/posts/4319870",
        "likes_count": 3,
        "comments_count": 0,
        "comments": []
      },
      {
        "update_number": "UPDATE #7",
        "title": "Professional Wrestling Legend Mick Foley wants to say thanks.",
        "creator": "Steve Gadlin\nFebruary 17, 2025",
        "date": "February 17, 2025",
        "content": "",
        "url": "https://www.kickstarter.com/projects/stevegadlin/the-fart-pedal-number-two/posts/4315769",
        "likes_count": 0,
        "comments_count": 0,
        "comments": []
      }
    ]
  }
}