{
  "url": "https://www.kickstarter.com/projects/inzeth/the-ultimate-miata-mx-5-3d-printed-hard-top-make-100",
  "campaign_details": {
    "funding_period_text": "Funding period\nFeb 1 2025 - Mar 3 2025 (30 days)",
    "funding_start_date": "2025-01-31T12:33:17-05:00",
    "funding_end_date": "2025-03-02T12:33:17-05:00",
    "funding_duration_days": 30,
    "pledged_amount": "€4,747",
    "funding_goal": "€1,000",
    "backers_count": "25"
  },
  "updates": {
    "count": 2,
    "content": [
      {
        "update_number": "UPDATE #2",
        "title": "All forms complete - finishing the PDF and files cut before sending STL!",
        "creator": "Inzeth\nMarch 9, 2025",
        "date": "March 9, 2025",
        "content": "Hey everyone,\n\nJust wanted to write a quick note to keep you update as I know many of you are waiting this STL ! (and i'm not going anywhere ;) )\nEveryone who asked a STL answered the Form so I now have all the data.\nFor now the BambuLab 256^3 is ready (it was before the campaign but did a few adjustment) and I'm writing down the PDF documentation, which will contain\nassembly process\nrivets specs\nwindow mold/template\nprint optimization\nglue/mastic possibilities\nscrews and clamps mounting\nSo with this guide you should have everything I learnt from the past 2 years and make the decision based on your time/knowledge.\nI must precise that I'm not a professional car-painter and I know more theory than practice, so you should all consider by yourself what's the best to do. Those are just my feedback about what worked well and what didn't.\nAlso, I must precise that you wont find any print settings as this highly depends on your environment, workshop, season of the year, printer, filament... There are so many parameters I prefer to give you none rather than leading you in errors.\nDo some test prints with small parts until you are happy with the result !\nThe Dash Hoods requried some modification as it was not \"that\" great (I'm a perfectionist). But to avoid longer wait I will send over the current version and send you an update once it's done :) \n\nThank you all. I keep you updated.",
        "url": "https://www.kickstarter.com/projects/inzeth/the-ultimate-miata-mx-5-3d-printed-hard-top-make-100/posts/4332804",
        "likes_count": 6,
        "comments_count": 0,
        "comments": []
      },
      {
        "update_number": "UPDATE #1",
        "title": "Campaign is over, thanks for your trust! Here are the next steps.",
        "creator": "Inzeth\nMarch 3, 2025",
        "date": "March 3, 2025",
        "content": "Hello everyone,\n\nIt's sunday evening here in France and while I'm taking care of the kids I do a quick post to give some news and what's coming next / when / how...\nFor those who purchased a STL file\nMost of the files will be sent \"like that\" as described in the Kickstarter (meaning no cut).\nBut the Hard-Top is only sent cutted down. For now the cutted plate is optimized for a BambuLab (25 cube) and I will create a pool tomorrow to know what are the other sizes asked.\n\nBecause some people asked 30x3, or 40x3 etc... and doing many cut is a very long process !\nOnce all payments are confirmed by Kickstarter I will proceed to the sending of the file, you will be able to get all the cut sizes.\nPrinted Kits (hard top or other files)\nOnce payments are confirmed I will proceed to the production and shipping! Tracking number will be provided.\nThe only part that require more work is the Fastback, which I am working on since the start of the campaign, and I will share the progress over time.\nNext project the Cutting tool\nI got some questions about the cutting tool as some of you would like to use it!\nFor now I can't tell when it will be ready, I have more things to fix and need to create the way to access it also.\nBut I will create a post here once I can share more about it :) stay tuned.\n\nThanks",
        "url": "https://www.kickstarter.com/projects/inzeth/the-ultimate-miata-mx-5-3d-printed-hard-top-make-100/posts/4327097",
        "likes_count": 3,
        "comments_count": 2,
        "comments": [
          {
            "text": "Could you make a 220 x 220 x 250mm for the majority of us who own ender 3s?",
            "commenter": "Ben covington",
            "timestamp": "March 3, 2025 11:35 AM AWST",
            "datetime": "1740972902",
            "relative_time": "10 days ago"
          },
          {
            "text": "This is great news! Can't wait to start printing my hardtop. I am not sure where to vote but I would love a set optimized for 300x300mm in addition as it would save me some time.",
            "commenter": "Thomas C. Love",
            "timestamp": "March 3, 2025 3:58 AM AWST",
            "datetime": "1740945539",
            "relative_time": "11 days ago"
          }
        ]
      }
    ]
  }
}