{
  "url": "https://www.kickstarter.com/projects/651997588/tsupy-docking-station-revolutionize-your-workspace",
  "campaign_details": {
    "funding_period_text": "Funding period\nFeb 11 2025 - Mar 13 2025 (30 days)",
    "funding_start_date": "2025-02-11T04:34:56-05:00",
    "funding_end_date": "2025-03-13T04:34:56-04:00",
    "funding_duration_days": 30,
    "pledged_amount": "HK$ 285,716",
    "funding_goal": "HK$ 10,000",
    "backers_count": "320",
    "days_left": 25
  },
  "updates": {
    "count": 1,
    "content": [
      {
        "update_number": "UPDATE #1",
        "title": "Celebrating Success 🎉",
        "creator": "TSUPY\nMarch 14, 2025",
        "date": "March 14, 2025",
        "content": "Dear Tsupy backers,\nThe Kickstarter campaign has come to a perfect conclusion, created collectively by 313 backers! The success of this campaign far exceeded our expectations, once again allowing us to feel the enthusiasm of backers from around the world!\nWhat’s NEXT?\nThe survey for your order info\nNormally it takes 7 days for Kickstarter to collect funds from backers, then another 7 days to process. So we will send you the fulfillment survey to collect your order information after 2 weeks..\nWhen will I receive Tsupy?\nWe will commence the production of the Tsupy in early April and plan to start shipping in mid-May 2025. According to the scheduled timeline, we anticipate that everyone should receive their Tsupy by May to June 2025!\nHere is an overview of the steps Kickstarter will take:\nIf a pledge fails to collect, they will send backers periodic email reminders, and display an “Action Needed” banner when you log into the Kickstarter account from which you pledged. By following the link on any of these communications, you will be guided through the following steps to resolve your payment issues:\n1. Check that you’ve entered a valid credit card number and the correct expiration date.\n2. Make sure the card has not expired.\n3. Confirm that your billing information is correct.\n4. Make sure you haven't exceeded the credit limit on your card.\nIf everything checks out and your pledge still can't be processed then it’s possible that your bank put a hold on the charge. Sometimes banks will decline charges if they don't align with a card holder’s regular spending patterns. Therefore, as a final resort you may need to contact your bank to ask that they process this charge before asking Kickstarter to process your payment again.\nIf you have further issues on payment, feel free to reach out to Kickstarter support team at www.kickstarter.com/contact.\nWhat happens if collection issues are not resolved?\nIf you don't resolve your payment issues within seven days of the project's deadline, your pledges are unfortunately dropped.\nStay tuned for the next survey update!\nTsupy Team",
        "url": "https://www.kickstarter.com/projects/651997588/tsupy-docking-station-revolutionize-your-workspace/posts/4336954",
        "likes_count": 5,
        "comments_count": 2,
        "comments": [
          {
            "text": "Thanks for the update, Kind regards",
            "commenter": "Nicola Tragni",
            "timestamp": "March 15, 2025 2:19 AM AWST",
            "datetime": "1741976363",
            "relative_time": "10 days ago"
          },
          {
            "text": "❤️",
            "commenter": "TSUPY",
            "timestamp": "March 18, 2025 5:22 PM AWST",
            "datetime": "1742289733",
            "relative_time": "6 days ago"
          }
        ]
      }
    ]
  }
}