{
  "url": "https://www.kickstarter.com/projects/twotrees/twotrees-ttc-h40-cnc-and-laser-engraving-for-all-your-projec",
  "updates": {
    "count": 3,
    "content": [
      {
        "update_number": "UPDATE #3",
        "title": "Great News: We’ve Reduced Shipping Costs to Bring You Better Deals! 💙📦",
        "creator": "TwoTrees\nMarch 5, 2025",
        "date": "March 5, 2025",
        "content": "Hey TwoTrees Backers,\nA huge THANK YOU for your incredible support! We’ve been closely following all your comments and feedback, and we truly appreciate every bit of it. International shipping, especially for a solid machine like the TTC-H40/H80, is no small feat, but we’re committed to making things easier for you. So, to show our gratitude and make things a little easier for you, we’ve decided to cover part of the shipping costs, reducing rates by over 30%! 🎉📦\nWe’ve updated the shipping rates for many regions, and the savings are significant. If your country isn’t listed in the table, don’t worry—just send us a message, and we’ll work out the best solution for you. (The shipping estimates are calculated in USD.)\nWe explored several shipping options, including FedEx, but honestly, the prices were outrageous—almost $1,600 to ship to the U.S.! Clearly, that wasn’t going to be a reasonable choice for most backers.\nHere’s a breakdown using the TTC-H80 Advanced package as an example: \n✅ Total weight (including machine & accessories): 80KG\n✅ Box dimensions: 238.5 × 43 × 30.5 cm\nTo bring costs down while ensuring safe and timely delivery, we’ve opted for a sea freight + local distribution approach. Why?\n✅ Much lower overall shipping costs compared to express options like FedEx/DHL\n✅ Reduced taxes in some countries thanks to import processing at the warehouse\nWe know that every dollar counts, and we’re committed to making this campaign as accessible as possible. While we can’t eliminate shipping costs entirely, we’re doing everything we can to minimize the financial burden while ensuring your machine arrives safely and on time.\nIf you have any questions about shipping to your country, or if your country isn’t listed in our table, just reach out! We’ll do our best to find a solution.\nOnce again, we can't thank you enough for your unwavering support, patience, and trust in us.\nCheers,\nTwoTrees Team",
        "url": "https://www.kickstarter.com/projects/twotrees/twotrees-ttc-h40-cnc-and-laser-engraving-for-all-your-projec/posts/4329561",
        "likes_count": 11,
        "comments_count": 6,
        "comments": [
          {
            "text": "You legends! Thank you for the effort. Those cost were stopping alot of people being able to get your cnc",
            "commenter": "Ethan Hammond",
            "timestamp": "March 6, 2025 2:18 AM AWST",
            "datetime": "1741198728",
            "relative_time": "5 days ago"
          },
          {
            "text": "Thanks for all the effort you’re putting in, much appreciated!😃",
            "commenter": "Laurens van Waardenburg",
            "timestamp": "March 6, 2025 2:01 AM AWST",
            "datetime": "1741197682",
            "relative_time": "5 days ago"
          },
          {
            "text": "The new shipping charge is a welcome help. Plus it shows that TT is listening to backers. Thanks guys! Now, can we talk about ditching the 500w spindle for ppl that got the two higher options and have no need for the 500w? Food for thought...",
            "commenter": "Kevin Culp",
            "timestamp": "March 5, 2025 10:52 PM AWST",
            "datetime": "1741186339",
            "relative_time": "5 days ago"
          },
          {
            "text": "Hi Kevin. Thank you for your support! We’ve added the 20W laser module as an add-on option. If you’ve backed the Premium package and plan to add the 20W laser, it’s actually more cost-effective to go for the Ultra package—you’ll get the 500W spindle included as an extra bonus.",
            "commenter": "TwoTrees",
            "timestamp": "March 6, 2025 10:15 AM AWST",
            "datetime": "1741227312",
            "relative_time": "4 days ago"
          },
          {
            "text": "The shipping cost is $259 Dollars ?????",
            "commenter": "Johnny",
            "timestamp": "March 5, 2025 10:03 PM AWST",
            "datetime": "1741183389",
            "relative_time": "5 days ago"
          },
          {
            "text": "Hi Johnny. Thank you for your support! To give you a clearer picture, let's take the TTC-H80 Advanced package as an example: ✅ Total weight (including machine & accessories): 80KG ✅ Box dimensions: 238.5 × 43 × 30.5 cm With this size and weight, shipping isn’t cheap. A direct FedEx quote exceeds $1600, and our initial shipping estimates were close to $350. The $259 rate you see is after our subsidy to help reduce the cost for backers. If we manage to secure a lower rate with another shipping provider, we’ll be sure to update you!",
            "commenter": "TwoTrees",
            "timestamp": "March 6, 2025 10:12 AM AWST",
            "datetime": "1741227128",
            "relative_time": "4 days ago"
          }
        ]
      },
      {
        "update_number": "UPDATE #2",
        "title": "Get Involved & Earn Rewards! 🎉 5% Cashback + Win CNC Bits!",
        "creator": "TwoTrees\nFebruary 25, 2025",
        "date": "February 25, 2025",
        "content": "Hey Backers,\nA big THANK YOU for all your support! 🙏 We’ve received so many fantastic comments and suggestions, and we’re taking everything on board to make sure we’re giving you the best possible experience. 🙌\nSome of you mentioned wanting more ways to get involved, so we’ve got two exciting opportunities to share with you.\n1️⃣ SHARE TTC-H40 WITH FRIENDS & WIN 5% CASHBACK 💸\nWe know that word-of-mouth is powerful, and we truly appreciate you spreading the word. 🌍\nHere’s how it works:\nSign up on Kickbooster using the link below and get your referral link.\nFor each successful referral through your link, you’ll receive 5% cashback.\nAfter the campaign ends, we’ll send your cashback directly through Kickbooster. 🙌\nClick here to get your referral link: https://twotrees-ttc-h40cnc-laser.kickbooster.me/boost/twotrees-ttc-h40cnc-laser \n2️⃣ COMMENT & WIN 🏆\nWe want to hear from you! What do you love most about the TTC-H40/H80? 💬Your feedback not only helps us know what features matter most but also guides our future product development. 💡\nDrop a comment on our Kickstarter page with your favorite feature.\n10 lucky backers will be randomly selected to win a set of 40 PCS End Mills CNC Router Bits (worth $54). 🎉\nThank you so much for being part of this journey with us. We’re excited to continue hearing from you and working hard to make the TTC-H40/H80 even better!\nCheers,\nTwotrees Team",
        "url": "https://www.kickstarter.com/projects/twotrees/twotrees-ttc-h40-cnc-and-laser-engraving-for-all-your-projec/posts/4322359",
        "likes_count": 11,
        "comments_count": 11,
        "comments": [
          {
            "text": "I'd like the big size of the working area!!",
            "commenter": "info@topspin.it",
            "timestamp": "March 8, 2025 4:19 PM AWST",
            "datetime": "1741421999",
            "relative_time": "2 days ago"
          },
          {
            "text": "I was looking for something special and useful like this project!",
            "commenter": "Domenico Lacalamita",
            "timestamp": "February 28, 2025 4:53 PM AWST",
            "datetime": "1740732809",
            "relative_time": "10 days ago"
          },
          {
            "text": "Quello che cercavo, una CNC semplice, flessibile con un'area di lavoro ampia e con un prezzo accessibile. Penso mi darà grandi soddisfazioni.",
            "commenter": "Antonio",
            "timestamp": "February 28, 2025 2:16 AM AWST",
            "datetime": "1740680193",
            "relative_time": "11 days ago"
          },
          {
            "text": "is there an option to order some bits with the router for commen use and maybe some specific uses like thick wood or styrodur sheets (10 cm?) or at least a direction to know what kind of tools you need in the router",
            "commenter": "Stefan havik",
            "timestamp": "February 27, 2025 11:20 PM AWST",
            "datetime": "1740669658",
            "relative_time": "11 days ago"
          },
          {
            "text": "I was wondering if y’all could implement AI learning and precision into the software itself and also just maybe some kind of printing option where you could print it and engrave it and cut it and laser cut it. However you wanted to do maybe implement a six axis these are just suggestions. Thank you so much. I’m glad to back this project.",
            "commenter": "Brent Williams",
            "timestamp": "February 26, 2025 7:04 PM AWST",
            "datetime": "1740567885",
            "relative_time": "12 days ago"
          },
          {
            "text": "I have a small hobby cnc. I have wanted to expand to a larger quality cnc. Then the TTC-H40 popped up. I love the price. It was something that was somewhat holding me back. When I saw all the great features and work area, I was pretty much sold. My next concern was customer support. I researched the TwoTrees customer support and it was all good reports from customers. That was what pushed me forward to purchase this cnc over other cnc's. Features, quality, price, and after purchase customer support. I am definitely anxious to get started with this step up in my cnc experience. I'm sure there will be many others who feel as I do about this machine and Twotrees.",
            "commenter": "Dennis Swords",
            "timestamp": "February 25, 2025 10:37 PM AWST",
            "datetime": "1740494251",
            "relative_time": "13 days ago"
          },
          {
            "text": "Could you link the pages where you found the positive feedback ? I am looking for ways to be reassured that everything is going to be ok as I found exactly the opposite to what you have found in my own research. Thank you !",
            "commenter": "EntropySponge",
            "timestamp": "February 25, 2025 11:57 PM AWST",
            "datetime": "1740499020",
            "relative_time": "13 days ago"
          },
          {
            "text": "I love how effortlessly you can swap tools on this machine. Switching from the spindle, or router to the laser. And I definitly will try to experiment with my own tools. Also, I was thinking about adding a bracket for a shopvac. Anyways,.. can't wait!",
            "commenter": "Pieter",
            "timestamp": "February 25, 2025 8:43 PM AWST",
            "datetime": "1740487409",
            "relative_time": "13 days ago"
          },
          {
            "text": "Two Tree ask why you buy our CNC TTC-H40, okay… First, I‘m was looking for a smaller CNC, but not too small. Second, I‘m was l looking for a completly CNC, not a kit. Thirdly, I‘m was looking for a good price-performance. I found onefinity, but hmm, for me and my claim and projects near to it‘s expensiv. Also with the shipping cost to Europe. But they have a lot off Support… Now I found the Two Trees TTC H40 For me the same good Design as onefinity. A bit smaller in material etc. But also smaller in Price and shippmend cost. For me and my need the best choice. Okey ttc hasen‘t the big Community with help with Things and do. But it shine i’ts a exciting CNC, so I‘m thinking it‘s sure to get a big Community for this wonderfull CNC! Big, but you can it dissamble in a small Package when not in use. Stable yet slim. Possibility to Chance Tools Like div. Router or Laser. I‘m happy. Thank you TwoTrees!",
            "commenter": "Hürlimann",
            "timestamp": "February 25, 2025 7:42 PM AWST",
            "datetime": "1740483746",
            "relative_time": "13 days ago"
          },
          {
            "text": "Something about this machine convinced me. I think it is the construction and practical handling of the machine. And I believe that it’s efficiency in doing what it was made to do. I am happy to belong to the first buyers of this machine. Thanks Two Trees",
            "commenter": "Angelo Pereira",
            "timestamp": "February 25, 2025 6:56 PM AWST",
            "datetime": "1740481003",
            "relative_time": "13 days ago"
          },
          {
            "text": "Wishing I had the machine so as I could create. Patiently waiting but not patient 🥺 please send me release date🙏",
            "commenter": "Gregg Witt",
            "timestamp": "February 25, 2025 6:41 PM AWST",
            "datetime": "1740480118",
            "relative_time": "13 days ago"
          }
        ]
      },
      {
        "update_number": "UPDATE #1",
        "title": "We’re Fully Funded – In Just 10 Minutes! 🎉THANK YOU!",
        "creator": "TwoTrees\nFebruary 19, 2025",
        "date": "February 19, 2025",
        "content": "Dear TwoTrees Backers,\nWow! We are absolutely blown away by your incredible support. Thanks to all of you, we reached 100% funding in just 10 minutes! 🏆✨\nOver the past few hours, we’ve received a flood of messages, questions, and suggestions from you. Many of you have expressed interest in additional accessories, and we hear you loud and clear! 👂👀We’re carefully reviewing all of your feedback and exploring ways to bring you more of what you need.🙌💥\nWe’ve also noticed the overwhelming curiosity about different aspects of the machine. From specifications to compatibility, we’re collecting all your questions and will be addressing them as soon as possible. Your engagement means everything to us, and we’re committed to keeping you updated every step of the way.💪✨\nThank you for making this launch such an amazing success.💨💯\nStay tuned for more updates soon!\nWith gratitude,\nTwoTrees Team",
        "url": "https://www.kickstarter.com/projects/twotrees/twotrees-ttc-h40-cnc-and-laser-engraving-for-all-your-projec/posts/4317802",
        "likes_count": 22,
        "comments_count": 4,
        "comments": [
          {
            "text": "Happy for full funding. How and When will we be able to get access to our New toy",
            "commenter": "Gregg Witt",
            "timestamp": "February 24, 2025 4:31 AM AWST",
            "datetime": "1740342662",
            "relative_time": "15 days ago"
          },
          {
            "text": "Definitely excited about this project. Appreciating the feedback from other backers to understand possible limitations of the setup and need for additional options. Really appreciate efforts to keep transport costs down, I reckon I might own a big boat by now with shipping costs to Oz. Any chance Amazon can't be involved or are all your nuts already in the fire. Anyway jokes aside, keen to understand best cnc tooling and output control and compatibility for laser.",
            "commenter": "bruce powell",
            "timestamp": "February 19, 2025 7:33 PM AWST",
            "datetime": "1739964830",
            "relative_time": "19 days ago"
          },
          {
            "text": "Congratulation on a successful launch. I can’t wait to get my H40 ultra and put it to work. Question does any of the included programs allow you to scan a picture and carve tahr image?",
            "commenter": "Scott Murphy",
            "timestamp": "February 19, 2025 6:45 PM AWST",
            "datetime": "1739961923",
            "relative_time": "19 days ago"
          },
          {
            "text": "considerate di offrire un set punte",
            "commenter": "olivio",
            "timestamp": "February 19, 2025 5:11 PM AWST",
            "datetime": "1739956292",
            "relative_time": "19 days ago"
          }
        ]
      }
    ]
  }
}