{
  "url": "https://www.kickstarter.com/projects/voltamagneticcharger/voltago-max-27000-mah-of-fast-charging-portable-powerhouse",
  "updates": {
    "count": 2,
    "content": [
      {
        "update_number": "UPDATE #2",
        "title": "Good News - Early Fulfilment | VoltaGo MAX Power Bank Test Samples & Detachable Wireless Watch Charger",
        "creator": "Volta Charger\nFebruary 11, 2025",
        "date": "February 11, 2025",
        "content": "Good news, everyone!\nI hope you're all doing well. Thank you for your unwavering support and love!\nEarly Fulfilment - YippppEEEEEE!\nOur factory has resumed production, and we are on track for early fulfilment of the first batch of VoltaGo MAX Power Banks! 🎉\nWe’re accelerating the process to ensure early delivery. Thanks to those who reserved a spot and our loyal Volta Charger customers, we were able to pay for pre-production last year, making this early fulfilment possible.\nCustoms Duties and Taxes\nAt Volta Charger, customer satisfaction is our priority. To ensure smooth and timely delivery, we've put measures in place to ship from warehouses in the US, UK, EU (NL), AU, and HK, helping customers avoid unnecessary customs fees, taxes, and duties—especially in the EU region.\nVoltaGo MAX Test Samples\nAdditionally, more sample test units have arrived at our fulfilment hub! Watch the video below to see how we’re sending them out to our backers for testing.\nModular & Detachable SmartWatch Wireless Charger\nI also have an exciting add-on product to share with you: a modular and detachable smartwatch wireless charger.\nVideo \nWatch the video below for all the info about the Modular Smart Watch Charger and the Test samples of the VoltaGo MAX.\nJoin the Conversation and Our Communities \nJoin Discord Channel: Click Here to Join. \nJoin Volta Insiders Facebook group: Click Here to Join. \nJoin Volta's WhatsApp Community: Click Here to Join.\nThank you everyone. You are all amazing and looking forward to seeing how you use your VoltaGo MAX Power Bank. \nAdedayo. \nVolta Charger",
        "url": "https://www.kickstarter.com/projects/voltamagneticcharger/voltago-max-27000-mah-of-fast-charging-portable-powerhouse/posts/4311649",
        "likes_count": 20,
        "comments_count": 6,
        "comments": [
          {
            "text": "Would be nice to have a test model if any spare? Is it just an apple watch charger or will other models be available?",
            "commenter": "Martin Bywater",
            "timestamp": "February 14, 2025 4:27 AM AWST",
            "datetime": "1739478421",
            "relative_time": "11 days ago"
          },
          {
            "text": "Backer #11 and pre order. If you want to send me one for testing I'd be delighted 😁",
            "commenter": "Derek Darling",
            "timestamp": "February 11, 2025 11:54 PM AWST",
            "datetime": "1739289280",
            "relative_time": "14 days ago"
          },
          {
            "text": "Also...I ment to ask??? On that PB that I'm backing..do you know from 100 charge and if I don't used for a year wath is the leakage of power or can hold on at least 95 percent?",
            "commenter": "Samuel Torres",
            "timestamp": "February 11, 2025 9:42 PM AWST",
            "datetime": "1739281366",
            "relative_time": "14 days ago"
          },
          {
            "text": "Hello Samuel, Thank you for backing us and for your support. Yes, it will hold charge and does not leak power overtime when not in use.",
            "commenter": "Volta Charger",
            "timestamp": "February 11, 2025 9:44 PM AWST",
            "datetime": "1739281489",
            "relative_time": "14 days ago"
          },
          {
            "text": "Hi if you want send me one for texting. I'm available",
            "commenter": "Samuel Torres",
            "timestamp": "February 11, 2025 9:35 PM AWST",
            "datetime": "1739280912",
            "relative_time": "14 days ago"
          },
          {
            "text": "Thanks for your support. We sure will keep you posted towards the end of the campaign.",
            "commenter": "Volta Charger",
            "timestamp": "February 11, 2025 9:45 PM AWST",
            "datetime": "1739281509",
            "relative_time": "14 days ago"
          }
        ]
      },
      {
        "update_number": "UPDATE #1",
        "title": "100% Funded in Just 7 Minutes – Thank You! 🚀",
        "creator": "Volta Charger\nJanuary 23, 2025",
        "date": "January 23, 2025",
        "content": "Hey Backers👋\n\nWow—VoltaGo MAX was 100% funded in just 7 minutes! 🚀🔥 We are absolutely blown away by your incredible support and can’t thank you enough for making this launch such an amazing success! 🎉\nA huge thank you to every backer—whether you’ve been with us from past campaigns or are joining the Volta family for the first time. Your trust and enthusiasm drive us to keep creating the best charging solutions possible. ⚡🔋\nThis is just the beginning, and we’re beyond excited to bring VoltaGo MAX to you! We’ll be sharing more updates throughout the campaign, but for now, we just want to say THANK YOU for believing in this project and helping us bring it to life. 🙌\nLet’s keep the momentum going! If you know someone who would love to be part of this journey, share the campaign link and help us take VoltaGo MAX even further! 🌍⚡\nWith gratitude,\nThe Volta Team ⚡\nOther projects we love\nLooktech AI Glasses: The Smart Glasses That Truly Know YouMeet Looktech AI Glasses—your intelligent companion that’s always there for you. It remembers your preferences, routines, and grows with you.\nGet real-time AI assistance, capture memories, answer calls, and enjoy music—all hands-free.\nPersonalized AI Assistance\nHigh-definition 13MP Camera\nHands-Free Control\n14-hour battery life\nPrivacy-first design\nWide choice of lenses\nLightweight\n\nGet Your Discount Now\nTake Control with MYHIXEL III: The Advanced Solution for PE & ED\nMYHIXEL III combines advanced teMYHIXELy with doctor-designed programs to help men overcome premature ejaculation (PE) and enhance erections (ED). It’s the latest innovation from MYHIXEL, a brand trusted by over 100,000 users worldwide for advancing male sexual wellness.\nAdvanced Warming System: Reaches up to 38°C in under 5 minutes, mimicking realistic sensations for effective training and enhanced comfort.\nCustomizable Vibration Settings: Offers 5 unique vibration patterns, strategically positioned to target the glans for a more intense and effective experience.\nDoctor-Designed Therapy Programs: Includes structured, science-backed programs for PE and ED to provide clear guidance and build lasting confidence.\nRealistic Sleeve Design: Comes with anatomically crafted sleeves that mimic real sensations, offering a natural and immersive training experience.\nPrivate and Tailored Experience: With doctor-designed, personalized programs, users can progress at their own pace in a private setting, with no side effects and the need for doctor visits.\n\nGet Yours Now\nGoChess: The Most Powerful Chess Board Ever Invented\nExperience the magic with the world’s first fully-robotic smart chess board, with self-moving pieces & color-coded coaching lights.\nGoChess promises to revolutionize the way chess is played and learned, be it face-to-face, online, or with AI.\n♞ Smart and Connected\n♞ Coaching Light system\n♞ Fully Robotic\n♞ Proprietary app\n♞ Slim design, pristine functionality\n♞ Two versions for convenience\n\nGet Yours Now",
        "url": "https://www.kickstarter.com/projects/voltamagneticcharger/voltago-max-27000-mah-of-fast-charging-portable-powerhouse/posts/4297490",
        "likes_count": 7,
        "comments_count": 4,
        "comments": [
          {
            "text": "Hello VOLTA team, what about strech goals combined with gifts for the backers when achieved ?",
            "commenter": "JohnZ",
            "timestamp": "January 27, 2025 1:22 AM AWST",
            "datetime": "1737912156",
            "relative_time": "29 days ago"
          },
          {
            "text": "Hello JohnZ, You will a free bundle (a 240W Max magnetic cable plus USB-C + a Carry Case + MagRing). All these items will be included in your survey (to confirm your final delivery address) and Power Bank order at the end of the campaign. All will be shipped together to you.",
            "commenter": "Volta Charger",
            "timestamp": "February 11, 2025 8:58 PM AWST",
            "datetime": "1739278692",
            "relative_time": "14 days ago"
          },
          {
            "text": "Congrats!",
            "commenter": "Henk Puister",
            "timestamp": "January 23, 2025 4:34 AM AWST",
            "datetime": "1737578086",
            "relative_time": "about 1 month ago"
          },
          {
            "text": "Thank you, Henk. We appreciate your support. You are amazing.",
            "commenter": "Volta Charger",
            "timestamp": "January 24, 2025 12:12 AM AWST",
            "datetime": "1737648740",
            "relative_time": "about 1 month ago"
          }
        ]
      }
    ]
  }
}