{
  "url": "https://www.kickstarter.com/projects/82605225/vortix-titanium-turbo-fan-turn-on-the-turbulence",
  "campaign_details": {
    "funding_period_text": "Funding period\nFeb 11 2025 - Mar 13 2025 (30 days)",
    "funding_start_date": "2025-02-11T04:41:00-05:00",
    "funding_end_date": "2025-03-13T04:41:00-04:00",
    "funding_duration_days": 30,
    "pledged_amount": "$66,681",
    "funding_goal": "$5,000",
    "backers_count": "1,064",
    "days_left": 32
  },
  "updates": {
    "count": 2,
    "content": [
      {
        "update_number": "UPDATE #2",
        "title": "Project Update: Thank You & Pledgebox Survey Coming Soon！",
        "creator": "ScopePro\nMarch 18, 2025",
        "date": "March 18, 2025",
        "content": "Dear Backers,\nWe are thrilled to announce that our project, Vortix Titanium Air Blower: Turn On the Turbulence, has officially come to a successful conclusion! First and foremost, we want to extend our deepest gratitude to each and every one of you for your incredible support, enthusiasm, and trust in bringing this innovative product to life. None of this would have been possible without you.\nIn one week, we will be sending out the Pledgebox survey to collect your shipping information and finalize shipping fees. Please keep an eye on your email inbox and complete the survey promptly to ensure a smooth delivery process. Your timely response will help us get your rewards to you as quickly as possible.\nOnce again, thank you for being a part of this exciting journey. We can’t wait for you to experience the power of the Vortix Titanium Air Blower!\nStay tuned for more updates, and feel free to reach out if you have any questions.\nPackage sample",
        "url": "https://www.kickstarter.com/projects/82605225/vortix-titanium-turbo-fan-turn-on-the-turbulence/posts/4339558",
        "likes_count": 23,
        "comments_count": 2,
        "comments": [
          {
            "text": "Thanks for the update",
            "commenter": "LarryG",
            "timestamp": "March 18, 2025 11:51 PM AWST",
            "datetime": "1742313100",
            "relative_time": "6 days ago"
          },
          {
            "text": "Wohoo, so excited :-)",
            "commenter": "Lassejulius",
            "timestamp": "March 18, 2025 7:37 PM AWST",
            "datetime": "1742297847",
            "relative_time": "6 days ago"
          }
        ]
      },
      {
        "update_number": "UPDATE #1",
        "title": "Vortix Titanium Air Blower: 100% Funded! 🎉",
        "creator": "ScopePro\nFebruary 12, 2025",
        "date": "February 12, 2025",
        "content": "Dear Backers,\nWe are thrilled to announce that the Vortix Titanium Air Blower has officially reached 100% funding! This milestone wouldn’t have been possible without your incredible support, and we want to thank every one of you for believing in us!\nThe Vortix is a high-quality titanium air blower designed to provide precise airflow control, enhancing your cleaning experience. Whether you’re cleaning photography or video equipment or maintaining electronic devices, it strikes the perfect balance between innovative design and top-tier performance.\nOnce again, thank you for your support and trust. We can’t wait to get the Vortix into your hands and hear your feedback!\nStay tuned for more updates soon. The journey of Vortix is just getting started!\nBest regards,\nVortix Team",
        "url": "https://www.kickstarter.com/projects/82605225/vortix-titanium-turbo-fan-turn-on-the-turbulence/posts/4312381",
        "likes_count": 11,
        "comments_count": 0,
        "comments": []
      }
    ]
  }
}