{
  "url": "https://www.kickstarter.com/projects/makeblock/xtool-apparel-printer-a-new-era-of-apparel-printing",
  "updates": {
    "count": 2,
    "content": [
      {
        "update_number": "UPDATE #2",
        "title": "2.5 Million Stretch Goal Release, Get High-Quality Skin-Safe Ink & Film Roll!",
        "creator": "xTool\nFebruary 22, 2025",
        "date": "February 22, 2025",
        "content": "Hi Backers,\n  Your incredible support has propelled the xTool Apparel Printer to new heights, and we're thrilled to unveil our first stretch goal at the $2.5 million milestone—a CMYKW ink set (five bottles, 500ml each) and 25 meters of film roll for every backer! \nOur ink uses high-quality Japanese imported resin, enhancing ink flow and reducing printhead clogging, thereby extending the lifespan of the printhead. Additionally, it improves the stretchability of printed patterns on fabrics, making your apparel durable and long-lasting. \n  Moreover, our ink and film are OEKO-TEX certified, meeting ecological and health standards. This means they are safe for people and the environment, and have no harmful effects for direct skin contact.\nCurious about the exciting gifts awaiting us at the next stretch goal? Help us reach $2.5 million to uncover the surprise!\n  Sincerely,\nxTool Team",
        "url": "https://www.kickstarter.com/projects/makeblock/xtool-apparel-printer-a-new-era-of-apparel-printing/posts/4319754",
        "likes_count": 21,
        "comments_count": 5,
        "comments": [
          {
            "text": "Does this mean that you get 7 bottles in total if you paid the $50 deposit?",
            "commenter": "Danielle",
            "timestamp": "February 24, 2025 4:20 AM AWST",
            "datetime": "1740342052",
            "relative_time": "1 day ago"
          },
          {
            "text": "I just pledged my balance in full @$6339.00 for one of the better packages. Being new to Kick Starter, I do not know what a \"Stretch Goal\" is and does that mean I owe more money to receive the ink and paper?",
            "commenter": "Josh Clark",
            "timestamp": "February 22, 2025 10:38 PM AWST",
            "datetime": "1740235092",
            "relative_time": "2 days ago"
          },
          {
            "text": "Hi Josh, thank you for supporting us! A stretch goal is a traditional Kickstarter activity: If the campaign's total sales reach a specified target, all backers receive an additional gifts. Our first stretch goal target is $2.5 million. If we reach this target, each backer will receive five bottles of ink and 25 meters of film. You don't need to pay extra to get those gifts once the sales target is reached.",
            "commenter": "xTool",
            "timestamp": "February 23, 2025 9:34 PM AWST",
            "datetime": "1740317646",
            "relative_time": "1 day ago"
          },
          {
            "text": "So now for backers due to reaching another goal they will get ink and roll of paper?",
            "commenter": "Anita Haney",
            "timestamp": "February 22, 2025 10:44 AM AWST",
            "datetime": "1740192265",
            "relative_time": "3 days ago"
          },
          {
            "text": "Yes, once we reach 2.5M, all backers who complete their final purchase will receive 25 meters of film and the corresponding ink",
            "commenter": "xTool",
            "timestamp": "February 22, 2025 11:32 AM AWST",
            "datetime": "1740195140",
            "relative_time": "3 days ago"
          }
        ]
      },
      {
        "update_number": "UPDATE #1",
        "title": "🚀 xTool Apparel Printer: $1 Million in 1.5 Hours! Entering a New Age!",
        "creator": "xTool\nFebruary 21, 2025",
        "date": "February 21, 2025",
        "content": "Dear xTool Family,\n  We are absolutely thrilled to announce that the xTool Apparel Printer project has skyrocketed past $1,000,000 in just 1.5 Hours! This incredible milestone is a testament to your unwavering support and belief in our vision. Over 200 passionate creators from across the globe have joined the apparel printing revolution, and we couldn't be more grateful.\n  Maker's Review Is Here! 🎥\nWant to see the xTool Apparel Printer in action? See Kim and Garrett sharing their honest reviews, revealing the current status of the machine: The Surprising Truth About xTool Apparel DTF Printing Nobody Tells You\n    Stay Connected for Exclusive Updates and Community Insights! 🔥\nBe the first to know about the latest updates, tips, and exclusive offers:\n        Thank you for being part of this incredible journey. Your support fuels our passion to innovate and create！\n  With immense gratitude and excitement,\nThe xTool Team",
        "url": "https://www.kickstarter.com/projects/makeblock/xtool-apparel-printer-a-new-era-of-apparel-printing/posts/4319703",
        "likes_count": 5,
        "comments_count": 0,
        "comments": []
      }
    ]
  }
}