{
  "url": "https://www.kickstarter.com/projects/makeblock/xtool-apparel-printer-a-new-era-of-apparel-printing",
  "updates": {
    "count": 5,
    "content": [
      {
        "update_number": "UPDATE #5",
        "title": "Beta Testers' Feedback Revealed & 6-Day Countdown for Printer Solo Super Early Bird!",
        "creator": "xTool\nMarch 6, 2025",
        "date": "March 6, 2025",
        "content": "Dear Backers,\nPlease be aware that our Super Early Bird Standalone Bundle will officially close on March 11th. This is your last chance to secure the xTool Apparel Printer solo at the lowest price of $3,999. After the bundle closes, the price will increase by $500. If you're still on the fence, seize this final 6-day opportunity to take advantage of this best offer.\n    Beta Testers' Reviews Are In\nWe know you're excited to see the xTool Apparel Printer in action! To give you a better idea, we've collected real-world feedback from our beta testers:\n    Printer self-maintenance is real—it's never been this effortless!\n@Kurtis: \"How I clean it? I have let mine sit for an entire week and not printed anything All I did was hit the head cleaning three times and started printing...\"\nClick to watch the full video\n    Does the one click feature really work as described?\n@Kurtis: \"I am thoroughly impressed with the one click print feature when combined with the Shaker oven, as it allowed me to simply hit print and within a few minutes I was able to start pressing them on the t-shirts...\"\nClick to watch the demo video\n  Batch printing can also be done with just one click. @Michele shared an accelerated video of the batch printing and baking process：\nClick to watch the full video\n    More Exciting Features to Explore\n@Karina unveils her top 10 favorite features, showcasing the machine's versatility.\n  @Todd provides an in-depth look at print differences across various DPI settings. Click to learn more\n  Comprehensive Close Look at the Real Machine\n@Todd also recorded a comprehensive video introducing the machine's appearance and the entire printing and baking process:\n    We're incredibly grateful for our beta testers' invaluable feedback – it's truly shaping the xTool Apparel Printer for an efficient and smooth user experience!\nEager to see more? Join our community! It's the perfect place to connect with fellow backers and stay updated on our progress.\nFree Gifts Await at $4M Stretch Goal! Help Us Reach It!\nWe've already reached $3M in sales and are close to unlocking the $4M stretch goal. Share the campaign and help us reach the goal to win a free 100-meter film roll, 1 kg of baking powder, and a Printer cleaning kit!\n  Thank you for your support,\nThe xTool Team",
        "url": "https://www.kickstarter.com/projects/makeblock/xtool-apparel-printer-a-new-era-of-apparel-printing/posts/4329615",
        "likes_count": 3,
        "comments_count": 0,
        "comments": []
      },
      {
        "update_number": "UPDATE #4",
        "title": "EU Backers: Chance to Save Up to 27% with VAT (Value Added Tax) Exemption for SMBs!",
        "creator": "xTool\nFebruary 28, 2025",
        "date": "February 28, 2025",
        "content": "Dear EU Backers,\nGreat news! If you have a registered business, your pledge for the xTool Apparel Printer may qualify for VAT (Value Added Tax) exemption, potentially saving you up to 27%!\n  Here’s how to check and claim your exemption:\nSimply email xTool Support support@info.xtool.com with the following information:\nKickstarter order screenshot\nBusiness license/proof\nRegistered company name\nVAT ID\nCountry\nOur team will guide you through the quick verification process.\n  Questions?\nDrop a comment below ⬇️ or send us a direct message (DM). We're here to help!\nDon’t miss this opportunity to save on your xTool Apparel Printer!\n  Best regards,\nThe xTool Team",
        "url": "https://www.kickstarter.com/projects/makeblock/xtool-apparel-printer-a-new-era-of-apparel-printing/posts/4325072",
        "likes_count": 3,
        "comments_count": 5,
        "comments": [
          {
            "text": "is this just for EU customers or USA as well?",
            "commenter": "Raghu Sanikommu",
            "timestamp": "February 28, 2025 9:42 PM AWST",
            "datetime": "1740750155",
            "relative_time": "10 days ago"
          },
          {
            "text": "Mandé un email a support y a Vicky pero no obtuve respuesta. Es ese el proceso correcto?",
            "commenter": "Patricia",
            "timestamp": "February 28, 2025 2:17 PM AWST",
            "datetime": "1740723431",
            "relative_time": "10 days ago"
          },
          {
            "text": "Hi Patricia, I’ve already reminded the support team to respond to your email as soon as possible. Please be patient while you wait",
            "commenter": "xTool",
            "timestamp": "February 28, 2025 5:23 PM AWST",
            "datetime": "1740734603",
            "relative_time": "10 days ago"
          },
          {
            "text": "How do we get the tax break",
            "commenter": "Cathleen Freeman",
            "timestamp": "February 28, 2025 11:16 AM AWST",
            "datetime": "1740712579",
            "relative_time": "10 days ago"
          },
          {
            "text": "Dear Freeman, The amount you pledged does not include taxes. Taxes will be applied after you’ve made your payment on Kickstarter, and when we are preparing to ship your product, they will be collected through Pledgebox. If you submit the required information to xTool's support in advance, we won’t charge you taxes through Pledgebox later.",
            "commenter": "xTool",
            "timestamp": "February 28, 2025 4:50 PM AWST",
            "datetime": "1740732622",
            "relative_time": "10 days ago"
          }
        ]
      },
      {
        "update_number": "UPDATE #3",
        "title": "We Unlocked Free Ink & Film! Next Up: $4M Stretch Goal!",
        "creator": "xTool\nFebruary 25, 2025",
        "date": "February 25, 2025",
        "content": "Dear xTool Family,\n  We're absolutely thrilled to announce that thanks to the incredible support of our 453 backers, we've surpassed $2.5 million! Congratulations to everyone—you've unlocked our first stretch goal: Free High-Quality Skin-Safe Ink & Film! 🥳 Each xTool Apparel Printer you ordered will now include five 500ml bottles of ink and 25 meters of film.\n  Help Us Reach $4 Million & Win $294 Worth of Gifts!\nWe're excited to reveal our next stretch goal: Reach $4,000,000 and Win $197 Worth of Gifts! 🤩\nIf we hit this milestone, every backer will receive:\n100 meters of film roll\n1 kg of baking powder\nPrinter cleaning kit (cleaner, droppers, cotton swabs, tubes, cleaning cloths, syringes, and an extra 500ml moisturizing liquid to keep your printheads moisturized)\nThese gifts, combined with those from the first stretch goal, provide you with all the consumables needed to start creating apparel right away!\n  Let's work together to unlock this incredible reward! Share the campaign with your friends and family and help us reach the $4 million goal.\n  We're constantly working on new updates, in-depth reviews, and live testing demos. Stay tuned for more exciting news! 🚀 🎊\n  Sincerely,\nThe xTool Team",
        "url": "https://www.kickstarter.com/projects/makeblock/xtool-apparel-printer-a-new-era-of-apparel-printing/posts/4322276",
        "likes_count": 18,
        "comments_count": 3,
        "comments": [
          {
            "text": "I am excited to get this apparel printer. I love the fact that I don't have to apply the powder myself and risk getting in my lungs. Thanks xTool for another great product.",
            "commenter": "Becky Christensen",
            "timestamp": "March 7, 2025 1:36 AM AWST",
            "datetime": "1741282590",
            "relative_time": "4 days ago"
          },
          {
            "text": "I would like to see at least a year of printheads warranty with the hit of the 4 million.",
            "commenter": "David",
            "timestamp": "February 28, 2025 3:32 AM AWST",
            "datetime": "1740684753",
            "relative_time": "11 days ago"
          },
          {
            "text": "I am really excited about the xTool Apparel Printer and was looking forward to receiving it. However, after reviewing the additional costs, I realized that the VAT and import taxes for the Netherlands are too high, making it difficult for me to afford the total amount. Unfortunately, due to these extra costs, Im thinking about it to cancel my pledge. I truly hope that in the future, you will be able to offer shipping from a European store or warehouse, which would make it much more accessible for customers like me",
            "commenter": "Danielle",
            "timestamp": "February 25, 2025 8:04 PM AWST",
            "datetime": "1740485073",
            "relative_time": "13 days ago"
          }
        ]
      },
      {
        "update_number": "UPDATE #2",
        "title": "2.5 Million Stretch Goal Release, Get High-Quality Skin-Safe Ink & Film Roll!",
        "creator": "xTool\nFebruary 22, 2025",
        "date": "February 22, 2025",
        "content": "Hi Backers,\n  Your incredible support has propelled the xTool Apparel Printer to new heights, and we're thrilled to unveil our first stretch goal at the $2.5 million milestone—a CMYKW ink set (five bottles, 500ml each) and 25 meters of film roll for every backer! \nOur ink uses high-quality Japanese imported resin, enhancing ink flow and reducing printhead clogging, thereby extending the lifespan of the printhead. Additionally, it improves the stretchability of printed patterns on fabrics, making your apparel durable and long-lasting. \n  Moreover, our ink and film are OEKO-TEX certified, meeting ecological and health standards. This means they are safe for people and the environment, and have no harmful effects for direct skin contact.\nCurious about the exciting gifts awaiting us at the next stretch goal? Help us reach $2.5 million to uncover the surprise!\n  Sincerely,\nxTool Team",
        "url": "https://www.kickstarter.com/projects/makeblock/xtool-apparel-printer-a-new-era-of-apparel-printing/posts/4319754",
        "likes_count": 26,
        "comments_count": 6,
        "comments": [
          {
            "text": "Does this mean that you get 7 bottles in total if you paid the $50 deposit?",
            "commenter": "Danielle",
            "timestamp": "February 24, 2025 4:20 AM AWST",
            "datetime": "1740342052",
            "relative_time": "15 days ago"
          },
          {
            "text": "Yes, that's correct!",
            "commenter": "xTool",
            "timestamp": "February 25, 2025 11:40 AM AWST",
            "datetime": "1740454814",
            "relative_time": "13 days ago"
          },
          {
            "text": "I just pledged my balance in full @$6339.00 for one of the better packages. Being new to Kick Starter, I do not know what a \"Stretch Goal\" is and does that mean I owe more money to receive the ink and paper?",
            "commenter": "Josh Clark",
            "timestamp": "February 22, 2025 10:38 PM AWST",
            "datetime": "1740235092",
            "relative_time": "16 days ago"
          },
          {
            "text": "Hi Josh, thank you for supporting us! A stretch goal is a traditional Kickstarter activity: If the campaign's total sales reach a specified target, all backers receive an additional gifts. Our first stretch goal target is $2.5 million. If we reach this target, each backer will receive five bottles of ink and 25 meters of film. You don't need to pay extra to get those gifts once the sales target is reached.",
            "commenter": "xTool",
            "timestamp": "February 23, 2025 9:34 PM AWST",
            "datetime": "1740317646",
            "relative_time": "15 days ago"
          },
          {
            "text": "So now for backers due to reaching another goal they will get ink and roll of paper?",
            "commenter": "Anita Haney",
            "timestamp": "February 22, 2025 10:44 AM AWST",
            "datetime": "1740192265",
            "relative_time": "16 days ago"
          },
          {
            "text": "Yes, once we reach 2.5M, all backers who complete their final purchase will receive 25 meters of film and the corresponding ink",
            "commenter": "xTool",
            "timestamp": "February 22, 2025 11:32 AM AWST",
            "datetime": "1740195140",
            "relative_time": "16 days ago"
          }
        ]
      },
      {
        "update_number": "UPDATE #1",
        "title": "🚀 xTool Apparel Printer: $1 Million in 1.5 Hours! Entering a New Age!",
        "creator": "xTool\nFebruary 21, 2025",
        "date": "February 21, 2025",
        "content": "Dear xTool Family,\n  We are absolutely thrilled to announce that the xTool Apparel Printer project has skyrocketed past $1,000,000 in just 1.5 Hours! This incredible milestone is a testament to your unwavering support and belief in our vision. Over 200 passionate creators from across the globe have joined the apparel printing revolution, and we couldn't be more grateful.\n  Maker's Review Is Here! 🎥\nWant to see the xTool Apparel Printer in action? See Kim and Garrett sharing their honest reviews, revealing the current status of the machine: The Surprising Truth About xTool Apparel DTF Printing Nobody Tells You\n    Stay Connected for Exclusive Updates and Community Insights! 🔥\nBe the first to know about the latest updates, tips, and exclusive offers:\n        Thank you for being part of this incredible journey. Your support fuels our passion to innovate and create！\n  With immense gratitude and excitement,\nThe xTool Team",
        "url": "https://www.kickstarter.com/projects/makeblock/xtool-apparel-printer-a-new-era-of-apparel-printing/posts/4319703",
        "likes_count": 6,
        "comments_count": 0,
        "comments": []
      }
    ]
  }
}