{
  "url": "https://www.kickstarter.com/projects/dfe/fantasy-and-steampunk-eco-village-and-themepark-ph",
  "campaign_details": {
    "funding_period_text": "Funding period\nJul 11 2014 - Aug 10 2014 (30 days)",
    "funding_start_date": "2014-07-10T19:53:37-04:00",
    "funding_end_date": "2014-08-09T19:53:37-04:00",
    "funding_duration_days": 30,
    "pledged_amount": "S$ 717",
    "funding_goal": "S$ 100,038",
    "backers_count": "13"
  },
  "updates": {
    "count": 5,
    "content": [
      {
        "update_number": "UPDATE #5",
        "title": "Update 5",
        "creator": "Dougharty Family Enterprises\nAugust 7, 2014",
        "date": "August 7, 2014",
        "content": "This is it, folks....from fantasy to the reality.....there are only a few hours left.  Join us on our Facebook page as we continue to develop the project. While we have had a few snags along the way, we have also met many wonderful people here. We hope you will stay with us. And many thanks to all who have shared and pledged. We are just getting started.",
        "url": "https://www.kickstarter.com/projects/dfe/fantasy-and-steampunk-eco-village-and-themepark-ph/posts/943270",
        "likes_count": 0,
        "comments_count": 0,
        "comments": []
      },
      {
        "update_number": "UPDATE #4",
        "title": "Follow the project!",
        "creator": "Dougharty Family Enterprises\nAugust 5, 2014",
        "date": "August 5, 2014",
        "content": "Hello and Thank You to all who have pledged. Barring a miracle we realize that we are not going to reach our goal this week. We so appreciate the support you have given us and the new friends we have found. We will be running a new campaign but probably not on Kickstarter. If you would still like to be part of our project and help us make this happen, we want to invite you to our new Facebook page: \n https://www.facebook.com/pages/Fantasy-And-Steampunk-Theme-Park/343179765838189\nWe will continue to update the progress there and will post when we start a new funding campaign. We hope you will follow and continue your support. We have found a perfect parcel of land but will need a lot of help to get it funded. The sooner it's funded, the more quickly we can get amenities in to get started. \nThere will be some of the same rewards and some brand new ones we weren't allowed to use here. We will be offering discounts and event passes among others.",
        "url": "https://www.kickstarter.com/projects/dfe/fantasy-and-steampunk-eco-village-and-themepark-ph/posts/939591",
        "likes_count": 0,
        "comments_count": 0,
        "comments": []
      },
      {
        "update_number": "UPDATE #3",
        "title": "Look here!",
        "creator": "Dougharty Family Enterprises\nJuly 18, 2014",
        "date": "July 18, 2014",
        "content": "Finally we have a few images for you. We are concentrating on getting the land and then adding the amenities. These are what we have planned for this project:\n A tree bordered LARP field.\n One of two shower and restroom towers.\n A frames in the camping field....each with it's own firepit.\n And vardos in the wheel...12 of them! All for rent during events or just for a vacation.\nRemember this is just phase one. There is so much more to come. Be sure to add your pledge to choose the next area we develop.",
        "url": "https://www.kickstarter.com/projects/dfe/fantasy-and-steampunk-eco-village-and-themepark-ph/posts/917731",
        "likes_count": 1,
        "comments_count": 0,
        "comments": []
      },
      {
        "update_number": "UPDATE #2",
        "title": "Update 2",
        "creator": "Dougharty Family Enterprises\nJuly 17, 2014",
        "date": "July 17, 2014",
        "content": "We are starting a contest: Those who pledge a dollar or more will get to vote on what area of the theme park gets funded next. We will give you a list of areas and you will vote After the pledging closes. We will see who wants this the most. Fantasy....Renaissance....Steampunk.....Halflings and Elves....Fairies....Farmers.... The more you put in the more votes you get, you pledge a dollar in you get 1 vote, and for every ten dollars pledged you get another vote. so if you decide that you want to pledge $200 and get your name next to a fruit tree you will also get 21 votes(one vote for the first dollar and 20 votes for every dollar after) if you want to pledge $30 dollars and do not want any of the rewards but still would like your votes just choose the $1 or more reward and you will get the allotted votes for the amount on money you have pledged.                                     \nthose of you that have already pledged will recive your votes as well",
        "url": "https://www.kickstarter.com/projects/dfe/fantasy-and-steampunk-eco-village-and-themepark-ph/posts/916378",
        "likes_count": 1,
        "comments_count": 1,
        "comments": [
          {
            "text": "Correction: one vote for the first dollar and 1 additional vote for every 10 dollars",
            "commenter": "Dougharty Family Enterprises",
            "timestamp": "August 2, 2014 4:01 AM AWST",
            "datetime": "1406923302",
            "relative_time": "over 10 years ago"
          }
        ]
      },
      {
        "update_number": "UPDATE #1",
        "title": "Here it is folks! The whole shebang!",
        "creator": "Dougharty Family Enterprises\nJuly 14, 2014",
        "date": "July 14, 2014",
        "content": "Remember, we are just funding the first phase...getting the land and the LARP field , camping and vardos...aaaannd the well!\n100 acre plan.\nFor perspective, the parking area on the left is approximately 15 acres. The Steampunk corner is the upper left quadrant.  As you can see, this dream is grand! But let's start with just a corner of it and get it going!\nThe land and this part is the current project.\n The 'wheel' is the vardo neighborhood. A bath house and tower with water and restrooms will be one of the first amenities provided. A frame platforms for the camping area next to the LARP field will make events there more comfortable. The barn and pony pasture will be funded through the rental of the vardos, camping area and events held in the LARP area. The restrooms will have composting toilets. Grey water will irrigate landscape shrubs and trees.",
        "url": "https://www.kickstarter.com/projects/dfe/fantasy-and-steampunk-eco-village-and-themepark-ph/posts/911784",
        "likes_count": 1,
        "comments_count": 0,
        "comments": []
      }
    ]
  }
}