{
  "url": "https://www.kickstarter.com/projects/johanneitlhuber/love-forge",
  "campaign_details": {
    "funding_period_text": "Funding period\nDec 20 2023 - Jan 19 2024 (30 days)",
    "funding_start_date": "2023-12-19T13:18:07-05:00",
    "funding_end_date": "2024-01-18T13:18:07-05:00",
    "funding_duration_days": 30,
    "pledged_amount": "S$ 516",
    "funding_goal": "S$ 94,360",
    "backers_count": "6"
  },
  "updates": {
    "count": 2,
    "content": [
      {
        "update_number": "UPDATE #2",
        "title": "An alle Betrüger da draußen...",
        "creator": "Johann Eitlhuber\nDecember 27, 2023",
        "date": "December 27, 2023",
        "content": "I'm amazed. It was perhaps foreseeable that my project wouldn't be a hit. But what I personally had to learn in the meantime is that 99% of all people who write to me are after my money and want to take it out of my pocket. I am being made so many offers that are so dubious and certainly fraudulent that I am on the verge of losing faith in the good in people.\nI will wait another week and then delete the project if there is no change. And to all the scammers out there, leave me alone!\nI will post a counteroffer afterwards. If someone wants to sell me something, these are my conditions.\n\nIch bin erstaunt. Das mein Projekt nicht der Knaller wird, war vielleicht abzusehen. Aber was ich persönlich mittlerweile lernen musste, 99% aller Leute die mich anschreiben, haben es auf mein Geld abgesehen und wollen es mir aus der Tasche ziehen. Es werden mir so viele Angebote gemacht, die so unseriös und mit Sicherheit auch betrügerisch sind, dass ich kurz davor bin, den Glauben an das Gute im Menschen zu verlieren. \nIch werde noch eine Woche abwarten und dann das Projekt löschen, wenn sich keine Veränderung einstellt. Und an alle Betrüger da draußen, lasst mich in Ruhe!\nIm Anschluss werde ich ein Gegenangebot posten. Falls mir einer was andrehen will, dass sind meine Bedingungen.",
        "url": "https://www.kickstarter.com/projects/johanneitlhuber/love-forge/posts/3994866",
        "likes_count": 0,
        "comments_count": 0,
        "comments": []
      },
      {
        "update_number": "UPDATE #1",
        "title": "tentative start...zaghafter Start",
        "creator": "Johann Eitlhuber\nDecember 21, 2023",
        "date": "December 21, 2023",
        "content": "First day over and we were able to touch the first hearts. I thank you a thousand times over for your donation. We know that it is not natural to give money without something in return. You are my heroes for this! \nHopefully other hearts and heroes will follow your example :)\n Greetings from Johann E.\n\nErster Tag vorbei und wir konnten die ersten Herzen berühren. Ich danke euch für eure Spende tausendfach. Wir wissen, dass es nicht selbstverständlich ist Geld zu geben ohne eine Gegenleistung. Ihr seid dafür meine Helden! \nHoffentlich folgen Eurem Beispiel weitere Herzen und Helden  :)\nGrüße von Johann E.",
        "url": "https://www.kickstarter.com/projects/johanneitlhuber/love-forge/posts/3991878",
        "likes_count": 0,
        "comments_count": 0,
        "comments": []
      }
    ]
  }
}